import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "hn-arz-e-ahwaal",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "",
  titleRo: "",
  titleHi: "",
  titleEn: "",
  versesHi: [
    { ur: { m1: "عرضِ اَحوال کی پیاسوں میں کہاں تاب مگر", m2: "آنکھیں اے اَبر ِکرم تکتی ہیں رَستا تیرا" }, hi: { m1: "अरज़-ए-अहवाल की प्यासों में कहाँ ताब मगर", m2: "आँखें ऐ अब्र-ए-करम तकती हैं रस्ता तेरा" } },
    { ur: { m1: "موت نزدیک گناہوں کی تَہیں مَیل کے خول", m2: "آ برس جا کہ نہا دھو لے یہ پیاسا تیرا" }, hi: { m1: "मौत नज़दीक गुनाहों की तहें मैल के ख़ोल", m2: "आ बरस जा कि नहा धो ले यह प्यासा तेरा" } },
    { ur: { m1: "آب آمد وہ کہے اور میں تیمم برخاست", m2: "مُشتِ خاک اپنی ہو اور نُور کا اَہلا تیرا" }, hi: { m1: "आब आमद वो कहे और मैं तयम्मुम बरख़ास्त", m2: "मुश्त-ए-ख़ाक अपनी हो और नूर का अहला तेरा" } },
    { ur: { m1: "جان تو جاتے ہی جائے گی قیامت یہ ہے", m2: "کہ یہاں مرنے پہ ٹھہرا ہے نظّارہ تیرا" }, hi: { m1: "जाँ तो जाते ही जाएगी क़यामत यह है", m2: "कि यहाँ मरने पह ठहरा है नज़्ज़ारा तेरा" } },
    { ur: { m1: "تجھ سے در,درسے سگ اورسگ سےہےمجھ کونسبت", m2: "میری گردن میں بھی ہے دُور کا ڈورا تیرا" }, hi: { m1: "तुझ से दर, दर से सग और सग से है मुझ को निस्बत", m2: "मिरी गर्दन में भी है दूर का डोरा तेरा" } },
    { ur: { m1: "اس نشانی کے جو سگ ہیں نہیں مارے جاتے", m2: "حَشْر تک میرے گلے میں رہے پٹّا تیرا" }, hi: { m1: "इस निशानी के जो सग हैं नहीं मारे जाते", m2: "हश्र तक मिरे गले में रहे पट्टा तेरा" } },
    { ur: { m1: "میری قسمت کی قَسَم کھائیں سگانِ بغداد", m2: "ہِند میں بھی ہُوں تو دیتا رہوں پہرا تیرا" }, hi: { m1: "मिरी क़िस्मत की क़सम खाएँ सगान-ए-बग़दाद", m2: "हिंद में भी हूँ तो देता रहूँ पहरा तेरा" } },
    { ur: { m1: "تیری عزّت کے نثار اے مِرے غیرت والے", m2: "آہ صد آہ کہ یُوں خوار ہو   ِبروا تیرا" }, hi: { m1: "तेरी इज़्ज़त के निसार ऐ मिरे ग़ैरत वाले", m2: "आह सद आह कि यूँ ख़्वार हो बरवा तेरा" } }
  ],
};

export default kalam;
