import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "hn-tu-ne-islam-diya",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "",
  titleRo: "",
  titleHi: "",
  titleEn: "",
  versesHi: [
    { ur: { m1: "ُ تو نے اِسلام دیا ُ تو نے جماعت میں لیا", m2: "ُ تو کریم اب کوئی پھرتا ہے عطیَّہ تیرا" }, hi: { m1: "तू ने इस्लाम दिया तू ने जमाअत में लिया", m2: "तू करीम अब कोई फिरता है अतिय्या तेरा" } },
    { ur: { m1: "موت  ُسنتا ہوں سِتَم تَلْخ ہے زہرا بۂ ناب", m2: "کون لا دے مجھے َتلووں کا غَسالہ تیرا" }, hi: { m1: "मौत सुनता हूँ सितम तलख़ है ज़हरा-ब-नाब", m2: "कौन ला दे मुझे तलवों का ग़ुसाला तेरा" } },
    { ur: { m1: "دُور کیا جانئیے بدکار پہ کیسی گزرے", m2: "تیرے ہی در پہ مَرے بیکس و تنہا تیرا" }, hi: { m1: "दूर क्या जानिए बदकार पह कैसी गुज़रे", m2: "तेरे ही दर पह मरे बेकस-ओ-तन्हा तेरा" } },
    { ur: { m1: "تیرے صدقے مجھے اِک بوند بہت ہے تیری", m2: "جس دِن اَچّھوں کو مِلے جام چھلکتا تیرا" }, hi: { m1: "तेरे सदक़े मुझे इक बूँद बहुत है तेरी", m2: "जिस दिन अच्छों को मिले जाम छलकता तेरा" } },
    { ur: { m1: "حرم و طیبہ و بغداد جدھر کیجئے نِگاہ", m2: "َ جوت پڑتی ہے تِری نور ہے  َ چھنتا تیرا" }, hi: { m1: "हरम-ओ-तैयबा-ओ-बग़दाद जिधर कीजिए निगाह", m2: "जोत पड़ती है तिरी नूर है छनता तेरा" } },
    { ur: { m1: "تیری سرکار میں لاتا ہے رضاؔ اُس کو شفیع", m2: "جو مِرا غوث ہے اور لاڈلا بیٹا تیرا" }, hi: { m1: "तेरी सरकार में लाता है रज़ा उस को शफ़ी", m2: "जो मिरा ग़ौस है और लाड़ला बेटा तेरा" } }
  ],
};

export default kalam;
