import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "hn-waah-kya-jood-o-karam",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وصلِ اَوّل دَر نعت ِاکرم حضور سید عالم",
  titleRo: "",
  titleHi: "",
  titleEn: "",
  versesHi: [
    { ur: { m1: "واہ کیا  ُجود و کرم ہے شَہِ بَطْحا تیرا", m2: "نہیں ُسنتا ہی نہیں مانگنے والا تیرا" }, hi: { m1: "वाह क्या जूद-ओ-करम है शह-ए-बत्हा तेरा", m2: "नहीं सुनता ही नहीं माँगने वाला तेरा" } },
    { ur: { m1: "دھارے چلتے ہیں عطا کے وہ ہے قطرہ تیرا", m2: "تارے کِھلتے ہیں  َ َسخا کے وہ ہے ذَرّہ تیرا" }, hi: { m1: "धारे चलते हैं अता के वो है क़तरा तेरा", m2: "तारे खिलते हैं सख़ा के वो है ज़र्रा तेरा" } },
    { ur: { m1: "فیض ہے یا شَہِ تسنیم نِرالا تیرا", m2: "آپ پیاسوں کے تَجَسُّس میں ہے دریا تیرا" }, hi: { m1: "फ़ैज़ है या शह-ए-तस्नीम निराला तेरा", m2: "आप प्यासों के तजस्सुस में है दरिया तेरा" } },
    { ur: { m1: "اَغنیا پلتے ہیں دَر سے وہ ہے باڑا تیرا", m2: "اَصفیا چلتے ہیں سر سے وہ ہے رَستا تیرا" }, hi: { m1: "अग्निया पलते हैं दर से वो है बाड़ा तेरा", m2: "असफ़िया चलते हैं सर से वो है रस्ता तेरा" } }
  ],
};

export default kalam;
