import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "hn-waah-kya-martaba-ay-ghaus",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وصل دوم در منقبت آقائے اکرم حضور غوثِ اعظم",
  titleRo: "",
  titleHi: "",
  titleEn: "",
  versesHi: [
    { ur: { m1: "واہ کیا مرتبہ اے غوث ہے بالا تیرا", m2: "اُونچے اُونچوں کے سَروں سے قدَم اعلیٰ تیرا" }, hi: { m1: "वाह क्या मर्तबा ऐ ग़ौस है बाला तेरा", m2: "ऊँचे ऊँचों के सरों से क़दम-ए-आला तेरा" } },
    { ur: { m1: "سر بھلا کیا کوئی جانے کہ ہے کیسا تیرا", m2: "اولیا ملتے ہیں آنکھیں وہ ہے تلوا تیرا" }, hi: { m1: "सर भला क्या कोई जाने कि है कैसा तेरा", m2: "औलिया मिलते हैं आँखें वो है तलवा तेरा" } },
    { ur: { m1: "کیا دَبے جس پہ حِمایت کا ہو پنجہ تیرا", m2: "شیر کو خطرے میں لاتا نہیں کُتّا تیرا" }, hi: { m1: "क्या दबे जिस पह हिमायत का हो पंजा तेरा", m2: "शेर को ख़तरे में लाता नहीं कुत्ता तेरा" } },
    { ur: { m1: "تُو حُسینی حَسَنی کیوں نہ محی الدّیں ہو", m2: "اے خِضَر مَجْمَعِ بَحْرَیْن ہے چشمہ تیرا" }, hi: { m1: "तू हुसैनी हसनी क्यों न मुहियुद्दीन हो", m2: "ऐ ख़िज़र मजमउल-बहरीन है चश्मा तेरा" } },
    { ur: { m1: "قسمیں دے دے کے کھلاتا ہے پلاتا ہے تجھے", m2: "پیارا اللہ تِرا چاہنے والا تیرا" }, hi: { m1: "क़समें दे दे के खिलाता है पिलाता है तुझे", m2: "प्यारा अल्लाह तिरा चाहने वाला तेरा" } },
    { ur: { m1: "مصطفیٰ کے تن ِبے سایہ کا سایہ دیکھا", m2: "جس نے دیکھا مری جاں جلوۂ زیبا تیرا" }, hi: { m1: "मुस्तफ़ा के तन-ए-बे-साया का साया देखा", m2: "जिस ने देखा मिरी जाँ जल्वा-ए-ज़ैबा तेरा" } },
    { ur: { m1: "اِبنِ زَہرا کو مبارک ہو عَروسِ قدرت", m2: "قادِری پائیں تصدّق مرے دُولہا تیرا" }, hi: { m1: "इब्न-ए-ज़हरा को मुबारक हो अरूस-ए-क़ुदरत", m2: "क़ादिरी पाएँ तसद्दुक़ मिरे दूल्हा तेरा" } },
    { ur: { m1: "کیوں نہ قاسِم ہو کہ تُو ابنِ ابی القاسم ہے", m2: "کیوں نہ قادِر ہو کہ مختار ہے بابا तेरा" }, hi: { m1: "क्यों न क़ासिम हो कि तू इब्न-ए-अबिल-क़ासिम है", m2: "क्यों न क़ादिर हो कि मुख़्तार है बाबा तेरा" } },
    { ur: { m1: "نبوی مینھ علوی فصل بتولی گلشن", m2: "حَسنی پھول حُسینی ہے مہکنا تیرا" }, hi: { m1: "नबवी मैंह अलवी फ़स्ल बतौली गुलशन", m2: "हसनी फूल हुसैनी है महकना तेरा" } },
    { ur: { m1: "نبوی ظِل عَلوی برج بتولی منزل", m2: "حَسنی چاند حُسینی ہے اُجالا تیرا" }, hi: { m1: "नबवी ज़िल्ल अलवी बुरज बतौली मंज़िल", m2: "हसनी चाँद हुसैनी है उजाला तेरा" } },
    { ur: { m1: "نبوی خُور عَلَوی کوہ بتولی مَعْدِن", m2: "حَسنی لعل حُسینی ہے تجلّا تیرا" }, hi: { m1: "नबवी ख़ूर अलवी कोह बतौली मादिन", m2: "हसनी लाल हुसैनी है तजल्ला तेरा" } },
    { ur: { m1: "بحروبر شہر و قُریٰ سہل و حُزُن دشت و چمن", m2: "کون سے چَک پہ پہنچتا نہیں دعویٰ تیرا" }, hi: { m1: "बहर-ओ-बर शहर-ओ-क़ुरा सहल-ओ-हुज़ुन दश्त-ओ-चमन", m2: "कौन से चक पह पहुँचता नहीं दावा तेरा" } },
    { ur: { m1: "حُسنِ نیّت ہو خطا پھر کبھی کرتا ہی نہیں", m2: "آزمایا ہے یگانہ ہے دوگانہ تیرا" }, hi: { m1: "हुस्न-ए-निय्यत हो ख़ता फिर कभी करता ही नहीं", m2: "आज़माया है यगाना है दोगाना तेरा" } }
  ],
};

export default kalam;
