import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "ur-arz-e-ahwaal",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: "عرضِ اَحوال کی پیاسوں میں کہاں تاب مگر", m2: "آنکھیں اے اَبر ِکرم تکتی ہیں رَستا تیرا" },
    { m1: "موت نزدیک گناہوں کی تَہیں مَیل کے خول", m2: "آ برس جا کہ نہا دھو لے یہ پیاسا تیرا" },
    { m1: "آب آمد وہ کہے اور میں تیمم برخاست", m2: "مُشتِ خاک اپنی ہو اور نُور کا اَہلا تیرا" },
    { m1: "جان تو جاتے ہی جائے گی قیامت یہ ہے", m2: "کہ یہاں مرنے پہ ٹھہرا ہے نظّارہ تیرا" },
    { m1: "تجھ سے در,درسے سگ اورسگ سےہےمجھ کونسبت", m2: "میری گردن میں بھی ہے دُور کا ڈورا تیرا" },
    { m1: "اس نشانی کے جو سگ ہیں نہیں مارے جاتے", m2: "حَشْر تک میرے گلے میں رہے پٹّا تیرا" },
    { m1: "میری قسمت کی قَسَم کھائیں سگانِ بغداد", m2: "ہِند میں بھی ہُوں تو دیتا رہوں پہرا تیرا" },
    { m1: "تیری عزّت کے نثار اے مِرے غیرت والے", m2: "آہ صد آہ کہ یُوں خوار ہو   ِبروا تیرا" }
  ],
};

export default kalam;
