import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "ur-farsh-waale-teri-shaukat",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: "فرش والے تِری شوکت کا عُلو کیا جانیں", m2: "خُسروا عرش پہ اُڑتا ہے پَھریرا تیرا" },
    { m1: "آسماں خوان، زمیں خوان، زمانہ مہمان", m2: "صاحبِ خانہ لقب کس کا ہے تیرا تیرا" },
    { m1: "میں تو مالِک ہی کہوں گا کہ ہو مالِک کے حبیب", m2: "یعنی محبوب و محب میں نہیں میرا تیرا" },
    { m1: "تیرے قدموں میں جو ہیں غیر کا منہ کیا دیکھیں", m2: "کون نظروں پہ چڑھے دیکھ کے تلوا تیرا" },
    { m1: "بحر سائل کا ہوں سائل نہ کنوئیں کا پیاسا", m2: "خود بجھا جائے کلیجا مِرا چھینٹا تیرا" },
    { m1: "چور حاکم سے چھپا کرتے ہیں یاں اس کے خلاف", m2: "تیرے دامن میں چُھپے چور انوکھا تیرا" },
    { m1: "آنکھیں ٹھنڈی ہوں جگر تازے ہوں جانیںسیراب", m2: "سچّے سورج وہ دِل آرا ہے اُجالا تیرا" },
    { m1: "دِل عبث خوف سے پتّا سا اُڑا جاتا ہے", m2: "پلّہ ہلکا سہی بھاری ہے بھروسا تیرا" },
    { m1: "ایک میں کیا مِرے عِصیاں کی حقیقت کتنی", m2: "مجھ سے سو لاکھ کو کافی ہے اِشارہ تیرا" },
    { m1: "مُفت پالا تھا کبھی کام کی عادت نہ پڑی", m2: "اب عمل پوچھتے ہیں ہائے نِکمَّا تیرا" },
    { m1: "تیرے ٹکڑوں سے پلے غیر کی ٹھوکر پہ نہ ڈال", m2: "جِھڑکیاں کھائیں کہاں چھوڑ کے صَدقہ تیرا" },
    { m1: "خوار و بیمار و خطا وار و گنہ گار ہوں میں", m2: "رافع و نافع و شافع لقب آقا تیرا" },
    { m1: "میری تقدیر بُری ہو تو بھلی کر دے کہ ہے", m2: "محو و اثبات کے دفتر پہ کڑوڑا تیرا" },
    { m1: "تُو جو چاہے تو ابھی میل مرے دل کے دُھلیں", m2: "کہ خُدا دِل نہیں کرتا کبھی مَیلا تیرا" },
    { m1: "کس کا منہ تکیے کہاں جائیے کس سے کہیے", m2: "تیرے ہی قدموں پہ مِٹ جائے یہ پالا تیرا" }
  ],
};

export default kalam;
