import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "ur-tu-ne-islam-diya",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: "ُ تو نے اِسلام دیا ُ تو نے جماعت میں لیا", m2: "ُ تو کریم اب کوئی پھرتا ہے عطیَّہ تیرا" },
    { m1: "موت  ُسنتا ہوں سِتَم تَلْخ ہے زہرا بۂ ناب", m2: "کون لا دے مجھے َتلووں کا غَسالہ تیرا" },
    { m1: "دُور کیا جانئیے بدکار پہ کیسی گزرے", m2: "تیرے ہی در پہ مَرے بیکس و تنہا تیرا" },
    { m1: "تیرے صدقے مجھے اِک بوند بہت ہے تیری", m2: "جس دِن اَچّھوں کو مِلے جام چھلکتا تیرا" },
    { m1: "حرم و طیبہ و بغداد جدھر کیجئے نِگاہ", m2: "َ جوت پڑتی ہے تِری نور ہے  َ چھنتا تیرا" },
    { m1: "تیری سرکار میں لاتا ہے رضاؔ اُس کو شفیع", m2: "جو مِرا غوث ہے اور لاڈلا بیٹا تیرا" }
  ],
};

export default kalam;
