import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "ur-waah-kya-martaba-ay-ghaus",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وصل دوم در منقبت آقائے اکرم حضور غوثِ اعظم",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: "واہ کیا مرتبہ اے غوث ہے بالا تیرا", m2: "اُونچے اُونچوں کے سَروں سے قدَم اعلیٰ تیرا" },
    { m1: "سر بھلا کیا کوئی جانے کہ ہے کیسا تیرا", m2: "اولیا ملتے ہیں آنکھیں وہ ہے تلوا تیرا" },
    { m1: "کیا دَبے جس پہ حِمایت کا ہو پنجہ تیرا", m2: "شیر کو خطرے میں لاتا نہیں کُتّا تیرا" },
    { m1: "تُو حُسینی حَسَنی کیوں نہ محی الدّیں ہو", m2: "اے خِضَر مَجْمَعِ بَحْرَیْن ہے چشمہ تیرا" },
    { m1: "قسمیں دے دے کے کھلاتا ہے پلاتا ہے تجھے", m2: "پیارا اللہ تِرا چاہنے والا تیرا" },
    { m1: "مصطفیٰ کے تن ِبے سایہ کا سایہ دیکھا", m2: "جس نے دیکھا مری جاں جلوۂ زیبا تیرا" },
    { m1: "اِبنِ زَہرا کو مبارک ہو عَروسِ قدرت", m2: "قادِری پائیں تصدّق مرے دُولہا تیرا" },
    { m1: "کیوں نہ قاسِم ہو کہ تُو ابنِ ابی القاسم ہے", m2: "کیوں نہ قادِر ہو کہ مختار ہے بابا तेरा" },
    { m1: "نبوی مینھ علوی فصل بتولی گلشن", m2: "حَسنی پھول حُسینی ہے مہکنا تیرا" },
    { m1: "نبوی ظِل عَلوی برج بتولی منزل", m2: "حَسنی چاند حُسینی ہے اُجالا تیرا" },
    { m1: "نبوی خُور عَلَوی کوہ بتولی مَعْدِن", m2: "حَسنی لعل حُسینی ہے تجلّا تیرا" },
    { m1: "بحروبر شہر و قُریٰ سہل و حُزُن دشت و چمن", m2: "کون سے چَک پہ پہنچتا نہیں دعویٰ تیرا" },
    { m1: "حُسنِ نیّت ہو خطا پھر کبھی کرتا ہی نہیں", m2: "آزمایا ہے یگانہ ہے دوگانہ تیرا" }
  ],
};

export default kalam;
