import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-1c9df86d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "راہِ عرفاں سے جو ہم نادیدہ رو محرم نہیں",
  titleRo: "",
  versesUr: [
      "راہِ عرفاں سے جو ہم نادیدہ رو محرم نہیں",
      "مصطفٰے ہے مَسندِ ارشاد پر کچھ غم نہیں",
      "ہُوں مسلماں گرچہ ناقِص ہی سہی اے کامِلو!",
      "ماہیت پانی کی آخر یَم سے نَم میں کم نہیں",
      "غنچے   مَا اَوْحٰی  کے  جو  چٹکے  دَنٰی  کے  باغ  میں",
      "بلبلِ سدرہ تک اُن کی بُو سے بھی محرم نہیں",
      "اُس میں زم زم(1)ہے کہ تھم تھم اس میں جم جم(2)ہے کہ بیش",
      "کثرتِ کوثر میں زم زم کی طرح کم کم(3)نہیں",
      "پنجۂ مہر عرب ہے جس سے دریا بہہ گئے",
      "چشمۂ خورشید میں تو نام کو بھی نم نہیں",
      "ایسا اُمّی کس لئے منت کشِ اُستاد ہو",
      "کیا  کفایت  اس  کو    اِقْرَأ   رَبُّکَ  الْاَکْرَمْ   نہیں",
      "اَوس مہرِ حَشْر پر پڑ جائے پیاسو تو سہی",
      "اُس گلِ خنداں کا رونا گریۂ شبنم نہیں",
      "ہے اُنھیں کے دم قدم کی باغِ عالم میں بہار",
      "وہ نہ تھے عالم نہ تھا گر وہ نہ ہوں عالَم نہیں",
      "سایۂ دیوار و خاکِ دَر ہو یاربّ اور رضاؔ",
      "خواہشِ دَیْہِیْمِ قیصر، شوقِ تخت جم نہیں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
