import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2e6bc406",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "رو رو کے شفاعت کی تمہید اُٹھائی ہے",
  titleRo: "",
  versesUr: [
      "رو رو کے شفاعت کی تمہید اُٹھائی ہے",
      "اے دل یہ سلگنا کیا جلنا ہے تو جل بھی اُٹھ",
      "دَم گھٹنے لگا ظالِم کیا دُھونی رَمائی ہے",
      "مجرم کو نہ شرمائو احباب کفن ڈَھک دو",
      "مُنھ دیکھ کے کیا ہو گا پردے میں بھلائی ہے",
      "اب آپ ہی سنبھالیں تو کام اپنے سنبھل جائیں",
      "ہم نے تو کمائی سب کھیلوں میں گنوائی ہے",
      "اے عشق تِرے صَدقے جلنے سے چُھٹے سَستے",
      "جو آگ بجھا دے گی وہ آگ لگائی ہے",
      "حرص و ہوسِ بَد سے دل تُو بھی سِتَم کر لے",
      "تُو ہی نہیں بے گانہ دُنیا ہی پَرائی ہے",
      "ہم دِل جلے ہیں کس کے ہٹ فتنوں کے پر کالے",
      "کیوں پُھونک دُوں اِک اُف سے کیا آگ لگائی ہے",
      "طیبہ نہ سہی اَفضل مَکّہ ہی بڑا زاہِد",
      "ہم عِشق کے بندے ہیں کیوں بات بڑھائی ہے",
      "مَطْلَع  میں  یہ  شک  کیا  تھا    واللّٰہ  رضاؔ   واللّٰہ",
  ],
};

export default kalam;
