import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-94a55906",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یاالٰہی رحم فرما مصطفیٰ کے واسطے",
  titleRo: "",
  versesUr: [
      "یاالٰہی رحم فرما مصطفیٰ کے واسطے",
      "یارسول   اللّٰہ   کرم  کیجے   خدا  کے  واسطے",
      "مشکلیں حل کر شہ مشکل کشا کے واسطے",
      "کر بَلائیں رد شہیدِ کربلا کے واسطے",
      "سیّدِ سجاد کے صدقے میں ساجِد رکھ مجھے",
      "علم حق دے باقرِ علمِ ہُدی کے واسطے",
      "صدقِ صادق کا تصدّق صادِق الاسلام کر",
      "بے غضب راضی ہوکاظم اور رضا کے واسطے",
      "بہر معروف و سری معروف دے بے خود سَری",
      "جندِ حق میں گِن جنید با صفا کے واسطے",
      "بہرِ شبلی شیرِ حق دُنیا کے کتّوں سے بچا",
      "ایک  کا  رکھ  عبدِ  واحد  بے  رِیا  کے  واسطے",
      "بوالفرح کا صَدقہ کر غم کو فرح دے حسن و سعد",
      "بوالحسن اور بوسعیدِ سعد زا کے واسطے",
      "قادِری کر قادِری رکھ قادِریوں میں اُٹھا",
      "قدرِ عبدالقادرِ قدرت نما کے واسطے",
      "اَحْسَنَ اﷲ لَہُمْ رِزْقًا سے دے رزقِ حسن",
      "بندئہ رزّاق تاجُ الاصفیا کے واسطے",
      "نصْر ابی صَالح کا صَدقہ صَالح و منصور رکھ",
      "د ے حیاتِ دیں مُحیِّ جاں فزا کے واسطے",
  ],
};

export default kalam;
