import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-cc5666d3",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "گنہ گاروں کو ہاتِف سے نوید خوش مآلی ہے",
  titleRo: "",
  versesUr: [
      "گنہ گاروں کو ہاتِف سے نوید خوش مآلی ہے",
      "مُبارک ہو شفاعت کے لئے احمد سا والی ہے",
      "قضا حق ہے مگر اس  شوق  کا   اللّٰہ   والی ہے",
      "جو اُن کی راہ میں جائے وہ جان  اللّٰہ والی ہے",
      "تِرا قدِّ مبارک گلبنِ رحمت کی ڈالی ہے",
      "اسے بو کر ترے ربّ نے بِنا رحمت کی ڈالی ہے",
      "تمہاری شرم سے شانِ جلال حق ٹپکتی ہے",
      "خمِ گردن ہلالِ آسمانِ ذُوالجلالی ہے",
      "زہے خود گم جو گم ہونے پہ یہ ڈھونڈے کہ کیا پایا",
      "ارے جب تک کہ پانا ہے جبھی تک ہاتھ خالی ہے",
      "میں اِک محتاج بے وقعت گدا تیرے سگِ در کا",
      "تری سرکار والا ہے تِرا دربار عالی ہے",
      "تِری بخشِش پَسندی، عُذر جوئی، توبہ خواہی سے",
      "عمومِ بے گناہی، جرم شانِ لا اُبالی ہے",
      "ابو بکر و عمر عثمان و حیدر جس کے بلبل ہیں",
      "تِرا سروِ سہی اس گُلْبُنِ خوبی کی ڈالی ہے",
      "رضاؔ قِسمت ہی کُھل جائے جو گیلاں سے خطاب آئے",
      "کہ تُو اَدنیٰ سگِ دَرگاہِ خُدَّامِ مَعالی ہے",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
