import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-9b318f88",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "پُوچھتے کیا ہو عَرش پر یوں گئے مصطفٰے کہ یوں",
  titleRo: "",
  versesUr: [
      "پُوچھتے کیا ہو عَرش پر یوں گئے مصطفٰے کہ یوں",
      "کیف کے پر جہاں جلیں کوئی بتائے کیا کہ یوں",
      "قصرِ دنیٰ کے راز میں عقلیں تو گُم ہیں جیسی ہیں",
      "رُوحِ قُدس سے پوچھیے تم نے بھی کچھ سُنا کہ یوں",
      "میں نے کہا کہ جلوئہ اصل میں کس طرح گمیں",
      "صبح نے نورِ مہر میں مِٹ کے دِکھا دِیا کہ یوں",
      "ہائے رے ذوقِ بے خودی دل جو سنبھلنے سا لگا",
      "چھک کے مہک میں پھول کی گِرنے لگی صبا کہ یوں",
      "دِل کو دے نُور و داغِ عِشق پھر میں فدا دو نیم کر",
      "مانا ہے سُن کے شقِّ ماہ آنکھوں سے اب دِکھا کہ یوں",
      "دل کو ہے فِکر کس طرح مُردے جِلاتے ہیں حضور",
      "اے میں فدا لگا کر ایک ٹھوکر اِسے بتا کہ یوں",
      "باغ میں شکرِ وصل تھا ہجر میں ہائے ہائے گل",
      "کام ہے ان کے ذِکر سے خیر وہ یوں ہوا کہ یوں",
      "جو کہے شعر و پاسِ شرع دونوں کا حُسن کیوں کر آئے",
  ],
};

export default kalam;
