import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-a2f9c7f1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہم خاک ہیں اور خاک ہی ماوا ہے ہمارا",
  titleRo: "",
  versesUr: [
      "ہم خاک ہیں اور خاک ہی ماوا ہے ہمارا",
      "ہم(1) خاک ہیں اور خاک ہی مَاوا ہے ہمارا",
      "اللّٰہ  ہمیں خاک کرے اپنی طلب میں",
      "خاکی تو وہ آدم جَد اَعلیٰ ہے ہمارا",
      "جس خاک پہ رکھتے تھے قدم سیِّد عالم",
      "یہ خاک تو سرکار سے تمغا ہے ہمارا",
      "خم ہو گئی پشتِ فلک اس طعنِ زَمیں سے",
      "اُس خاک پہ قرباں دلِ شیدا ہے ہمارا",
      "اس نے لقبِ خاک شہنشاہ سے پایا",
      "سن ہم پہ مَدینہ ہے وہ رتبہ ہے ہمارا",
      "اے مدّعیو! خاک کو تم خاک نہ سمجھے",
      "جو حیدرِ کرّار کہ مولیٰ ہے ہمارا",
      "ہے خاک سے تعمیر مزارِ شہِ کونین",
      "اس خاک میں مدفوں شہِ بطحا ہے ہمارا",
      "ہم خاک اڑائیں گے جو وہ خاک نہ پائی",
      "معمور اِسی خاک سے قبلہ ہے ہمارا",
      "*…*…*…*…*…*",
      "آباد رضاؔ جس پہ مدینہ ہے ہمارا",
  ],
};

export default kalam;
