import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-bc9707b1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "آنکِہ پایَش بر رِقابِ اَولیائے عالَم اَسْت",
  titleRo: "",
  versesUr: [
      "آنکِہ پایَش بر رِقابِ اَولیائے عالَم اَسْت",
      "و  آنکہ  اِیں  فَرمود  حق  فرمود    بِاللّٰہ   آں  توئی",
      "اَندَرِیں قول آنْچِہ تخصِیصاتِ بِیجا کَردَہ اَند",
      "از زَلَل یا ازضَلالت پاک ازاں بُہتاں توئی",
      "بہرِ پایَت خواجۂ ہِنداں شہِ کَیواں جناب",
      "بَلْ عَلٰی عَیْنِی وَ رَأْسِی  گُویَد  آں خاقاں توئی",
      "آں کہ از بَیتُ المقدس تا دَرَتْ یک گام داشت",
      "باز خود آں کِشْتِ آتِش دِیدَہ را نَیساں توئی",
      "رَہرَوانِ قُدس اگر آنجا نہ بِینَنْدَت رَوا سْتْ",
      "از تو رہ می پُرسَد و منْجِیَش از نقصاں توئی",
      "سبز   خِلْعَت   با  طِرازِ     قُلْ  ہُوَ   اللّٰہ  اَحَد",
      "زانکِہ اندر حجلَۂ قُدسی نہ در مَیداں توئی",
      "آں  مُکَرَّم   را  کہ  بخشِید  ار  نہ   در  اِیواں  توئی",
  ],
};

export default kalam;
