import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-e5349025",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "نامۂ خود گر سِیَہ کَردَم سِیہ تر کردَہ گِیر",
  titleRo: "",
  versesUr: [
      "نامۂ خود گر سِیَہ کَردَم سِیہ تر کردَہ گِیر",
      "بلکہ زِینْساں صَد دِگر ہم چوں مہِ رَخشاں توئی",
      "گُم چہ شُد گر ریزہ گَشْتَم نگْ بَدَسْتَت مُومیا",
      "کم چہ شد گر سُوختم خود چشمۂ حیواں توئی",
      "سخت ناکَس مَردَ کے اَم گر نہ رَقْصَم شاد شاد",
      "چوں  شُنِیدَم   ہِمْ طِبْ وَاشْطَحْ وَغَن  گویاں  توئی",
      "وقت گوہر خوش اگر دَریاش در دل جائے داد",
      "غَرْقَہ خَس را ہم نہ بِینَد خَس مَنَم عُمّاں توئی",
      "کوہِ مَن کاہسْتْ اگر دَسْتے دِہی وقتِ حساب",
      "کاہِ من کوہسْتْ اگر بر پلّۂ میزاں توئی",
  ],
};

export default kalam;
