import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2a8397e6",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "صَلَوَاتُ اللّٰہ وَ سَلَامُہٗ عَلَیْہِ وَعَلٰی اٰلِہِ الْاَطْہَار",
  titleRo: "",
  versesUr: [
      "صَلَوَاتُ اللّٰہ وَ سَلَامُہٗ عَلَیْہِ وَعَلٰی اٰلِہِ الْاَطْہَار",
      "یا خدا بہرِ جنابِ مصطفیٰ امداد کُن",
      "یا   رسولَ   اللّٰہ     از   بہرِ   خدا    امداد  کُن",
      "یا   اَمانَ   الخائفیں    یا   ملتجے   امداد  کُن",
      "حِرْزَ مَنْ  لَا حِرْزَ  لَہٗ  یَا  کَنْزَ مَنْ  لَا کَنْزَ  لَہٗ",
      "عِزَّ  مَنْ   لَا  عِزَّ  لَہٗ    یَا   مُرتجے   امداد  کُن",
      "اے بہارِ اِبتِدا و اِنتِہا امداد کن",
      "اے پناہِ بِیکَساں اے غَمزِدا امداد کُن",
      "اے غَنی اے مُغْنی اے صاحبِ حیا امداد کن",
      "نعمتِ بے مِحْنَتا اے مِنَّتِ بے مُنْتَہیٰ",
      "رَحمَتا بے زَحمَتا عینِ عطا امداد کن",
      "نَیِّرَا  نُوْرُ الْہُدیٰ  بَدْرُ الدُّجیٰ  شَمْسُ  الضُّحٰی",
      "اے   رُخَت  آئینۂ   ذاتِ  خدا  امداد  کن",
      "اے گَدایَت جن و اِنس و حور و غِلمان و مَلک",
      "وَے فِدایَت عرش و فرش اَرض و سَما امداد کن",
      "اے قریشی ہاشِمی طَیبی تِہامی اَبْطَحِی",
  ],
};

export default kalam;
