import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d95950b5",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مومن وہ ہے جو اُن کی عزّت پہ مَرے دِل سے",
  titleRo: "",
  versesUr: [
      "مومن وہ ہے جو اُن کی عزّت پہ مَرے دِل سے",
      "تعظیم بھی کرتا ہے نجدی تو مَرے دل سے",
      "واللّٰہ  وہ سُن لیں گے فریاد کو پہنچیں گے",
      "اِتنا بھی تو ہو کوئی جو آہ کرے دل سے",
      "بچھڑی ہے گلی کیسی بگڑی ہے بنی کیسی",
      "پوچھو کوئی یہ صَدمہ ارمان بھرے دل سے",
      "کیا اس کو گِرائے دہر جس پَر تُو نظر رکھے",
      "خاک اُس کو اٹھائے حشر جو تیرے گرے دل سے",
      "بہکا ہے کہاں مجنوں لے ڈالی بنوں کی خاک",
      "دم بھر نہ کیا خیمہ لیلیٰ نے پَرے دل سے",
      "سونے کو تپائیں جب کچھ مِیل ہو یا کچھ مَیل",
      "کیا کام جہنم کے دَھرے کو کھرے دل سے",
      "آتا ہے درِ والا یُوں ذوقِ طواف آنا",
      "دل جان سے صدقے ہو سر گرِد پھرے دل سے",
      "اے ابرِ کرم فریاد فریاد جَلا ڈالا",
      "اس سوزشِ غم کو ہے ضِد میرے ہرے دل سے",
      "دریا ہے چڑھا تیرا کتنی ہی اڑائیں خاک",
      "اُتریں گے کہاں مجرم اے عفو ترے دل سے",
      "کیا جانیں یِم غم میں دِل ڈُوب گیا کیسا",
      "کِس تہ کو گئے ارماں اب تک نہ تِرے دل سے",
      "کرتا تو ہے یاد اُن کی غفلت کو ذرا روکے",
      "لِلّٰہ  رضا ؔ دل سے ہاں دل سے ارے دل سے",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
