import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4b504ca5",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "گو شُیُوخَت را تَواں گُفت از رہِ اِلقائے نور",
  titleRo: "",
  versesUr: [
      "گو شُیُوخَت را تَواں گُفت از رہِ اِلقائے نور",
      "کافْتابانَنْدْ اِیشان و مَہِ تاباں توئی",
      "لیک  سیرِ  شاں   بُود  بر  مُستقر   و   از  کُجا",
      "آں ترقیِ مَنازِل کانْدَراں ہر آں توئی",
      "ماہِ  مَنْ  لَّا یَنْبَغِیْ   لِلشَّمْسِ  اِدْرَاکُ الْقَمَر (1)",
      "خاصہ چوں از  عَادَ کَالْعُرْجُوْں(2) در اِطْمِیناںتوئی",
      "کُور چشمِ بد چہ می بالی پَری بودی ہلال",
      "دی قَمر گَشتی و اِمْشَب بَدر و بہتر زاں توئی",
  ],
};

export default kalam;
