import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d6a5a776",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "جوہرِ فردِ عزّت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "جوہرِ فردِ عزّت پہ لاکھوں سلام",
      "سِرِّ غیبِ ہدایت پہ غیبی درود",
      "عطرِ جَیبِ نِہایت پہ لاکھوں سلام",
      "ماہِ لاہُوتِ خَلْوَت پہ لاکھوں درود",
      "شاہِ ناسُوتِ جَلْوَت پہ لاکھوں سلام",
      "کَنزِ ہر بے کس و بے نوا پر درود",
      "حِرزِ ہر رَفتہ طاقت پہ لاکھوں سلام",
      "پَرتَوِ اسمِ ذاتِ اَحد پر درود",
      "نسخۂ جامِعِیَّت پہ لاکھوں سلام",
      "مَطلعِ ہر سعادت پہ اَسْعَد درود",
      "مَقْطعِ ہر سِیادت پہ لاکھوں سلام",
      "خَلق کے دادْرَس سب کے فریادْرَس",
      "کَہفِ روزِ مصیبت پہ لاکھوں سلام",
      "مجھ سے بے کس کی دولت پہ لاکھوں درود",
      "مجھ سے بے بس کی قوت پہ لاکھوں سلام",
      "شمعِ   بزمِ   دَنٰی    ہُو    میں  گم   کُن    اَنا",
      "شَرْحِ مَتنِ ہُوِیَّت پہ لاکھوں سلام",
      "اِنتہائے دوئی اِبتِدائے یکی",
  ],
};

export default kalam;
