import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-e2bec1c4",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مرغِ فردَوس پس اَز حمدِ خدا تیری ہی مَدْح و ثنا کرتے ہیں",
  titleRo: "",
  versesUr: [
      "مرغِ فردَوس پس اَز حمدِ خدا تیری ہی مَدْح و ثنا کرتے ہیں",
      "اُنگلیاں پائیں وہ پیاری پیاری جن سے دریائے کرم ہیں جاری",
      "جوش پر آتی ہے جب غم خواری تشنے سیراب ہوا کرتے ہیں",
      "ہاں یہیں کرتی ہیں چڑیاں فریاد ہاں یہیں چاہتی ہے ہرنی داد",
      "اِسی در پر شترانِ ناشاد گلۂ رنج و عنا کرتے ہیں",
      "آستیں رحمتِ عالم الٹے کمرِ پاک پہ دامن باندھے",
      "گِرنے والوں کو چَہِ دوزخ سے صاف الگ کِھینچ لیا کرتے ہیں",
      "جب صبا آتی ہے طیبہ سے اِدھر کِھلکِھلا پڑتی ہیں کلیاں یکسر",
      "پھول جامہ سے نِکل کر باہر رُخِ رنگیں کی ثنا کرتے ہیں",
      "تُو ہے وہ بادشہ کون و مکاں کہ ملک ہفت فلک کے ہرآں",
      "تیرے مولیٰ سے شہِ عرش ایواں تیری دولت کی دُعا کرتے ہیں",
      "جس کے جلوے سے اُحد ہے تاباں معدنِ نور ہے اس کا داماں",
      "ہم بھی اس چاند پہ ہو کر قرباں دلِ سنگیں کی جِلا کرتے ہیں",
      "کیوں نہ زیبا ہو تجھے تا جوری تیرے ہی دم کی ہے سب جلوہ گری",
      "ملک و جن و بشر حور و پری جان سب تجھ پہ فدا کرتے ہیں",
      "ٹُوٹ پڑتی ہیں بلائیں جن پر جن کو ملتا نہیں کوئی یاور",
      "ہر طرف سے وہ پُر ارماں پھر کر اُن کے دامن میں چھپا کرتے ہیں",
      "لب پر آجاتا ہے جب نامِ جناب منھ میںگُھل جاتا ہے شہدِ نایاب",
      "وجد میں ہو کے ہم اے جاں بیتاب اپنے لب چُوم لیا کرتے ہیں",
      "لب پہ کس منہ سے غمِ الفت لائیں کیا بلا دِل ہے الم جس کا سنائیں",
      "ہم تو ان کے کفِ پا پر مٹ جائیں اُن کے دَرپر جو مٹا کرتے ہیں",
      "اپنے دِل کا ہے اُنہیں سے آرام سونپے ہیں اپنے اُنہیں کو سَب کام",
      "لو لگی ہے کہ اب اس دَر کے غلام چارئہ دردِ رضا کرتے ہیں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
