import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-737b537b",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "کہ میں کیا نہیں ہوں  مُحَمَّدی ! ارے ہاں نہیں ارے ہاں نہیں",
  titleRo: "",
  versesUr: [
      "کہ میں کیا نہیں ہوں  مُحَمَّدی ! ارے ہاں نہیں ارے ہاں نہیں",
      "تِرے آگے یُوں ہیں دَبے لَچے فُصَحَاعرب کے بڑے بڑے",
      "کوئی جانے منھ میں زباں نہیں، نہیں بلکہ جسم میں جاں نہیں",
      "وہ شرف کہ قطع ہیں نسبتیں وہ کرم کہ سب سے قریب ہیں",
      "کوئی کہدو یاس و امید سے وہ کہیں نہیں وہ کہاں نہیں",
      "یہ نہیں کہ خُلد نہ ہو نِکو وہ نِکوئی کی بھی ہے آبرو",
      "مگر اے مدینہ کی آرزو جسے چاہے تو وہ سماں نہیں",
      "ہے اُنہیں کے نور سے سب عیاں ہے اُنہیں کے جلوہ میں سب نہاں",
      "بنے صبح تابش مہر سے رہے پیش مہر یہ جاں نہیں",
      "وہی نورِ حق وہی ظلِّ ربّ ہے انہیں سے سب ہے انہیں کا سب",
      "نہیں ان کی مِلک میں آسماں کہ زمیں نہیں کہ زماں نہیں",
      "وہی لامکاں کے مکیں ہوئے سرِ عرش تخت نشیں ہوئے",
      "وہ نبی ہے جس کے ہیں یہ مکاں وہ خدا ہے جس کا مکاں نہیں",
      "سرِ عرش پر ہے تِری گزر دلِ فرش پر ہے تِری نظر",
      "ملکوت و ملک میں کوئی شے نہیں وہ جو تجھ پہ عیاں نہیں",
      "کروں تیرے نام پہ جاں فدانہ بس ایک جاں دو جہاں فِدا",
      "دو جہاں سے بھی نہیں جی بھرا کروں کیا کروروں جہاں نہیں",
      "تِرا قد تو نادرِ دہر ہے کوئی مِثل ہو تو مِثال دے",
      "نہیں گُل کے پودوں میں ڈالیاں کہ چمن میں سرو چماں نہیں",
      "نہیں جس کے رنگ کا دوسرا نہ تو ہو کوئی نہ کبھی ہوا",
      "کہو اس کو گل کہے کیا بنی کہ گلوں کا ڈھیر کہاں نہیں",
      "کروں مدحِ اہلِ دُوَلْ رضاؔ پڑے اِس بَلا میں مِری بَلا",
      "میں گدا ہوں اپنے کریم کا مِرا دِین پارئہ ناں نہیں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
