import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-0ec4f12b",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہے کلامِ الٰہی میں شَمس و ضُحٰے ترے چہرئہ نور فزا کی قسم",
  titleRo: "",
  versesUr: [
      "ہے کلامِ الٰہی میں شَمس و ضُحٰے ترے چہرئہ نور فزا کی قسم",
      "قسمِ شبِ تار میں راز یہ تھا کہ حبیب کی زلفِ دوتا کی قسم",
      "تِرے خُلْق کو حق نے عظیم کہا تِری خِلْق کو حق نے جمیل کیا",
      "کوئی تجھ سا ہوا ہے نہ ہو گا شہا ترے خالقِ حُسن و ادا کی قسم",
      "وہ خدا نے ہے مرتبہ تجھ کو دیا نہ کسِی کو ملے نہ کسی کو ملا",
      "کہ کلامِ مجید نے کھائی شہا تِرے شہر(1)و کلام (2)و بقا (3)کی قسم",
      "ترا مسندِ ناز ہے عرشِ بریں تِرا محرم راز ہے ُروحِ امیں",
      "تُو ہی سرورِ ہر دو جہاں ہے شہا تِرا مِثل نہیں ہے خدا کی قسم",
      "یہی عرض ہے خالقِ ارض و سما وہ رسول ہیں تیرے میں بندہ تِرا",
      "مجھے ان کے جوار میں دے وہ جگہ کہ ہے خلد کو جس کی صفا کی قسم",
      "تُو ہی بندوں پہ کرتا ہے لطف و عطا ہے تجھی پہ بھروسا تجھی سے دعا",
      "مجھے جلوئہ پاکِ رسول دِکھا تجھے اپنے ہی عِزّو عَلا کی قسم",
      "مِرے گرچہ گناہ ہیں حد سے سِوا مگر ان سے امید ہے تجھ سے رجا",
      "تُو رحیم ہے ان کا کرم ہے گوا وہ کریم ہیں تیری عطا کی قسم",
      "یہی کہتی ہے بلبلِ باغِ جناں کہ رضاؔ کی طرح کوئی سِحر بَیاں",
      "نہیں ہِند میں واصفِ شاہِ ہُدیٰ مجھے شوخیِ طبعِ رضاؔ کی قسم",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
