import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-3504a6fb",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہے لبِ عیسٰی سے جاں بخشی نِرالی ہاتھ میں",
  titleRo: "",
  versesUr: [
      "ہے لبِ عیسٰی سے جاں بخشی نِرالی ہاتھ میں",
      "سنگریزے پاتے ہیں شِیریں مَقالی ہاتھ میں",
      "بے نوائوں کی نِگاہیں ہیں کہاں تحریر دست",
      "رہ گئیں جو پا کے جودِ لایزالی ہاتھ میں",
      "کیا  لکیروں  میں    یَدُ  اللّٰہ    خط  سرو  آسا  لکھا",
      "راہ یوں اس راز لکھنے کی نکالی ہاتھ میں",
      "جُودِ شاہِ کوثر اپنے پیاسوں کا جُویا ہے آپ",
      "کیا عجب اُڑ کر جو آپ آئے پیالی ہاتھ میں",
      "ابر نَیْساں مومنوں کو تِیْغِ عُریاں کفر پر",
      "جمع ہیں شانِ جمالی و جلالی ہاتھ میں",
      "مالکِ کونین ہیں گو پاس کچھ رکھتے نہیں",
      "دو جہاں کی نعمتیں ہیں ان کے خالی ہاتھ میں",
      "سایہ اَفگن سر پہ ہو پرچم الٰہی جُھوم کر",
  ],
};

export default kalam;
