import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-6b2c12c4",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "نظر اِک چمن سے دو چار ہے نہ چمن چمن بھی نثار ہے",
  titleRo: "",
  versesUr: [
      "نظر اِک چمن سے دو چار ہے نہ چمن چمن بھی نثار ہے",
      "عجب اُس کے گل کی بہار ہے کہ بہار بلبلِ زار ہے",
      "نہ دلِ بشر ہی فِگار ہے کہ مَلک بھی اس کا شکار ہے",
      "یہ جہاں کہ ہَژدَہ ہزار ہے جسے دیکھو اس کا ہزار ہے",
      "نہیں سر کہ سجدہ کُناں نہ ہو نہ زباں کہ زَمزَمَہ خواں نہ ہو",
      "نہ وہ دل کہ اس پہ تَپاں نہ ہو نہ وہ سینہ جس کو قرار ہے",
      "وہ ہے بھینی بھینی وہاں مہک کہ بسا ہے عرش سے فرش تک",
      "وہ ہے پیاری پیاری وہاں چمک کہ وہاں کی شب بھی نَہار ہے",
      "کوئی اور پھول کہاں کھلے نہ جگہ ہے جوشِشِ حسن سے",
      "نہ بہار اور پہ رُخ کرے کہ جھپک پلک کی تو خار ہے",
      "یہ سَمَن یہ سوسَن و یاسمن یہ بنفْشَہ سُنبُل و نَسْتَرَن",
      "گل و سَرْوْ و لالہ بھرا چمن وہی ایک جلوہ ہزار ہے",
      "یہ صبا سنک وہ کلی چٹک یہ زباں چہک لبِ جُو چھلک",
      "یہ مہک جھلک یہ چمک دمک سب اسی کے دم کی بہار ہے",
      "وہی جلوہ شہر بَشہر ہے وہی اصلِ عالَم و دَہر ہے",
      "وہی بحر ہے وہی لہر ہے وہی پاٹ ہے وہی دھار ہے",
      "وہ نہ تھا تو باغ میں کچھ نہ تھا وہ نہ ہو تو باغ ہو سب فنا",
      "وہ ہے جان، جان سے ہے بقا وہی بن ہے بن سے ہی بار ہے",
      "یہ ادب کہ بلبلِ بے نوا کبھی کھل کے کر نہ سکے نوا",
      "نہ صبا کو تیز رَوِش روا نہ چھلکتی نہروں کی دھار ہے",
      "بہ ادب جھکالو سرِوِلا کہ میں نام لوں گل و باغ کا",
  ],
};

export default kalam;
