import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4d404c97",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "حُلَّہ پوشِ     شہادت    پہ    لاکھوں   سلام",
  titleRo: "",
  versesUr: [
      "حُلَّہ پوشِ     شہادت    پہ    لاکھوں   سلام",
      "ساقیِ شِیر و شربت پہ لاکھوں سلام",
      "اصلِ    نسلِ  صفا     وجہِ    وَصلِ     خدا",
      "بابِ فصلِ وِلایت پہ لاکھوں سلام",
      "اوّلیں دافِعِ اہلِ رَفْض و خُروج",
      "چارُمی رکنِ ملت پہ لاکھوں سلام",
      "شیرِ   شمشیر   زَن     شاہِ    خَیبر    شِکَن",
      "پَرتَوِ دستِ قدرت پہ لاکھوں سلام",
      "مُومنیں پیشِ فَتح و پسِ فتح سب",
      "حامیِ دین و سنت پہ لاکھوں سلام",
      "جس مسلماں نے دیکھا انھیں اِک نظر",
      "اہلِ خیر و عدالت پہ لاکھوں سلام",
      "جن   کے   دشمن   پہ  لعنت   ہے    اللّٰہ   کی",
      "اس نظر کی بَصارت پہ لاکھوں سلام",
      "باقیِ ساقِیانِ شرابِ طَہور",
      "ان سب اہلِ محبت پہ لاکھوں سلام",
      "اور جتنے ہیں شہزادے اس شاہ کے",
      "زَینِ اہلِ عبادت پہ لاکھوں سلام",
      "اُن کی بالا شرافت پہ اعلیٰ درود",
      "ان سب اہلِ مَکانَت پہ لاکھوں سلام",
      "ان کی والا سِیادت پہ لاکھوں سلام",
  ],
};

export default kalam;
