import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-5e18d3cd",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "تَرزبانیء     مَدح نِگار بذِکر ِبقیہ    ائمۂ   اَطہارودیگر اَولیائے کِبار تاحضرتِ غَوثِیَّت مَدارعَلَیْہِمْ رِضْوَانُ الغَفَّار",
  titleRo: "",
  versesUr: [
      "تَرزبانیء     مَدح نِگار بذِکر ِبقیہ    ائمۂ   اَطہارودیگر اَولیائے کِبار تاحضرتِ غَوثِیَّت مَدارعَلَیْہِمْ رِضْوَانُ الغَفَّار",
      "باقیِ اَسیاد یا سَجّاد یا شاہِ جواد",
      "خضرِ ِارشاد آدمِ آلِ عَبا امداد کن",
      "اے بَقَیدِ ظلم و صَد قیدی زِ بندِ غم کُشا",
      "اے تہِ بے داد و کانِ دادہا امداد کن",
      "از علُومِ خود بَدَفْعِ جَہْلِ ما امداد کن",
      "بہرِ حق ما را طریقِ حق نُما امداد کن",
      "شانِ حلمًا کانِ علمًا جانِ سلماً اَلسَّلام",
  ],
};

export default kalam;
