import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-62750e79",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بَندہ اَم وَالْاَمْرُ اَمْرُکْ آنچہ دانی کُن بمن",
  titleRo: "",
  versesUr: [
      "بَندہ اَم   وَالْاَمْرُ  اَمْرُکْ  آنچہ  دانی  کُن  بمن",
      "مَن نَمی گُویَم مَرا بِگُزار یا اِمداد کن",
      "خانہ زادانِ کریماں گر بَشِدَّت می زَنیْدْ",
      "ایں مَن و اِینک سَرم ورنَے مَرا امداد کن",
      "دَستِ مَن بِگِرفتی و بر تُسْت پاسَش بعد اَزِیں",
      "یا تو دانی یا ہَماں دستِ تو یا امداد کن",
      "گر بَدُوزخ می رَوَم آخر ہَمی گُویند خَلق",
      "کاں رسولی می رَوَد غیرت بَرا امداد کن",
      "عار باشَد بر شَبانِ دِہ اگر ضائع شَوَد",
      "یک  رَسن  دَر  دَشْت  یَا  حَامِیَ الْحُمَیّٰ     امداد  کن",
  ],
};

export default kalam;
