import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-03319982",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "چمک تجھ سے پاتے ہیں سب پانے والے",
  titleRo: "",
  versesUr: [
      "چمک تجھ سے پاتے ہیں سب پانے والے",
      "مِرا دِل بھی چمکا دے چمکانے والے",
      "برستا نہیں دیکھ کر اَبرِ رَحمت",
      "بدوں پر بھی برسا دے برسانے والے",
      "مَدینہ کے خطے خدا تجھ کو رکھے",
      "غریبوں فقیروں کے ٹھہرانے والے",
      "تُو  زندہ  ہے   واللّٰہ  تُو  زندہ  ہے    واللّٰہ",
      "مِرے چشمِ عالَم سے چھپ جانے والے",
      "میں مجرم ہوں آقا مجھے ساتھ لے لو",
      "کہ رَستے میں ہیں جا بجا تھانے والے",
      "حرم کی زَمیں اور قدم رکھ کے چلنا",
      "ارے سر کا موقع ہے اَو جانے والے",
      "چل اُٹھ جبہہ فرسَا ہو ساقی کے در پر",
      "تِرا کھائیں تیرے غُلاموں سے اُلجھیں",
      "رہے گا یوں ہی اُن کا چرچَا رہے گا",
      "ہیں مُنکِر عجب کھانے غُرّانے والے",
      "اب آئی شفاعت کی سَاعت اب آئی",
      "پڑے خاک ہو جائیں جل جانے والے",
      "رضاؔ نفس دشمن ہے دَم میں نہ آنا",
      "ذرا چین لے میرے گھبرانے والے",
      "*…*…*…*…*…*",
      "کہاں تم نے دیکھے ہیں چندرانے والے",
  ],
};

export default kalam;
