import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-1eaa3216",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "شورِ مہِ نو سن کر تجھ تک میں دَواں آیا",
  titleRo: "",
  versesUr: [
      "شورِ مہِ نو سن کر تجھ تک میں دَواں آیا",
      "اس گل کے سوا ہر پھول باگوش گراں آیا",
      "دیکھے ہی گی اے بلبل جب وقتِ فغاں آیا",
      "جب بامِ تجَلّی پر وہ نیّرِ جاں آیا",
      "سر تھا جو گرا جھک کر دل تھا جو تپاں آیا",
      "جنّت کو حَرم سمجھا آتے تو یہاں آیا",
      "طیبہ کے سوا سب باغ پامالِ فنا ہوں گے",
      "اب تک کے ہر اک کا منھ کہتا ہوں کہاں آیا",
      "سر اور وہ سنگِ در آنکھ اور وہ بزمِ نور",
      "دیکھو گے چمن والو! جب عَہْدِ خزاں آیا",
      "کچھ نعت کے طبقے کا عَالم ہی نرالا ہے",
      "ظالم کو وطن کا دھیان آیا تو کہاں آیا",
      "جلتی تھی زمیں کیسی تھی دھوپ کڑی کیسی",
      "سکتہ میں پڑی ہے عقل چکر میں گماں آیا",
      "طیبہ سے ہم آتے ہیں کہیے تو جناں والو",
      "لو وہ قدِ بے سایہ اب سایہ کناں آیا",
      "لے طوقِ اَلم سے اَب آزاد ہو اے قُمری",
      "کیا دیکھ کے جیتا ہے جو واں سے یہاں آیا",
      "نامہ سے رضاؔ کے اَب مٹ جائو بُرے کامو",
      "چٹھی لیے بخشِش کی وہ سَروِ رواں آیا",
      "بدکار رضاؔ خوش ہو بدکام بھلے ہوں گے",
      "دیکھو مِرے پلّہ پَر وہ اَچھے میاں آیا",
      "*…*…*…*…*…*",
      "وہ اَچھے میاں پیارا اَچھوں کا میاں آیا",
  ],
};

export default kalam;
