import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-780fa839",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "گُریز رَبْط آمیز بَسُوئے مَدح ذَوق اَنگیز",
  titleRo: "",
  versesUr: [
      "گُریز رَبْط آمیز بَسُوئے مَدح ذَوق اَنگیز",
      "یا ہُمانا پَرتَوے از شمعِ جیلاں بر تُو تافْتْ",
      "کاینچنیں  از  تابِش  و  تَپ  ہر  دو  با ساماں  توئی",
      "آں شَہے کانْدَرِ پَناہَش حسُن و عشق آسُودَہ اَنْدْ",
      "ہر دو را اِیْما کہ شاہا مَلجاء مایاں توئی",
      "حُسنِ رنگَش عشقِ بُویَش ہر دو بر رُویَش نِثار",
      "اِیں سَرایَد جاں توئی واں نغمہ زَن جاناں توئی",
      "عشق در نازش کہ تا جاناں رسانیدم ترا",
      "حُسن در بالش کہ خود شاخی ز محبوباں توئی",
      "عشق گُفْتَش سَیِّدا بَرخِیز و رُو بر خاک نِہ",
      "حسن گُفت از عرش بِگُزَر پَرتَوِ یَزداں توئی",
      "سَروَرا جاں پَروَرا حیرانم اندر کارِ تو",
      "حیرتم در تو فزوں بادا سرِپنہاں توئی",
      "سوزی اَفروزی گدازی بزِم جاں روشن کنی",
      "شب بَپا اِستادہ گریاں با دل بِریاں توئی",
      "گردِ تو پروانۂ روئے تو یکساں ہر طرف",
      "روشنم شُدْ کَزْ ہَمَہ رُو شمع اَفْروزاں توئی",
      "شہ کریم ست اے رضاؔ در مدح سر کن مطلعے",
      "شکرت بخشد اگر طوطیِ مدحت خواں توئی",
      "پیرِ پیراں میرِ میراں اے شہِ جیلاں توئی",
  ],
};

export default kalam;
