import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-326ae762",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہمزہ بَرَدِیْفِ الف آیَدْ یعنی                خَم کَردَہ قَدَش برائے عبدالقادر",
  titleRo: "",
  versesUr: [
      "ہمزہ بَرَدِیْفِ الف آیَدْ یعنی                خَم کَردَہ قَدَش برائے عبدالقادر",
      "یَا  مَن  بِسَنَاہُ   جَاء  عَبْدُالْقَادِر       یَا  مَنْ  بِشَنَاہُ  یَاء  عَبْدُالْقَادِر",
      "اِذْ  اَنْتَ  جَعَلْتَہٗ  کَمَا  کُنْتَ   تَشَائُ         فَاجْعَلْنِیْ   کَیْفَ    شَائَ   عَبْدُالْقَادِر",
      "اَلدّارُ  وَسِیْعَۃٌ وَ ذُوالدَّارِ کَرِیْمٌ         بوء نَا  حَیْثُ  بَاء  عَبْدُالْقَادِر",
  ],
};

export default kalam;
