import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-51a9d48b",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "حَمْدًا     لَکَ        اے      اِلٰہِ     عبدالقادر",
  titleRo: "",
  versesUr: [
      "حَمْدًا     لَکَ        اے      اِلٰہِ     عبدالقادر",
      "اے مالک و بادشاہِ عبدالقادر",
      "اے خاک بَراہِ تو سَرِ جُملہ سَراں",
      "کُن خاک مَرا بَراہِ عبدالقادر",
      "بے جان و بجانم شَہ عبدالقادر",
      "کَسْ جُزِ تو نَدانم شَہ عبدالقادر",
      "بَدْ بُودَم و بَدْ کَردَم و بر نیکیِ تو",
      "نیک     سْت ْ      گُمانم    شَہ   عبدالقادر",
      "بَہرِ سرِ ہُو تَجْلِیَہ عبدالقادر",
      "ہم تَجْلِیَہ را تَحْلِیَہ عبدالقادر",
      "شَرح    اَست   بَراں   مُنْہِیَہ     عبدالقادر",
      "از عارضہ نیست وجہِ عبدالقادر",
      "ہر کَس شُدہ محبوب بَوَجہِ صِفتے",
      "ذاتی سْتْ وَلائے وجہِ عبدالقادر",
      "عبدالقادر بَوَجہِ عبدالقادر",
      "خور نور سِتَد اَز رَہِ عبدالقادر",
      "ماہ اَست گدائے دَرِ مِہر و اِیں جا",
      "ہم اِذنِ طُلوع از شہِ عبدالقادر",
      "بر اَوج ترقی شُدہ عبدالقادر       تا نامِ خدا",
      "مِہر سْتْ گدائے مَہِ عبدالقادر",
      "خیمہ   مُسْتَنْزَل   زَدہ  عبدالقادر     ناس اَند و ہُدیٰ",
      "بِالجملہ بقرآن رَشاد و اِرشاد      درْ بَدء و خِتام",
  ],
};

export default kalam;
