import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-3524e913",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بَد ہنسیں تم اُن کی خاطر         رات بھر رُوؤ کراہو",
  titleRo: "",
  versesUr: [
      "بَد ہنسیں تم اُن کی خاطر         رات بھر رُوؤ کراہو",
      "بد کریں ہر دم برائی           تم کہو ان کا بھلا ہو",
      "ہم وہی ناشُسْتَہ رُو ہیں          تم وہی بحرِ عطا ہو",
      "ہم وہی شایانِ رَد ہیں          تم وہی شانِ سخا ہو",
      "ہم وہی بے شرم و بد ہیں        تم وہی کانِ حیا ہو",
      "ہم وہی نَنگِ جَفا ہیں           تم وہی جانِ وَفا ہو",
      "ہم وہی قابل سزا کے          تم وہی رحمِ خدا ہو",
      "چَرخ بدلے دَہر بدلے         تم بدلنے سے وَرا ہو",
      "اب ہمیں ہوں سَہْو حاشا       ایسی بھولوں سے جدا ہو",
      "عمر بھر تو یاد رکھا             وقت پر کیا بھولنا ہو",
      "وقتِ پیدایِش نہ بھولے         کَیْفَ یَنْسٰی  کیوں  قضا  ہو",
      "یہ بھی مولیٰ عرض کر دوں        بھول اگر جائو تو کیا ہو",
      "وہ ہو جو تم پر گِراں ہے          وہ ہو جو ہرگز نہ چاہو",
      "وہ ہو جس کا نام لیتے           دشمنوں کا دل برا ہو",
      "وہ ہو جس کے رَد کی خاطر        رات دن وَقْفِ دُعا ہو",
      "مر مٹیں برباد بندے            خانہ آباد آگ کا ہو",
      "شاد ہو اِبلیس مَلْعُوں            غم کسے اس قَہر کا ہو",
      "تم کو  ہو   وَ اللّٰہ   تم  کو            جان و دل تم پر فدا ہو",
      "تم کو غم سے حق بچائے         غم عَدُوّ کو جاں گَزا ہو",
      "تم سے غم کو کیا تعل          بیکسوں کے غم زِدا ہو",
      "حق درُودیں تم پہ بھیجے          تم مُدام اس کو سراہو",
      "وہ عطا دے تم عطا لو          وہ وہی چاہے جو چاہو",
  ],
};

export default kalam;
