import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-5e92d110",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "جلوہ ریزیِ دعوت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "جلوہ ریزیِ دعوت پہ لاکھوں سلام",
      "لُطفِ بیداریِ شب پہ بے حد درود",
      "عالَمِ خوابِ راحت پہ لاکھوں سلام",
      "خَنْدَئہ صبحِ عِشرت پہ نوری درود",
      "گِریۂ ابرِ رحمت پہ لاکھوں سلام",
      "نرمیِ خوئے لِینَتْ پہ دائم درود",
      "گرمیِ شانِ سَطْوَت پہ لاکھوں سلام",
      "جس کے آگے کھنچی گردنیں جھک گئیں",
      "اس خدا داد شوکت پہ لاکھوں سلام",
      "کس کو دیکھا یہ موسیٰ سے پوچھے کوئی",
      "آنکھوں والوں کی ہمت پہ لاکھوں سلام",
      "گردِ مَہ دستِ اَنجم میں رَخشاں ہلال",
      "بدر کی دفعِ ظلمت پہ لاکھوں سلام",
      "شورِ تکبیر سے تھرتھراتی زمیں",
      "جُنبِشِ جَیشِ نصرت پہ لاکھوں سلام",
      "نَعرہائے دِلیراں سے بَن گونجتے",
      "غُرِّشِ کُوسِ جرأت پہ لاکھوں سلام",
      "وہ چَقاچاق خنجر سے آتی صدا",
      "مصطفیٰ تیری صَولَت پہ لاکھوں سلام",
      "اُن کے آگے وہ حمزہ کی جانبازیاں",
  ],
};

export default kalam;
