import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-df31879a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "لِلّٰہ   الْحَمْد   میں  دُنیا  سے  مسلمان  گیا",
  titleRo: "",
  versesUr: [
      "لِلّٰہ   الْحَمْد   میں  دُنیا  سے  مسلمان  گیا",
      "اَور تم پر مِرے آقا کی عنایت نہ سہی",
      "نَجدیو! کلمہ پڑھانے کا بھی اِحسان گیا",
      "آج لے اُن کی پناہ آج مدد مانگ اُن سے",
      "پِھر نہ مانیں گے قِیامت میں اگر مان گیا",
      "اُف رے مُنکِر یہ بڑھا جوشِ تَعَصُّب آخر",
      "بِھیڑ میں ہاتھ سے کمبخت کے اِیمان گیا",
      "جان و دل ہوش و خِرَد سب تو مَدینے پہنچے",
      "تم نہیں چلتے رضاؔ سارا تو سامان گیا",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
