import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-7045831f",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وہ کمالِ حُسنِ حضور ہے کہ گمانِ نَقْص جہاں نہیں",
  titleRo: "",
  versesUr: [
      "وہ کمالِ حُسنِ حضور ہے کہ گمانِ نَقْص جہاں نہیں",
      "یہی پھول خار سے دور ہے یہی شمع ہے کہ دُھواں نہیں",
      "دو جہاں کی بہتریاں نہیں کہ امانیٔ دل و جاں نہیں",
      "کہو کیا ہے وہ جو یہاں نہیں مگر اک ’’نہیں‘‘ کہ وہ ہاں نہیں",
      "میں نثار تیرے کلام پر مِلی یُوں تو کِس کو زباں نہیں",
      "وہ سخن ہے جس میں سخن نہ ہو وہ بیاں ہے جس کا بیاں نہیں",
      "بخدا خدا کا یہی ہے در نہیں اور کوئی مَفَر مَقَر",
      "جو وہاںسے ہو یہیں آکے ہو جو یہاں نہیں تو وہاں نہیں",
      "کرے مصطفیٰ کی اِہانتیں کھلے بندوں اس پہ یہ جرأتیں",
  ],
};

export default kalam;
