import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-fa1ffb06",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "تا کَشیدَم نالۂ یا آلِ احمد اَلْغِیاث",
  titleRo: "",
  versesUr: [
      "تا کَشیدَم نالۂ یا آلِ احمد اَلْغِیاث",
      "بے سر و سامانیم را طُرفہ ساماں آمدَہ",
      "در پناہِ سایۂ دامانَت اے ابرِ کرم",
      "گرمیِ غم کُشتۂ با سوزِ اَحزاں آمدَہ",
      "دل فَگارے آبلہ پائے بَشہرِ جُودِ تو",
      "از بیابانِ بلا اُفتان و خِیزاں آمدَہ",
      "تازہ فریادے برآوَرد اے مَسِیحا بر دَرَتْ",
      "کُہنہ رَنجُورے کہ از غم بر لَبَش جاں آمدَہ",
      "زہر  نوشِ   جامِ  غم   در  حسرتِ   فِیْہِ شِفَاء",
      "زِ اَنگبِینِ رَحمتَتْ یک جُرعہ جُویاں آمدَہ",
      "بہرِ آں رنگیں ادا گل برگ چَند آلِ رسول",
      "بَرکش از دل خارِ آلامے کہ در جاں آمدَہ",
  ],
};

export default kalam;
