import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-bc598e6e",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہٹایا صبحِ رُخ سے شاہ نے شبہائے کاکُل کو",
  titleRo: "",
  versesUr: [
      "ہٹایا صبحِ رُخ سے شاہ نے شبہائے کاکُل کو",
      "پناہِ دَورِ رحمت ہائے یک ساعت تسلسُل کو",
      "دو شنبہ مصطفیٰ کا جمعۂ آدم سے بہتر ہے",
      "سکھانا کیا لحاظِ حیثیت خوئے تأِمُّل کو",
      "وُفورِ شان رحمت کے سبب جرأت ہے اے پیارے",
      "نہ رکھ بہرِ خدا شرمندہ عرضِ بے تأِمُّل کو",
      "پریشانی میں نام ان کا دلِ صَد چاک سے نکلا",
      "اِجابت شانہ کرنے آئی گیسوئے توسُّل کو",
      "رضا ؔ  ُنہ سبزئہ گردُوںہیںکوتَل جس کے مَوْکب کے",
      "کوئی کیا لکھ سکے اس کی سَواری کے تجَمُّل کو",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
