import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-767d59ad",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "زِ بُوئے تو گُلستاں آفریدند",
  titleRo: "",
  versesUr: [
      "زِ بُوئے تو گُلستاں آفریدند",
      "نہ از بہرِ تو صرف اِیمانیانَند             کہ خود بہرِ تو ایماں آفریدند",
      "صَبارا مَست از بُویَت بَہرسو                چُناںاُفتاںوخِیزاںآفریدند",
      "برائے جَلْوئہ یک  گُلبُنِ ناز             ہزاراں باغ و بُستاں آفریدند",
      "زِ مِہْرِ تو مِثالے بَرگرِفْتَندْ               و  زاں  مُہرِ سلیماں آفریدند",
      "چُو اَنگُشتِ تو شُد جَولاں دِہِ بَرْق                  قمر را بہرِ قرباں آفریدند",
      "نہ غیرِ کِبریا جان آفرِیْنے             نہ خود مثلِ تو جاناں آفریدند",
      "پَئے نَظّارئہ محبوبِ لاہُوت              جَبِینَت آئنہ ساں آفریدند",
      "بِنا کَردَند تا قَصرِ رِسالت               تُرا شمعِ شَبستاں آفریدند",
      "زِ مِہْر و چَرخ بہرِ خوانِ جُودَت              عجب قُرص و نمکداں آفریدند",
      "زِ حسنَت تا بہارِ تازہ گل کَرد",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
