import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-b68aabf2",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وصفِ رُخ اُن کا کیا کرتے ہیں شرحِ والشمس وضُحٰے کرتے ہیں",
  titleRo: "",
  versesUr: [
      "وصفِ رُخ اُن کا کیا کرتے ہیں شرحِ والشمس وضُحٰے کرتے ہیں",
      "اُن کی ہم مَدْح و ثنا کرتے ہیں جن کو محمود کہا کرتے ہیں",
      "ماہِ شق گَشْتہ کی صورت دیکھو کانپ کر مہر کی رَجعت دیکھو",
      "مصطفیٰ پیارے کی قدرت دیکھو کیسے اعجاز ہوا کرتے ہیں",
      "تُو ہے خورشیدِ رسالت پیارے چُھپ گئے تیری ضِیا میں تارے",
      "اَنبیا اور ہیں سب مہ پارے تجھ سے ہی نُور لیا کرتے ہیں",
      "اے بَلابے خِرَدیِ کفّار رکھتے ہیں ایسے کے حق میں اِنکار",
      "کہ گواہی ہو گر اُس کو دَرکار بے زباں بول اُٹھا کرتے ہیں",
      "اپنے مولیٰ کی ہے بس شان عظیم جانور بھی کریں جن کی تعظیم",
      "سنگ کرتے ہیں ادب سے تسلیم پیڑ سجدے میںگِرا کرتے ہیں",
      "رِفعت ذِکر ہے تیرا حصّہ دونوں عالم میں ہے تیرا چرچا",
  ],
};

export default kalam;
