import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-e844624c",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "من زِ حق می خواہم اے خورشیدِ حق آں مِہر تو",
  titleRo: "",
  versesUr: [
      "من زِ حق می خواہم اے خورشیدِ حق آں مِہر تو",
      "کَز  ضِیائش  عالَمِ   ایماں   منور  آمدَہ",
      "بہرِ اَستر چادر مَہتاب و ایں زَرّیں پَرَنْد",
      "نا پَذیرائے گلیمِ بختِ قَنبر آمدَہ",
      "تِشنہ کامِ خود رضائے خَستہ را ہم جُرعۂ",
      "شکرِ آں نعمت کہ نامَت شاہِ کوثر آمدَہ",
      "درمَنقبتِ حضرت اچھے میاں صاحب رَحْمَۃُ اللّٰہ عَلَیْہِ",
      "اے بَدَورِ خود امامِ اہلِ اِیقاں آمدَہ",
      "جانِ اِنس و جانِ جانّ و جانِ جاناں آمدَہ",
      "روئے تو خورشیدِ عالَمْتابِ اِیماں آمدَہ",
      "مُوئے زُلفِ عَنْبرِینَتْ قوّتِ رُوحِ ہُدیٰ",
      "رنگِ رُویَت غازَئہ دینِ مسلماں آمدَہ",
      "زنگ از دِلْہا زوایَد خاک بوسیِ دَرَتْ",
      "تابْناک از جلوہ اَت مِرآتِ احساں آمدَہ",
      "صد لَطائف می کُشایَد یک نگاہِ لطفِ تو",
      "دستِ فَیضانَت کَلیدِ بابِ عِرفاں آمدَہ",
      "پُرصَدا شُد باغِ قدس از نغمہائے وصفِ تو",
      "زاں دل از دستِ گُنہ پیشِ تو نالاں آمدَہ",
      "تا بہارِ جنّت از گلزارِ جیلاں آمدَہ",
  ],
};

export default kalam;
