import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-ad2db0f0",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اب  شفاعت  بِالْمَحَبَّت کیجیے",
  titleRo: "",
  versesUr: [
      "اب  شفاعت  بِالْمَحَبَّت کیجیے",
      "اِذن کب کا مِل چکا اب تو حضور",
      "ہم غریبوں کی شفاعت کیجیے",
      "ملحدوں کا شک نِکل جائے حضور",
      "جانب مَہ پھر اِشارت کیجیے",
      "شِرک ٹھہرے جس میں تعظیمِ حبیب",
      "اس بُرے مذہب پہ لعنت کیجیے",
      "ظالمو! محبوب کا حق تھا یہی",
      "عشق کے بدلے عداوت کیجیے",
      "وَالضُّحٰی ، حُجُرَات ، اَلَمْ نَشْرَح  سے پھر",
      "مومنو! اِتمامِ حجت کیجیے",
      "بیٹھتے اُٹھتے حضور پاک سے",
      "التجا و اِستِعانت کیجیے",
      "یا رسول  اللّٰہ   دُہائی  آپ  کی",
      "گوشمالِ اہلِ بدعت کیجیے",
      "غوثِ اعظم آپ سے فریاد ہے",
      "زندہ پھر یہ پاک ملت کیجیے",
      "یاخدا تجھ تک ہے سب کا مُنتہی",
      "اولیا کو حکمِ نصرت کیجیے",
      "میرے آقا حضرتِ اچھے میاں",
      "ہو  رضاؔ  اچھا  وہ  صورت  کیجیے",
      "*…*…*…*…*…*",
      "بسم اللّٰہ الرحمن الرحیم",
  ],
};

export default kalam;
