import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-f17f7c4f",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یا ابوالفضل آلِ احمد حضرتِ اچھے میاں",
  titleRo: "",
  versesUr: [
      "یا ابوالفضل آلِ احمد حضرتِ اچھے میاں",
      "شاہ  شمس الدّیں  ضِیاء  الاصفِیا   امداد  کن",
      "وَحی  بر  جَدِّ  تو    لَا یَاْتَل اُولُوالْفَضْل  آمدَہ  اَست",
      "بندئہ بے بَرگ را فضل و غِنا امداد کن",
      "گو نہ ہجرت کَردَم از اِثْم و غَیٰ اَرْزَم بقرب",
      "آخر ایں در رانیم مسکیں گدا امداد کن",
      "اے کہ شَمسی و کَرامَتْہائے تو مثلِ نُجوم",
      "اے عَجب ہم مِہر و ہم اَنجم نُما امداد کن",
      "من سَرت کر دم دمے دیگر زِ شرقِ خَرق تاب",
      "آفتابا! در شبِ داجِم بِیا امداد کن",
      "تاجْدارِ حضرتِ مارہرہ یا آلِ رسول",
      "اے خدا خواہ و جدا از ماعَدا امداد کن",
      "اے    شہِ   والا  عمیمِ   آلا   عظیم   المرتبۃ",
  ],
};

export default kalam;
