import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-59478e4d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اہلِ صِراط رُوحِ امیں کو خبر کریں",
  titleRo: "",
  versesUr: [
      "اہلِ صِراط رُوحِ امیں کو خبر کریں",
      "جاتی ہے اُمّتِ نبوی فرش پر کریں",
      "اِن فتنہ ہائے حشر سے کہدو حَذَرْ کریں",
      "نازوں کے پالے آتے ہیں رہ سے گزر کریں",
      "بد ہیں تو آپ کے ہیں بھلے ہیں تو آپ کے",
      "ٹکڑوں سے تو یَہاں کے پلے رُخ کِدھر کریں",
      "سرکار ہم کمینوں کے اطوار پر نہ جائیں",
      "آقا حضور اپنے کرم پر نظر کریں",
      "ان کی حرم کے خار کشیدہ ہیں کس لئے",
      "آنکھوں میں آئیں سر پہ رہیں دِل میں گھر کریں",
      "جالوں پہ جال پڑ گئے  لِلّٰہ  وقت ہے",
      "مشکل کشائی آپ کے ناخن اگر کریں",
      "منزل کڑی ہے شان تبسّم کرم کرے",
      "تاروں کی چھائوں نور کے تڑکے سفر کریں",
      "کلکِ رضا  ؔ ہے خنجرِ  خونخوار برق بار",
      "اعدا سے کہدو خیر منائیں نہ شر کریں",
  ],
};

export default kalam;
