import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-31d6cfa9",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "جب   لِوَاء الْحَمْد  لے  اُمّت  کا  والی  ہاتھ  میں",
  titleRo: "",
  versesUr: [
      "جب   لِوَاء الْحَمْد  لے  اُمّت  کا  والی  ہاتھ  میں",
      "ہر خطِ کف ہے یہاں اے دستِ بیضائے کلیم",
      "موجزن دریائے نورِ بے مثالی ہاتھ میں",
      "وہ گراں سنگی قدرِ مَس وہ ارزانی جود",
      "نوعیَہ بدلہ کیے سنگ و لآلی ہاتھ میں",
      "دستگیرِ ہر دو عالم کر دیا سِبطین کو",
      "اے میں قرباں جانِ جاں انگشت کیا لی ہاتھ میں",
      "آہ وہ عالم کہ آنکھیں بند اور لب پر دُرود",
      "وقف سنگِ در جبیں رَوضہ کی جالی ہاتھ میں",
      "جس نے بَیْعَتْ کی بہار حسن پر قرباں رہا",
      "ہیں لکیریں نقش تسخیرِ جمالی ہاتھ میں",
      "کاش ہو جائوں لبِ کوثر مَیں یوں وارفتہ ہوش",
      "لے کر اس جانِ کرم کا ذیل عالی ہاتھ میں",
      "آنکھ محوِ جلوئہ دیدار دل پُر جوشِ وجد",
      "لب پہ شکرِ بخشِشِ ساقی پیالی ہاتھ میں",
      "حشر میں کیا کیا مزے وارفتگی کے لُوں رضاؔ",
      "لوٹ جائوں پا کے وہ دامانِ عالی ہاتھ میں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
