import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-0d8e610e",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "تَرنُّم عَندلیبِ قلم برشاخسارِ مدحِ اکرم حضور پیر و مرشدِ برحق علیہ رضوان الحق",
  titleRo: "",
  versesUr: [
      "تَرنُّم عَندلیبِ قلم برشاخسارِ مدحِ اکرم حضور پیر و مرشدِ برحق علیہ رضوان الحق",
      "خوشا دِلے کہ دِہندَش ولائے آلِ رسول",
      "خوشا سَرے کہ کُنِندَش فدائے آلِ رسول",
      "گناہِ  بندہ   بِبَخْش   اے  خدائے  آلِ  رسول",
      "ہزار دُرجِ سَعادت برآرد از صَدفے",
      "بہائے ہر گہرِ بے بہائے آلِ رسول",
      "سِیَہ سَپید نہ شُد گر رشید مِصرَش داد",
      "سیہ سپید کہ سازَد عطائے آلِ رسول",
      "اِذا      رُؤُا      ذُکِرَ اللّٰہ          معائنہ       بینی",
      "خبر   دِہَد   ز   تگِ      لآ      اِلٰہ        اِلَّا  اللّٰہ",
      "ہزار مِہر پَرَد در ہوائے او چو ہَبا",
      "بَرُوْزَنے کہ دَرَخْشَد ضیائے آلِ رسول",
      "نصیبِ پَست نشیناں بلندیسْت ایں جا",
      "برآ بہ چرخِ برین و بِبیِں ستانۂ او",
      "قبائے شہ بگلیمِ سیاہ خود نخرد",
      "گرا بہ خاک و بِیا بر سمائے آلِ رسول",
      "دوائے  تلخ  مَخور  شہد  نوش  و  مژدہ   نیوش",
      "سیہ گلیم نباشَد گدائے آلِ رسول",
  ],
};

export default kalam;
