import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4edc8f0a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اُن کی مہک نے دِل کے غُنچے کِھلا دئیے ہیں",
  titleRo: "",
  versesUr: [
      "اُن کی مہک نے دِل کے غُنچے کِھلا دئیے ہیں",
      "جس راہ چل گئے ہیں کُوچے بَسا دیے ہیں",
      "جب آگئی ہیں جوشِ رحمت پہ اُن کی آنکھیں",
      "جلتے بُجھا دیے ہیں روتے ہنسا دیے ہیں",
      "اِک دل ہمارا کیا ہے آزار اس کا کتنا",
      "تم نے تو چلتے پِھرتے مُردے جِلا دیے ہیں",
      "ان کے نثار کوئی کیسے ہی رنج میں ہو",
      "جب یاد آگئے ہیں سب غم بُھلا دیے ہیں",
      "ہم سے فقیر بھی اب پھیری کو اُٹھتے ہوں گے",
      "اب تو غنی کے دَر پر بِستر جما دیے ہیں",
      "اَسرا میں گزرے جس دم بیڑے پہ قُدسیوں کے",
      "ہونے لگی سَلامی پرچَم جھکا دیے ہیں",
      "آنے دو یا ڈُبو دو اب تو تمہاری جانِب",
      "کَشتی تمہیں پہ چھوڑی لنگر اُٹھا دیے ہیں",
      "دُولہا سے اِتنا کہہ دو پیارے سُواری روکو",
      "مشکل میں ہیں براتی پُرخار بادیے ہیں",
      "اللّٰہ   کیا جہنّم اب  بھی نہ سَرد ہوگا",
      "رو رو کے مصطفیٰ نے دریا بہا دیے ہیں",
      "میرے کریم سے گر قطرہ کِسی نے مانگا",
      "دریا بہا دیے ہیں دُر بے بہا دیے ہیں",
      "مُلکِ سُخَن کی شاہی تم کو رضاؔ مُسلَّم",
      "جس سَمْت آ گئے ہو سِکّے بٹھا دیے ہیں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
