import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-170696d7",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "در حَشرگَہ جنابِ عبدالقادر        چوں نَشَر کُنی کتابِ عبدالقادر",
  titleRo: "",
  versesUr: [
      "در حَشرگَہ جنابِ عبدالقادر        چوں نَشَر کُنی کتابِ عبدالقادر",
      "اَزْ قادرِیاں  مَجُو جُد اگانہ حساب     مدّے شُمُر اَز حسابِ عبدالقادر",
      "اللّٰہ     اللّٰہ     ربِّ   عبدالقادر         دارَد     واللّٰہ    حُبِّ  عبدالقادر",
      "ازْ وصفِ خدائے تو نَصِیْبَتْ دادَنْد     طُوبٰی لَکَ   اے مُحِبِّ عبدالقادر",
      "از حُرمتِ ایں قدرت و دولت بَخشائے         بر عاجز پُرحاجت عبدالقادر",
      "تنزِیلِ مُکمل سْتْ عبدالقادر        تکمِیلِ مَنزل سْتْ عبدالقادر",
      "کَس نیست جُزِاُو درْ دو کنارِ ایں سَیر     خود ختم و خود اَول سْتْ عبدالقادر",
      "مِمَّا  (1)  لَا تَعْلَمُوْ  (2)   سْتْ  عبدالقادر      مَسْتُورِ سُتُورِ (3)  ہُوْ سْتْ عبدالقادر",
      "می گُفت دِلَم کہ جاں سْتْ عبدالقادر   \tگفتَم  اَحْسَنْت",
      "مِیجُو مِیْگُوپس آنچہ دانی کہ وَرا  سْتْ       ازجُستن وگُفتن اُوْ سْتْ عبدالقادر",
      "جاں گفت کہ دینِ ماں(4)  سْتْ عبدالقادر \tگُفْتَم    آمَنْت",
      "دیں گفت حیاتِ من اَز مَن و گفتم(1)      \tایں جملہ صِفات",
      "از ذات بِگُو کہ آں سْتْ عبدالقادر       \tگم  شُد  مَنْ وَ اَنت",
      "عقل و حصر صفاتِ عبدالقادر       شبکُور و نُجوم",
      "وہم و اِدراک ذاتِ عبدالقادر      وَہ شارِق و بُوم",
      "عجز آں کہ بکُنہِ قطرہ آبے نَرَسید      زعم آں کہ رَسَد",
      "اُو    مَا  یَنْطِقُ   عَنِ   الْہَویٰ    اِیں      شَرحش",
      "اہلِ دیں را مُغِیث     عبدالقادر",
      "آں تاج و سراج باز بَرکُن یا رب",
      "پُرنور       کُن       سراجِ      عبدالقادر",
  ],
};

export default kalam;
