import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-9c588825",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "#فِیْ تَقْرِیْرِ عَیْشِہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ#",
  titleRo: "",
  versesUr: [
      "#**فِیْ تَقْرِیْرِ عَیْشِہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ**#",
      "اَصْفِیا در جُہد و تو شاہانہ عِشرت می کُنی",
      "نُوش بادَتْ زانکہ خود شایانِ ہر ساماں توئی",
      "بُلبلاں را سوز و ساز و سوزِ اِیشاں کم مَباد",
      "گُلرُخاں را زِیب زِیْبَد زیبِ ایں بُستاں توئی",
      "خوش خور و خوش پوش و خوش زِی کوریِ چشمِ عَدُوّ",
      "شاہِ اِقلیمِ تَن و سلطانِ مُلکِ جاں توئی",
      "کامرانی کُن بَکامِ دوستاں اے مَن فِداتْ",
  ],
};

export default kalam;
