import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-e4f50baf",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "جمعِ تفریق و کثرت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "جمعِ تفریق و کثرت پہ لاکھوں سلام",
      "کثرتِ بعدِ قِلّت پہ اکثر درود",
      "عزّتِ بعدِ ذِلّت پہ لاکھوں سلام",
      "ربِّ اَعلیٰ کی نعمت پہ اعلیٰ درود",
      "حق تعالیٰ کی مِنَّت پہ لاکھوں سلام",
      "ہم غریبوں کے آقا پہ بے حد درود",
      "ہم فقیروں کی ثَروَت پہ لاکھوں سلام",
      "فَرحتِ جانِ مومن پہ بے حد درود",
      "غَیظِ قلبِ ضَلالت پہ لاکھوں سلام",
      "سببِ ہر سبب مُنتہائے طلب",
      "عِلَّتِ جملہ علت پہ لاکھوں سلام",
      "مَصدرِ مَظْہَرِیَّت پہ اَظہر درود",
      "مَظْہَرِ َمصْدَرِیَّت پہ لاکھوں سلام",
      "جس کے جلوے سے مرجھائی کلیاں کھلیں",
      "اُس گلِ پاک مَنْبت پہ لاکھوں سلام",
      "قدِّ بے سایہ کے سایۂ مَرحمت",
      "ظِلِّ مَمدُودِ رافَت پہ لاکھوں سلام",
      "طائرانِ قُدُس جس کی ہیں قمرِیَّاں",
      "اس  سہی  سَرْو  قامت   پہ   لاکھوں   سلام",
      "وصف جس کا ہے آئینۂ حق نُما",
      "اس خدا ساز طَلْعَت پہ لاکھوں سلام",
      "جس کے آگے سرِ سَروَراں خَم رہیں",
      "اس سرِ تاجِ رِفعت پہ لاکھوں سلام",
      "وہ کرم کی گھٹا گیسوئے مشک سا",
  ],
};

export default kalam;
