import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-bb25d10c",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "عِشق مولیٰ میں ہو خوں بار کنارِ دامن",
  titleRo: "",
  versesUr: [
      "عِشق مولیٰ میں ہو خوں بار کنارِ دامن",
      "یاخدا جلد کہیں آئے بہارِ دامن",
      "بہ چلی آنکھ بھی اشکوں کی طرح دامن پر",
      "کہ نہیں تارِ نظر جز دو سہ تارِ دامن",
      "اشک برسائوں چلے کوچۂ جاناں سے نسیم",
      "یاخدا جلد کہِیں نکلے بخارِ دامن",
      "دل شدوں کا یہ ہوا دامنِ اطہر پہ ہجوم",
      "بیدل آباد ہوا نام دیارِ دامن",
      "مُشک سا زلف شہ و نور فشاں رُوئے حضور",
      "اللّٰہ      اللّٰہ    حلبِ   جیب   و   تتارِ   دامن",
      "تجھ سے اے گل میں سِتم دیدئہ دشتِ حرماں",
      "خلش دل کی کہوں یا غمِ خارِ دامن",
      "عکس افگن ہے ہلالِ لبِ شہ جیب نہیں",
      "مہر عارض کی شعاعیں ہیں نہ تارِ دامن",
      "اشک کہتے ہیں یہ شیدائی کی آنکھیں دھو کر",
      "اے ادب گردِ نظر ہو نہ غبارِ دامن",
      "اے رضاؔ آہ وہ بلبل کہ نظر میں جس کی",
      "جلوئہ جیب گل آئے نہ بہَارِ دامن",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
