import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-716d5c1d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "سُنتے ہیں کہ محشر میں صرف اُن کی رَسائی ہے",
  titleRo: "",
  versesUr: [
      "سُنتے ہیں کہ محشر میں صرف اُن کی رَسائی ہے",
      "گر اُن کی رَسائی ہے لو جب تو بن آئی ہے",
      "مچلا ہے کہ رحمت نے اُمید بندھائی ہے",
      "کیا بات تِری مجرم کیا بات بَنائی ہے",
      "سب نے صف محشر میں لَلکار دیا ہم کو",
      "اے بے کسوں کے آقا اب تیری دُہائی ہے",
      "یُوں تو سب اُنہیں کا ہے پَر دل کی اگر پوچھو",
      "یہ ٹُوٹے ہوئے دِل ہی خاص اُن کی کمائی ہے",
      "زائر گئے بھی کب کے دِن ڈَھلنے پہ ہے پیارے",
      "اُٹھ میرے اَکیلے چل کیا دیر لگائی ہے",
      "بازارِ عمل میں تو سودا نہ بنا اپنا",
      "سرکار کرم تجھ میں عیبی کی سمَائی ہے",
      "گِرتے ہووں کو مژدہ سجدے میں گِرے مولیٰ",
  ],
};

export default kalam;
