import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4c996c3d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "قافلے نے سُوئے طیبہ کمر آرائی کی",
  titleRo: "",
  versesUr: [
      "قافلے نے سُوئے طیبہ کمر آرائی کی",
      "مشکل آسان الٰہی مری تنہائی کی",
      "لاج رکھ لی طمعِ عفو کے سودائی کی",
      "اے میں قرباں مِرے آقا بڑی آقائی کی",
      "فرش تا عرش سب آئینہ ضمائر حاضِر",
      "بس قسم کھائیے اُمّی تِری دانائی کی",
      "شش جہت سمت مقابل شب و روز ایک ہی حال",
      "دُھوم   وَالنَّجم  میں ہے آپ کی  بِینائی کی",
      "پانسو۵۰۰ سال کی راہ ایسی ہے جیسے دو گام",
      "آس ہم کو بھی لگی ہے تِری شنوائی کی",
      "چاند اشارے کا ہلا حکم کا باندھا سورج",
      "واہ کیا بات شہا تیری توانائی کی",
      "تنگ ٹھہری ہے رضاؔ جس کے لئے وُسعتِ عرش",
      "بس جگہ دل میں ہے اس جَلوئہ ہرجائی کی",
  ],
};

export default kalam;
