import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d7c0239d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "سرِّ باطن بھی ہے ظاہر بھی ہے عبدالقادر",
  titleRo: "",
  versesUr: [
      "سرِّ باطن بھی ہے ظاہر بھی ہے عبدالقادر",
      "مفتِی شرع بھی ہے قاضی مِلّت بھی ہے",
      "علمِ اَسرار سے ماہر بھی ہے عبدالقادر",
      "منبعِ فیض بھی ہے مجمعِ افضال بھی ہے",
      "مہر عرفَاں کا منور بھی ہے عبدالقادر",
      "قطب ابدال بھی ہے محورِ ارشاد بھی ہے",
      "مرکزِ دائرئہ سِرّ بھی ہے عبدالقادر",
      "سلکِ عرفاں کی ضیا ہے یہی دُرِّمختار",
      "فخرِ اَشباہ و نظائر بھی ہے عبدالقادر",
      "اس کے فرمان ہیں سب شارحِ حکمِ شارع",
  ],
};

export default kalam;
