import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-501e0548",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ہر مکاں کا اُجالا ہمَارا نبی",
  titleRo: "",
  versesUr: [
      "ہر مکاں کا اُجالا ہمَارا نبی",
      "سارے اچھّوں میں اچھّا سَمَجھیے جسے",
      "ہے اُس اچھّے سے اچھّا ہمَارا نبی",
      "سارے اُونچوں میں اُونچا سمجھیے جسے",
      "ہے اُس اُونچے سے اُونچا ہمَارا نبی",
      "انبیا سے کروں عرض کیوں مالکو!",
      "کیا نبی ہے تمہارا ہمَارا نبی",
      "جس نے ٹکڑے کیے ہیں قمر کے وہ ہے",
      "نُورِ وَحدت کا ٹکڑا ہمَارا نبی",
      "سب چمک والے اُجلوں میں چمکا کیے",
      "اندھے شیشوں میں چمکا ہمَارا نبی",
      "جس نے مُردہ دِلوں کو دی عمر اَبد",
      "ہے وہ جانِ مسیحا ہمَارا نبی",
      "غمزدوں کو رضاؔ مژدہ دیجے کہ ہے",
      "بیکسوں کا سہَارا ہمَارا نبی",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
