import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-04a53555",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "زمانہ حج کا ہے جلوہ دیا ہے شاہد گل کو",
  titleRo: "",
  versesUr: [
      "زمانہ حج کا ہے جلوہ دیا ہے شاہد گل کو",
      "اِلٰہی طاقت پرواز دے پرہائے بلبل کو",
      "بہاریں آئیں جوبن پر گِھرا ہے ابر رحمت کا",
      "لبِ مشتاق بھیگیں دے اجازت ساقیا مل کو",
      "ملے لب سے وہ مشکیں مُہر والی دم میں دم آئے",
      "ٹپک سن کر قُمِ عیسٰی کہوں مستی میں قُلْقُلْ کو",
      "مچل جائوں سوالِ مدّعا پر تھام کر دامن",
      "بہکنے کا بہانہ پائوں قصدِ بے تأمل کو",
      "دُعا کر بختِ خُفتہ جاگ ہنگامِ اجابت ہے",
  ],
};

export default kalam;
