import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-8225379e",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَلْمُبَاہَاتُ الْجَلِیَّۃُ بِاِظْہَارِنِسْبَۃِ الْعَبْدِیَّۃ",
  titleRo: "",
  versesUr: [
      "اَلْمُبَاہَاتُ الْجَلِیَّۃُ بِاِظْہَارِنِسْبَۃِ الْعَبْدِیَّۃ",
      "احمد ہندی رضاؔ ابنِ نقی ابنِ رضاؔ",
      "از اَب و جَد بندہ و واقف زِ ہر عُنواں توئی",
      "مادرَم باشَد کنیزِ تو پِدَر باشَد غلام",
      "خانہ  زادِ  کُہنہ  اَم  آقائے   خا ن  و  ماں   توئی",
      "مَن نمک پَرْوردَہ اَم تا شِیرِ مادَر خوردَہ اَم",
      "لِلّٰہ الْمِنَّۃ    شکر  بخشِ   نمک  خوراں    توئی",
      "خطِّ آزادی نہ خواہَم بَنْدَگِیَّت خُسْرَوی اَست",
      "یَلَّلے گر بندہ اَم خوش مالکِ غلماں توئی",
  ],
};

export default kalam;
