import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-8b4242c8",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بَہ اُمیدِ اِجابَت بر خود بالیدَن وزمان ضراعت برخاک مَلیدَن وبَدَرگاہِ بیکس پناہ غَوثِیَّت نالِیدَن",
  titleRo: "",
  versesUr: [
      "بَہ اُمیدِ اِجابَت بر خود بالیدَن وزمان ضراعت برخاک مَلیدَن وبَدَرگاہِ بیکس پناہ غَوثِیَّت نالِیدَن",
      "یَلَّلے خوش آمدَم در کُوئے بغداد آمدَم",
      "رَقْصَم و جُوشَد زِ ہر مُویم ندا امداد کن",
      "طُرفَہ  تر  سازے  زَنم  بر  لب  زَدَہ  مُہرِ ادب",
      "خیزَدْ از ہر تارِ جیبِ مَن صَدا امداد کن",
      "بوسہ گستاخانہ چِیْدَن خواہَم از پائے سگش",
      "ور نہ بخشَد پیشِ شہ گریم شہا امداد کن",
  ],
};

export default kalam;
