import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-5ed255bd",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "کاں بندہ رضا ناقص عبدالقادر",
  titleRo: "",
  versesUr: [
      "کاں بندہ رضا ناقص عبدالقادر",
      "بِالکسر         منم      مُخلص     عبدالقادر",
      "بر کَسر چو رحم آرَد فَتْحَش  چہ عَجب",
      "تمکِینِ گُلے از رِیاضِ عبدالقادر",
      "نورِ دلِ عارِفاں کہ شبِ صبح نُما سْتْ",
      "اِیْنجا وجہِ نِشاط عبدالقادر",
      "بکُشادَئہ دَور دادَۂ باد بنہادَہ بجود(1)",
      "دروازہ صَلا سِماط عبدالقادر",
      "پَروانہ صفت جمع کہ خود جلوہ نما ست",
      "خوباں چو گل بَوَعظ عبدالقادر",
      "خُور    راتِبَہ  خور     زِ    شمع     عبد القادر",
      "شمع جزو کل بوعظ عبدالقادر",
      "ایں نور و سُرور شیرَتْ از  صبح   ز   چیست",
      "مَہ آزقہ بر زِ شمع عبدالقادر",
      "دُودیْسْت مگر ز شمع عبدالقادر",
      "اَ ما مَگُزر ز شمعِ عبدالقادر",
      "کارِیکہ زِ خور بہ نیم مَہ دِیدی بِیں",
      "مِہری بِنِگر ز شمعِ عبدالقادر",
      "یک شاہد و دو سابع عبدالقادر",
      "اینک گو ہم تابع عبدالقادر",
  ],
};

export default kalam;
