import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-3f1c046d",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "فِی جَامِعیّتہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ لِکَمَالَاتِ الظَّاہِرِوَالْبَاطِن",
  titleRo: "",
  versesUr: [
      "فِی جَامِعیّتہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ لِکَمَالَاتِ الظَّاہِرِوَالْبَاطِن",
      "شَرع از رُویَت چَکَدْ عِرفاں زِ پہلُویَتْ دَمَد",
      "ہم بہارِ ایں گُل و ہم ابرِ آں باراں توئی",
      "پردہ بَرگِیر از رُخَتْ اے مَہ کہ شرحِ مِلّتی",
      "رُخ بِپُوش اِیجاں کہ رَمزِ باطنِ قرآں توئی",
      "ہم توئی قُطبِ جنوب و ہم توئی قطبِ شمال",
      "نے   غلط  کَردَم   مُحیطِ   عالمِ  عِرفاں  توئی",
      "ثابِت و سَیَّارَہ ہم دَر تُسْتْ و عرشِ اَعظمی",
      "اہلِ تمکین اہلِ تَلْوِیں جملہ را سُلطاں توئی",
  ],
};

export default kalam;
