import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-be52aa67",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وہی ربّ ہے جس نے تجھ کو ہَمہ تن کرم بنایا",
  titleRo: "",
  versesUr: [
      "وہی ربّ ہے جس نے تجھ کو ہَمہ تن کرم بنایا",
      "ہمیں بھیک مانگنے کو تِرا آستاں بتایا",
      "تجھے حمد ہے خدایا",
      "تمہِیں حاکمِ برایا تمہِیں قاسمِ عطایا",
      "تمہِیں دافعِ بلایا تمہِیں شافعِ خطایا",
      "کوئی تم سا کون آیا",
      "وہ  کنواری  پاک  مریم  وہ   نَفَخْتُ فِیْہ  کا  دم",
      "ہے عجب نشانِ اعظم مگر آمنہ کا جایا",
      "یہی بولے سِدرہ والے چمنِ جہاں کے تھالے",
      "وہی سب سے افضل آیا",
      "سبھی میں نے چھان ڈالے تِرے پایہ کا نہ پایا",
      "تجھے یک نے یک بنایا",
      "فَاِذَا فَرَغْتَ فَانْصَبْ  یہ  ملا  ہے  تم کو  مَنصَب",
      "جو  گدا  بنا  چکے  اب  اُٹھو   وقتِ  بخشِش   آیا",
      "کرو قسمتِ عطایا",
      "وَ اِلَی الْاِلٰہِ فَارْغَبْ  کرو  عرض  سب  کے  مَطلب",
      "کہ تمہیں کو تکتے ہیں سب کرو اُن پر اپنا سایا",
      "ارے اے خدا کے بندو! کوئی میرے دل کو ڈھونڈو",
  ],
};

export default kalam;
