import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-5c3a2e69",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اِینہم بعلم برائے عبدالقادر",
  titleRo: "",
  versesUr: [
      "اِینہم بعلم برائے عبدالقادر",
      "عین آمدَہ اِبتِدائے عبدالقادر",
      "از رُویتِ اُو عَینِ مَرا روشن کُن",
      "روشن کُن عین و رائے عبدالقادر",
      "عبدا بَہ لقائے اُو چو ہمزہ گم شد",
      "عیدِ یکتا لِقائے عبدالقادر",
      "پیشَش ہم اَزُو شفیع اَنگیز و بِگُو",
      "تا دَریابی بَپائے عبدالقادر",
      "اُفتادَہ در اول بِدایَت باساں          اِلصاق طلب",
      "گَروِیدہ بآخر تجسُّس خنداں           عین ساں بَطرب",
      "یعنی شہِ جیلاں ز شہاں بس کہ ہمونسْت       درمُصحف  قرب",
  ],
};

export default kalam;
