import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-9d7ad2c8",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَلَا یٰٓاَیُّھَاالسَّاقِیْ اَدِرْ کَاْسًا وَّ نَاوِلْھَا",
  titleRo: "",
  versesUr: [
      "اَلَا یٰٓاَیُّھَاالسَّاقِیْ اَدِرْ کَاْسًا وَّ نَاوِلْھَا",
      "اَلَا    یٰٓاَیھَا  السَّاقِیْ     اَدِرْ    کَاْسًا    وَّ    نَاوِلْھَا",
      "کہ  بَر  یادِ   شہِ  کوثر   بِنا   سازَیم   مَحفِلہا",
      "بَلا بارِید حُبِّ شیخِ نجدی بَر وہابِیَہ",
      "کہ عشق آساں نمود اَوّل و لَے اُفتاد مُشکلِہا",
      "وہابی  گَر چہ  اِخفا  می  کُنَد  بغضِ  نبی  لیکن",
      "نِہاں کَے ماند آں رازے کزُو سازَند مَحفِلہا",
      "تَوَہُّب گاہ مُلکِ ہند اِقامَت را نَمی شایَد",
      "جَرَس  فریاد  می  دارَد  کہ  بَربَندید  مَحمِلہا",
      "صَلائے مَجلِسَم در گوش آمد بِیں بِیا بِشِنَو",
      "جَرس  مَستانہ  می  گُویَد  کہ  بَربَندید   مَحمِلہا",
      "مَگَرداں  رُو  اَزیں محفل  رہِ  اَربابِ سنّت رَو",
      "کہ سالِک  بے  خبر  نبوَد  زِ  راہ  و  رسمِ  مَنزلہا",
      "در اِیں  جَلْوَت  بِیا  از  راہِ  خَلْوَت  تا  خُدا  یابی",
      "مَتٰی مَا تَلْقَ مَنْ تَھْوٰی دَعِ الدُّنْیَا وَ اَمْھِلْھَا",
      "دِلَم قُربانَت اے دُودِ چراغِ محفلِ مَوْلِد",
      "زِ تابِ  جَعْدِ مُشکِینَت چِہ خوں اُفتاد در دِلْہا",
      "کُجا دانَند حالِ ما سبکسارانِ سَاحِلْہا",
      "رضاء مستِ جامِ عشق ساغر باز می خواہَد",
      "اَلَا    یٰٓاَ       یُّھَا   السَّاقِیْ     اَدِرْ    کَاْسًا    وَّ    نَاوِلْھَا",
  ],
};

export default kalam;
