import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-15d50618",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَنبیا کو بھی اَجل آنی ہے",
  titleRo: "",
  versesUr: [
      "اَنبیا کو بھی اَجل آنی ہے",
      "مگر ایسی کہ فقط آنی ہے",
      "پھر اُسی آن کے بعد اُن کی حیات",
      "مثلِ سابق وہی جسمانی ہے",
      "روح تو سب کی ہے زندہ ان کا",
      "جسمِ پُرنور بھی روحانی ہے",
      "اوروں کی روح ہو کتنی ہی لطیف",
      "اُن کے اَجسام کی کب ثانی ہے",
      "پائوں جس خاک پہ رکھ دیں وہ بھی",
      "روح ہے پاک ہے نورانی ہے",
      "اُس کی اَزواج کو جائز ہے نکاح",
      "اُس کا ترکہ بٹے جو فانی ہے",
      "یہ    ہیں    حَیِّ    اَبدی    ان   کو     رضاؔ",
      "صدقِ وعدہ کی قضا مانی ہے",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
