import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2bc6f0cc",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "کیا ٹھیک ہو رُخِ نبوی پر مثالِ گل",
  titleRo: "",
  versesUr: [
      "کیا ٹھیک ہو رُخِ نبوی پر مثالِ گل",
      "پامال جلوئہ کفِ پا ہے جمَالِ گل",
      "جنّت ہے ان کے جلوہ سے جویائے رنگ و بُو",
      "اے گل ہمارے گل سے ہے گل کو سوالِ گل",
      "اُن کے قدم سے سلعۂ (1) غالی ہوئی جِناں",
      "واللّٰہ  میرے  گل  سے  ہے  جاہ  و  جلالِ  گل",
      "سُنتا ہوں عشقِ شاہ میں دِل ہو گا خُوں فشاں",
      "یاربّ یہ مُژْدَہ سچ ہو مبارک ہو فالِ گل",
      "بُلبل حرم کو چل غمِ فَانی سے فائدہ",
      "کب تک کہے گی ہائے وہ غنج و دَلالِ گل",
  ],
};

export default kalam;
