import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d6e98aae",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اے تَنَتْ را جامہ پُر زَر جَلوہ باری عَبا",
  titleRo: "",
  versesUr: [
      "اے تَنَتْ را جامہ پُر زَر جَلوہ باری عَبا",
      "اے سَرَتْ   را  تاجِ گوہرِ   ہَلْ اَتٰی   اِمداد  کن",
      "اے رُخَت را غازَۂ تَطْہِیْر و اِذْہابِ نَجس",
      "اے  لَبَت  ر ا  مایۂ  فَصْلُ  الْقَضا   اِمداد  کن",
      "اے بجبات و حَرِیر اَیمن زِ شَمْس و زَمہرِیر",
      "اے تُرا فِرْدَوس مُشْتاقِ لِقا اِمداد کن",
      "یَا طَلِیْقَ الْوَجْہِ  فِیْ   یَوْمٍ عَبُوْسٍ   قَمْطَرِیْر",
      "شکرِ اِیں نُصرت بیک نَظَرَت مَرا امداد کن",
      "اے  وَقَاہُم  رَبُّہُم   اَمنَتْ   زِ   شَرِّ  مُسْتَطِیر",
      "یَا بَہِیْجَ  الْقَلْبِ  فِیْ  یَوْمِ الْاَسٰی   اِمداد  کن",
      "اے تَنَت در راہِ مولیٰ خاک و جانَت عرشِ پاک",
      "مجرِمَم   مِی  جُویم   از  کَیْفرِ  وَقَا   امداد  کن",
      "اے شبِ ہجرت بَجائے مصطفیٰ بر رَخْتِ خواب",
      "بُو تُراب اے خاکیاں را پیشوا امداد کن",
      "اے عَدُوئے کفر و نَصب ورَ فض و تفضیل و خُروج",
      "اے دمِ شِدّت فدائے مصطفیٰ امداد کن",
      "شمعِ بَزم و تِیغِ رَزم و کُوہِ عَزم و کانِ حَزم",
      "اے علوے سُنّت و دینِ ہُدٰی امداد کن",
      "*…*…*…*…*…*",
      "اے کذا و اے فُزوںتر از کذا امداد کن",
  ],
};

export default kalam;
