import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-a0d5e29a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "آہ   یا   غَوثاہ   یا   غَیثاہ     یا    امداد  کن",
  titleRo: "",
  versesUr: [
      "آہ   یا   غَوثاہ   یا   غَیثاہ     یا    امداد  کن",
      "یا    حَیَاۃَ  الْجُوْدِ    یَا    رُوْحَ  الْمَنَا    امداد  کن",
      "اے کہ پایَت بر رِقابِ اَولیا امداد کن",
      "از تو دَسْتے خواہَد ایں بے دست و پا امداد کن",
      "مجمعِ ہر دو طَریق و مَرجعِ ہر دو فَریق",
      "فاصِلان و واصِلاں را مُقْتَدا امداد کن",
      "واشیاں بر بندہ از ہر سُو ہُجوم آوَرْدَہ اَنْد",
      "یَا    عَزُوْمًا   قَاتِلًا   عِنْدَ   الْوَغَا    امداد  کن",
      "بہرِ  ’’   لَا خَوْ فٌ  عَلَیْہِمْ  ‘‘   نَجِّنَا   مِمَّا  نَخَافْ",
      "بہرِ’’  لَا ہُمْ یَحْزَنُوْں  ‘‘   غمہا  زِدا   امداد  کن",
      "اے بامْصَارِ کرم دو قرن پیشیں دو حرم",
      "تو بَمُلکِ اَولیا چوں اِیلِیا امداد کن",
      "عِزُّنَا    یَا    حِرْزَنَا     یَا    کَنْزَنَا     یَا    فَوْزَنَا",
      "لَیْثُنَا     یَا     غَیْثَنَا    یَا   غَوْثَنَا       امداد  کن",
      "شاہِ دیں عمرِ سنن ماہِ زمیں مِہْرِ زَمَن",
      "گاہِ کیں بہرِ فتن برقِ فنا امداد کن",
      "مِہرباں تر بَر مَن اَز مَن از من آگَہ تر زِ مَن",
      "نَیِّرُ   الْاَشْرَاق    وَ   لَمَّاعُ   السَّنَا     امداد  کن",
      "چَند  گُویَم   سَیِّدا   جُودُ  النَّدیٰ    امداد  کن",
  ],
};

export default kalam;
