import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-a5c2192f",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "عارضِ شمس و قمر سے بھی ہیں انور ایڑیاں",
  titleRo: "",
  versesUr: [
      "عارضِ شمس و قمر سے بھی ہیں انور ایڑیاں",
      "عرش کی آنکھوں کے تارے ہیں وہ خوشتر ایڑیاں",
      "جا بجا پَرَْتو فگن ہیں آسماں پر ایڑیاں",
      "دِن کو ہیں خورشید شب کو ماہ و اختر ایڑیاں",
      "نجمِ گَردوں تو نظر آتے ہیں چھوٹے اور وہ پائوں",
      "عرش پر پھر کیوں نہ ہوں محسوس لاغر ایڑیاں",
      "دَب کے زیر پا نہ گنجایش سمانے کو رہی",
      "بن گیا جلوہ کفِ پا کا اُبھر کر ایڑیاں",
      "اُن کا منگتا پائوں سے ٹھکرا دے وہ دُنیا کا تاج",
      "جس کی خاطر مر گئے  مُنْعِم  رگڑ کر ایڑیاں",
      "دو قمر، دو پنجۂ خور، دو ستارے، دس ہِلال",
      "ان کے تلوے، پنجے، ناخن، پائے اطہر ایڑیاں",
      "ہائے اس پتھر سے اس سینہ کی قسمت پھوڑیے",
      "بے تکلف جس کے دل میں یوں کریں گھر ایڑیاں",
      "تاجِ  رُوح القدْس  کے موتی جسے سجدہ کریں",
      "رکھتی  ہیں    واللّٰہ    وہ   پاکیزہ  گوہر  ایڑیاں",
      "ایک ٹھوکر میں اُحد کا زلزلہ جاتا رہا",
      "رکھتی ہیں کتنا وقار   اللّٰہ اکبر   ایڑیاں",
      "چرخ پر چڑھتے ہی چاندی میں سیاہی آ گئی",
      "کر چکی ہیں بَدْر کو ٹکسال باہر ایڑیاں",
      "اے رضاؔ طوفانِ محشر کے طَلاطُم سے نہ ڈر",
      "شاد ہو! ہیں کشتیِ امّت کو لنگر ایڑیاں",
  ],
};

export default kalam;
