import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-789c92f1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "لَکَ (4)   بَدْرٌ فِی الْوَجْہِ الْاَجْمَلْ خط  ہالۂ مہ  زُلف اَبر ِ اَجل",
  titleRo: "",
  versesUr: [
      "لَکَ (4)   بَدْرٌ فِی الْوَجْہِ الْاَجْمَلْ خط  ہالۂ مہ  زُلف اَبر ِ اَجل",
      "تورے چندن چندر پرو کنڈل رحمت کی بھرن برسا جانا",
      "اَنَا (5)    فِیْ عَطَشٍ وَّسَخَاکَاَ تَمْ  اے گیسوئے پاک اے ابرِ کرم",
      "برسن ہارے رم جھم رم جھم دو بوند اِدھر بھی گرا جانا",
      "یَاقَافِلَتِی (1)   زِیْدِیْ اَجَلَکْ رحمے برحَسْرتِ تِشْنہ لَبَک",
      "مورا جِیَرا لَرجے دَرَک دَرَک طیبہ سے ابھی نہ سنا جانا",
      "وَاھًا (2)   لِسُوَیْعَاتٍ ذَھَبَتْ آں عَہْدِ حُضُورِ بارگہت",
      "جب یاد آوَت موہے کر نہ پرت دردا وہ مدینہ کا جانا",
      "اَلْقَلْبُ (3)   شَجٍ وَّالْھَمُّ شُجُوْں دِل زَارچُناں جاں زیر چُنُوں",
      "پت اپنی بپت میں کاسے کہوں مرا کون ہے تیرے سوا جانا",
      "اَلرُّوْحُ (4)   فِدَاکَ فَزِدْ حَرْقَا یَک شُعْلہ دِگر بَرزَن عِشْقا",
      "مورا تن من دھن سب پھونک دیا یہ جان بھی پیارے جَلاجانا",
      "بس خامۂ خام نوائے رضاؔ نہ یہ طرز مری نہ یہ رنگ مِرا",
      "اِرشادِ اَحِبَّا ناطِق تھا ناچار اِس راہ پڑا جانا",
  ],
};

export default kalam;
