import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-dc46995e",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "گزرے جس  راہ  سے  وہ  سیِّدِ  والا  ہو  کر",
  titleRo: "",
  versesUr: [
      "گزرے جس  راہ  سے  وہ  سیِّدِ  والا  ہو  کر",
      "رہ گئی ساری زَمیں عَنْبرِ سارا ہو کر",
      "رُخِ اَنور کی تجلی جو قمر نے دیکھی",
      "رہ گیا بوسہ دہِ نقشِ کفِ پا ہو کر",
      "وَائے محرومیِ قسمَت کہ میں پھر اب کی برس",
      "رہ گیا ہمرہِ زَوّارِ مدینہ ہو کر",
      "چمنِ طیبہ ہے وہ باغ کہ مُرغِ سِدرہ",
      "برسوں چہکے ہیں جہاں بلبلِ شیدا ہو کر",
      "صَرْصَرِ دَشتِ مَدینہ کا مگر آیا خیال",
      "رَشکِ گلشن جو بنا غُنْچۂ دِل وا ہو کر",
      "گوشِ شہ کہتے ہیں فریاد رَسی کو ہم ہیں",
      "وَعدئہ چشم ہے بخشائیں گے گویا ہو کر",
      "پائے شہ پر گِرے یارب تپشِ مہر سے جب",
      "دلِ بے تاب اُڑے حشر میں پارا ہو کر",
      "ہے یہ امّید رضاؔ کو تِری رحمت سے شہا",
      "نہ ہو زِندانیِ دوزخ تِرا بندہ ہو کر",
  ],
};

export default kalam;
