import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4b13319a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وَصْلِ دوم فَضائلِ غُرَر بَطَرْزِ  دِگر",
  titleRo: "",
  versesUr: [
      "وَصْلِ دوم فَضائلِ غُرَر بَطَرْزِ  دِگر",
      "جو تیرا طِفْل ہے کامل ہے یا غوث",
      "تَصَوُّف تیرے مَکتب کا سبق ہے",
      "طُفَیْلی کا لَقب واصل ہے یا غوث",
      "تَصَرُّف پر تِرا عامل ہے یاغوث",
      "تِری سَیر اِلَی اﷲ   ہی ہے  فِی اﷲ",
      "تو نورِ اوّل و آخر ہے مولیٰ",
      "کہ گھر سے چلتے ہی مُوصِل ہے یا غوث",
      "مَلک کے کچھ بَشر کچھ جنّ کے ہیں پیر",
      "تو خیرِ عاجل و آجِل  ہے  یا غوث",
      "کتابِ ہر دل آثار  تَعَرُّف",
      "تو  شیخِ  عالی  و  سافِل  ہے  یا غوث",
      "فُتوح الغیب    اگر   روشن    نہ    فرمائے",
      "تِرے  دفتر  ہی   سے  ناقِل  ہے  یا غوث",
      "تِرا مَنْسُوب ہے مَرفُوع اس جا",
      "فتوحات و فُصوص آفِل ہے یا غوث",
      "تِرے کامی مشقت سے بَری ہیں",
      "اِضافت  رَفع  کی  عامل  ہے  یا غوث",
      "کہ بَرتر نَصب سے فاعل ہے یا غوث",
  ],
};

export default kalam;
