import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2b38cc3f",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "فِی ترقیَا تہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ",
  titleRo: "",
  versesUr: [
      "فِی ترقیَا تہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ",
      "قبلہ گاہِ جان و دل پاکی ز لوثِ آب و گِل",
      "رخت بالا بردہ از مقصورئہ ارکاں توئی",
      "شہسوارِ من چہ می تازی کہ در گامِ نخست",
      "پاک بیروں تاختہ زیں ساکن و گرداں توئی",
      "تا پری بخشودئہ از عرش بالا بودئہ!",
      "آں قوی پر بازِ اشہب صاحبِ طیراں توئی",
      "سالہا شُد زیرِ مِہمیز ست اسپِ سالکاں",
      "تا عناں در دست گیری آں سوئے امکاں توئی",
  ],
};

export default kalam;
