import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-9f140cca",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "[1] ’’عشقی ‘‘حضرت سیّدنا شاہ برکت   اللّٰہ      رَحْمَۃُ اللّٰہ تَعَالٰی عَلَیْہِ    کا تخلص ہے ،اور’’ انتما‘‘ بمعنی انتساب یعنی نسبتِ عشق رکھنے والے ۔۱۲",
  titleRo: "",
  versesUr: [
      "[1] ’’عشقی ‘‘حضرت سیّدنا شاہ برکت   اللّٰہ      رَحْمَۃُ اللّٰہ تَعَالٰی عَلَیْہِ    کا تخلص ہے ،اور’’ انتما‘‘ بمعنی انتساب یعنی نسبتِ عشق رکھنے والے ۔۱۲",
      "دل کو اچھا تن کو ستھرا جان کو پُر نور کر",
      "اچھّے پیارے شمسِ دِیں بدرُ العلیٰ کے واسطے",
      "دو جہاں میں خادمِ آلِ رسول  اﷲ  کر",
      "حضرتِ آلِ رسولِ(1) مقتدا کے واسطے",
      "صَدقہ ان اَعیاں کا دے چھ عین عز علم و عمل",
  ],
};

export default kalam;
