import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-54f1c102",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مَپَسَنْدْ کہ گُویَنْدْ بَاِیْں نسبت دبند",
  titleRo: "",
  versesUr: [
      "مَپَسَنْدْ کہ گُویَنْدْ بَاِیْں نسبت دبند",
      "کاں بندہ فُلاں ہالِک عبدالقادر",
      "مثلش گر   زِ   اہلِ   قُرب    جُوئی   گُوئی",
      "حَشر سْتْ و توئی کَفیل عبدالقادر",
      "جاہَتْ بَہ شہِ جلیل عبدالقادر",
      "زُودآ  زُودآ وکیل عبدالقادر",
      "مَنِگر بَقُصور  و  نقصِ  ما قادرِیاں",
      "بِنِگر  بکمالِ تامِ عبدالقادر",
      "ہر صبحِ رَہَتْ مَرامِ عبدالقادر",
      "ہر شامِ درت مقامِ عبدالقادر",
      "بِگُزر زِ سَپید و سِیہِ قادریاں!",
      "عبدالقادر     کریم    عبدالقادر",
      "دور از تو سگِ تِشنَہ لَبے می مِیرَد",
      "یک موجِ دِگر اے یمِ عبدالقادر",
      "فاروق نَمَط حکیم عبدالقادر",
      "مانِنْدِ غنی کریم عبدالقادر",
      "یا ربّ چو خود اِیں دامن گُسْتَردَۂ تُسْتْ",
      "در رنگِ علی علیم عبدالقادر",
      "ایں نِسبت بس کہ عاجزانِ اُوْئیم",
      "گُسْتَردَہ مچِیں دامن عبدالقادر",
  ],
};

export default kalam;
