import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-21e49066",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "شیرِ غُرّانِ سَطْوَت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "شیرِ غُرّانِ سَطْوَت پہ لاکھوں سلام",
      "اَلغرض اُن کے ہر مُو پہ لاکھوں درود",
      "ان کی ہر خُو و خَصلت پہ لاکھوں سلام",
      "ان کے ہر نام و نسبت پہ نامی درود",
      "اُن کے ہر وقت و حالت پہ لاکھوں سلام",
      "ان کے مولیٰ کی اُن پر کروروں درود",
      "اُن کے اَصحاب و عِترت پہ لاکھوں سلام",
      "پارَہائے صُحُف غنچہائے قُدس",
      "اہلِ بیتِ نبوت پہ لاکھوں سلام",
      "آبِ تَطہِیر سے جس میں پودے جمے",
      "اس ریاضِ نَجابَت پہ لاکھوں سلام",
      "خونِ   خَیْرُ الرُّسُل   سے  ہے  جن  کا   خمِیر",
      "اُن کی بے لَوث طِینَت پہ لاکھوں سلام",
      "اس بتول جگر پارئہ مصطفیٰ",
      "حجلَۂ  آرائے   عِفَّت    پہ    لاکھوں   سلام",
      "جس کا آنچَل نہ دیکھا مَہ و مِہر نے",
      "اس رِدائے نَزاہَت پہ لاکھوں سلام",
      "سیِّدَہ زاہِرہ طَیِّبَہ طاہِرہ",
  ],
};

export default kalam;
