import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-6cae4e89",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "پُل سے اُتارو راہ گزر کو خبر نہ ہو",
  titleRo: "",
  versesUr: [
      "پُل سے اُتارو راہ گزر کو خبر نہ ہو",
      "جِبریل پر بِچھائیں تو پر کو خبر نہ ہو",
      "کانٹا مِرے جگر سے غَمِ رُوزگار کا",
      "یُوں کِھینچ لیجیے کہ جِگر کو خبر نہ ہو",
      "فریاد اُمَّتی جو کرے حالِ زار میں",
      "ممکن نہیں کہ خیرِ بشَر کو خبر نہ ہو",
      "کہتی تھی یہ بُراق سے اُس کی سبک رَوی",
      "یُوں جائیے کہ گردِ سفر کو خبر نہ ہو",
      "فرماتے ہیں یہ دونوں ہیں سردارِ دو جہاں",
      "اے مُرتضیٰ! عتیق و عمر کو خبر نہ ہو",
      "ایسا گُما دے اُن کی وِلا میں خدا ہمیں",
      "ڈُھونڈھا کرے پر اپنی خبر کو خبر نہ ہو",
      "آ دِل! حرم کو روکنے والوں سے چُھپ کے آج",
      "یُوں اُٹھ چلیں کہ پہلو و بر کو خبر نہ ہو",
      "طیر حَرم ہیں یہ کہیں رشتہ بپا نہ ہوں",
      "یُوں دیکھیے کہ تارِ نظر کو خبر نہ ہو",
      "اے خارِ طیبہ! دیکھ کہ دامن نہ بھیگ جائے",
      "یُوں دِل میں آکہ دِیدۂ تر کو خبر نہ ہو",
      "اے شوقِ دل! یہ سجدہ گر اُن کو روا نہیں",
      "اچھا!  وہ  سجدہ   کیجے  کہ  سر  کو  خبر  نہ  ہو",
      "اُن کے سِوا رضاؔ کوئی حامی نہیں جہاں",
      "گُزرا کرے پِسَر پہ پِدَر کو خبر نہ ہو",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
