import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4a83c6eb",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بِنْتِ احمد رَونقِ کاشانہ و بانُوے تو",
  titleRo: "",
  versesUr: [
      "بِنْتِ احمد رَونقِ کاشانہ و بانُوے تو",
      "گوشت و خونِ  تو   بَلَحْمَشْ   شِیر و  شکر  آمدَہ",
      "ہر دو رَیحانِ نبی گُلہائے تو زاں گل زمیں",
      "بہرِ  گل   چِیْنَت    زمینِ   باغ   برتر  آمدَہ",
      "می چَمِیدی گُلبَنا در باغِ اسلام و ہَنوز",
      "غُنچہ اَ ت  نَشِگُفْت  و نَے نخلے دِگر بر آمدَہ",
      "نرم نرم از بزم دامن چِیدہ رَفتہ بادِ تُنْد",
      "’’یا  علی ‘‘ چوں  بر  زبانِ  شمعِ   مُضْطر  آمدَہ",
      "ماہِ تاباں گُو مَتاب و مِہْرِ رَخشاں گو مَرَخْش",
      "باخْتَر تا خاوَر اِسمَت نور گُستر آمدَہ",
      "حل مشکل کُن بَرُوئے من درِ رحمت کُشا",
  ],
};

export default kalam;
