import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4bf7529c",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "لَم (1)   یَاتِ نَظِیْرُکَ فِیْ نَظَرٍمثلِ تو نہ شُد پیدا جانا",
  titleRo: "",
  versesUr: [
      "لَم (1)   یَاتِ نَظِیْرُکَ فِیْ نَظَرٍمثلِ تو نہ شُد پیدا جانا",
      "جگ راج کو تاج تورے سرسو ہے تجھ کو شہ دَوسَرا جانا",
      "اَلْبَحْر (2)   عَلَا وَالْمَوْجُ طَغٰی مَن بیکس وطوفاں ہوشرُبا",
      "منجدھار میں ہوں بگڑی ہے ہوا موری نیَّا پار لگا جانا",
      "یَاشَمْس (3)    نَظَرْتِ اِلٰی لَیْلِیْ چو بطیبہ رسی عرضے بکنی",
      "توری جوت کیجھل جھلجگ میںرَچی مری شب نے نہ دن ہوناجانا",
  ],
};

export default kalam;
