import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-008af5d1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "رونقِ بزمِ جہاں ہیں عاشقانِ سوختہ",
  titleRo: "",
  versesUr: [
      "رونقِ بزمِ جہاں ہیں عاشقانِ سوختہ",
      "کہہ رہی ہے شمع کی گویا زبانِ سوختہ",
      "جس کو قرصِ مہر سمجھا ہے جہاں اے مُنعمو!",
      "اُن کے خوانِ جُود سے ہے ایک نانِ سوختہ",
      "ماہِ من یہ نیّرِ محشر کی گرمی تابکے",
      "آتشِ عصیاں میں خود جلتی ہے جانِ سوختہ",
      "برقِ انگشتِ نبی چمکی تھی اس پر ایک بار",
      "آج تک ہے سینۂ مہ میں نشانِ سوختہ",
      "مہر عالم تاب جھکتا ہے پئے تسلیم روز",
      "پیشِ ذرّاتِ مزارِ بیدلانِ سوختہ",
      "کُوچۂ گیسوئے جاناں سے چلے ٹھنڈی نسیم",
      "بال و پر افشاں ہوں یاربّ بلبلانِ سوختہ",
      "بہرِ حق اے بحرِ رَحمت اِک نگاہِ لطف بار",
      "تابکے بے آب تڑپیں ماہیانِ سوختہ",
      "رُوکش خورشید محشر ہو تمہارے فیض سے",
      "اِک شرارِ سینۂ شیدائیانِ سوختہ",
      "آتشِ تردامنی نے دل کیے کیا کیا کباب",
      "خِضْر کی جاں ہو جِلا دو ماہیانِ سوختہ",
      "آتشِ گلہائے طیبہ پر جلانے کے لئے",
      "جان کے طالب ہیں پیارے بلبلانِ سوختہ",
      "لطفِ برقِ جلوئہ معراج لایا وجد میں",
      "شعلۂ جوالہ ساں ہے آسمانِ سوختہ",
      "اے رضاؔ مضمون سوزِ دِل کی رِفعت نے کیا",
      "اس زمینِ سوختہ کو آسمانِ سوختہ",
  ],
};

export default kalam;
