import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d321e192",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "زائرو پاسِ اَدب رکھو ہَوَس جانے دو",
  titleRo: "",
  versesUr: [
      "زائرو پاسِ اَدب رکھو ہَوَس جانے دو",
      "آنکھیں اندھی ہوئی ہیں ان کو ترَس جانے دو",
      "سُوکھی جاتی ہے اُمید غربا کی کھیتی",
      "بُوندیاں لکۂ رحمت کی برس جانے دو",
      "پلٹی آتی ہے ابھی وجد میں جانِ شیریں",
      "نغمۂ قُم کا ذرا کانوں میں رَس جانے دو",
      "ہم بھی چلتے ہیں ذرا قافلے والو! ٹھہرو",
      "گٹھریاں توشۂ اُمید کی کَس جانے دو",
      "دِید گل اور بھی کرتی ہے قِیامت دل پر",
      "ہمصفیرو ہمیں پھر سُوئے قفس جانے دو",
      "آتِش دِل بھی تو بھڑکائو ادب داں نالو",
      "کون کہتا ہے کہ تم ضبطِ نفس جانے دو",
      "یوں تنِ زار کے درپے ہوئے دل کے شعلو",
      "شیوئہ خانہ براندازیِ خس جانے دو",
      "اے رضاؔ آہ کہ یوں سہل کٹیں جرم کے سال",
      "دو گھڑی کی بھی عبادت تو برس جانے دو",
  ],
};

export default kalam;
