import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2f24d132",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اندھیری رات ہے غم کی گھٹا عصیاں کی کالی ہے",
  titleRo: "",
  versesUr: [
      "اندھیری رات ہے غم کی گھٹا عصیاں کی کالی ہے",
      "دلِ بے کس کا اِس آفت میں آقا تُو ہی والی ہے",
      "نہ ہو مایوس آتی ہے صَدا گورِ غریبَاں سے",
      "نبی اُمّت کا حامی ہے خدا بندوں کا والی ہے",
      "اُترتے چاند ڈھلتی چاندنی جو ہو سکے کر لے",
      "اندھیرا پاکھ آتا ہے یہ دو دن کی اُجالی ہے",
      "ارے یہ بھیڑیوں کا بن ہے اور شام آگئی سر پر",
      "کہاں سویا مسافر ہائے کتنا لا اُبالی ہے",
      "اندھیرا گھر، اکیلی جان، دَم گُھٹتا، دِل اُکتاتا",
      "خدا کو یاد کر پیارے وہ ساعت آنے والی ہے",
      "زمیں تپتی، کٹیلی راہ، بَھاری بوجھ، گھائل پائوں",
      "مصیبت  جھیلنے  والے  تِرا   اللّٰہ   والی ہے",
      "نہ چَونکا دن ہے ڈھلنے پر تری منزل ہوئی کھوٹی",
      "ارے او جانے والے نیند یہ کب کی نکالی ہے",
      "رضاؔ منزل تو جیسی ہے وہ اِک میں کیا سبھی کو ہے",
      "تم اس کو روتے ہو یہ تو کہو یاں ہاتھ خالی ہے",
  ],
};

export default kalam;
