import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-82377db9",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مَنْ  رَاٰنِی  قَدْ  رَاَی الْحق  گر  بِگوئی   می   سَزَد",
  titleRo: "",
  versesUr: [
      "مَنْ  رَاٰنِی  قَدْ  رَاَی الْحق  گر  بِگوئی   می   سَزَد",
      "زانکِہ ماہِ طَیبہ را آئینۂ تاباں توئی",
      "بَارکَ  اللّٰہ       نَوبہارِ     لالہ  زارِ     مصطفیٰ",
      "وَہ چہ رنگ اَسْت اِینکِہ رنگِ رَوضۂ رِضواں توئی",
      "جُوشَدْ از قدِ تو سَرْوْ و بارَد از رُوئے تو گُل",
      "خوش گُلستانے کہ باشی طُرفہ سَرْوِسْتاں توئی",
      "آنکِہ گُویَنْدْ اَولِیا را ہَسْتْ قدرت از اِلٰہ",
      "باز گردانَنْدْ تیر از نِیم راہ اِیناں توئی",
      "از تو میریم و زییم و عیشِ جاویداں کنیم",
      "جاں سِتاں جاں بخش جاں پَروَرْ توئی دَہاں توئی",
      "کُہنَہ جانے دادَہ جانے چوں تو دربَریافْتیم",
      "وَہ کہ ماں چَنداں گِرانِیم و چُنِیں اَرزاں توئی",
      "عالمِ اُمِّی چِہ تَعْلِیْمے عَجیبتْ کَردَہ اَست",
      "اَوْحَشَ  اللّٰہ   بر  عُلُومَت  سِرّ و  غائب داں  توئی",
  ],
};

export default kalam;
