import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-5e82b376",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "احمدِ نور طِینَت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "احمدِ نور طِینَت پہ لاکھوں سلام",
      "بے عذاب و عِتاب و حساب و کتاب",
      "تا اَبد اہلِ سنت پہ لاکھوں سلام",
      "تیرے ان دوستوں کے طفیل اے خدا",
      "بندئہ نَنگِ خَلْقَت پہ لاکھوں سلام",
      "میرے استاد ماں باپ بھائی بہن",
      "اَہل وُلد و عَشیرت پہ لاکھوں سلام",
      "ایک میرا ہی رحمت میں دعویٰ نہیں",
      "شاہ کی ساری امت پہ لاکھوں سلام",
      "کاش محشر میں جب ان کی آمد ہو اور",
      "بھیجیں سب اُن کی شوکت پہ لاکھوں سلام",
      "مجھ سے خدمت کے قُدسی کہیں ہاں رضاؔ",
      "مصطفیٰ جانِ رحمت پہ لاکھوں سلام",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
