import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-af61a27a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "شاہِ بَرَکات اے ابُو البرکات اے سلطانِ جُود",
  titleRo: "",
  versesUr: [
      "شاہِ بَرَکات اے ابُو البرکات اے سلطانِ جُود",
      "بَارَکَ اللّٰہ    اے  مبارک   بادشا   امداد  کن",
      "عِشْقی اے مَقْتُولِ عشق اے خوں بَہایَت عینِ ذات",
      "اے زِ جاں بِگُزشْتہ جاناں واصِلا امداد کن",
      "اے حَریمِ طیبۂ تَوحید را کوہِ اُحد",
      "سیّدا حق واجِدا یا مُقْتَدا امداد کن",
      "اے سراپا چشم گَشْتہ در شُہُودِ عینِ ہُو",
      "یا جبل یا حمزہ یا شیرِ خدا امداد کن",
      "زاں سبب کَردَنْدْ نامَتْ عَیْنیا امداد کن",
  ],
};

export default kalam;
