import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-183f0220",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "فِی اِرْثِہٖ  رَضِیَ اللّٰہ تَعَالٰی عَنْہ  عَنِ الْاَنْبِیَائِ وَالْخُلَفَائِ وَنِیَابَۃً لَہُمْ",
  titleRo: "",
  versesUr: [
      "فِی اِرْثِہٖ  رَضِیَ اللّٰہ تَعَالٰی عَنْہ  عَنِ الْاَنْبِیَائِ وَالْخُلَفَائِ وَنِیَابَۃً لَہُمْ",
      "مُصطَفیٰ سلطانِ عالی جاہ و در سرکارِ اُو",
      "اِقتدارِ کُن مَکُن حق مصطفیٰ را دادَہ اَست",
      "زیرِ تختِ مصطفیٰ بر کرسیِ دیواں توئی",
      "دَورِ آخر نَشْوِ تو بر قَلبِ اِبراہیم شُد",
      "دَورِ اوّل ہم نَشِینِ مُوسیِ عِمراں توئی",
      "ہم خلیلِ خوانِ رِفْق و ہم ذَبِیحِ تِیغِ عِشق!",
      "نوحِ کشتیِ غریباں خضرِ گمراہاں توئی",
      "مُوسیِ طورِ جلال و عیسیِ چَرخِ کمال",
  ],
};

export default kalam;
