import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-520d24e5",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مُلحِدوں کی کیا مروَّت کیجیے",
  titleRo: "",
  versesUr: [
      "مُلحِدوں کی کیا مروَّت کیجیے",
      "ذِکر اُن کا چھیڑیے ہر بات میں",
      "چھیڑنا شیطاں کا عادت کیجیے",
      "مثلِ فارس زلزلے ہوں نجد میں",
      "ذکرِ آیاتِ وِلادت کیجیے",
      "غیظ میں جل جائیں بے دِینوں کے دل",
      "’’  یارسول اللّٰہ  ‘‘ کی کثرت کیجیے",
      "کیجیے چرچا اُنہیں کا صبح و شام",
      "جانِ کافِر پر قیامت کیجیے",
      "آپ درگاہِ خدا میں ہیں وَجیہ",
      "ہاں شفاعت   بِالْوَجَاہَتْ  کیجیے",
      "حق تمہیں فرما چکا اپنا حبیب",
  ],
};

export default kalam;
