import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-7d9e6b8e",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "حضرت جابر بن عبد اللّٰہرَضِیَ اللّٰہ تَعَالٰی عَنْہما   فرماتے ہیں کہ حضور  صلَّی اللّٰہ تعالٰی عَلَیْہِ وَسَلَّم   نے کسی سائل کے جواب میں خواہ وہ کتنی ہی بڑی چیز کا سوال کیوں نہ کرے ’’  لَا  ‘‘ (نہیں)کا لفظ نہیں فرمایا۔   (الشفاء ،ج۱،ص۱۱۱)",
  titleRo: "",
  versesUr: [
      "حضرت جابر بن عبد اللّٰہرَضِیَ اللّٰہ تَعَالٰی عَنْہما   فرماتے ہیں کہ حضور  صلَّی اللّٰہ تعالٰی عَلَیْہِ وَسَلَّم   نے کسی سائل کے جواب میں خواہ وہ کتنی ہی بڑی چیز کا سوال کیوں نہ کرے ’’  لَا  ‘‘ (نہیں)کا لفظ نہیں فرمایا۔   (الشفاء ،ج۱،ص۱۱۱)",
      "مصطفٰے جانِ رحمت پہ لاکھوں سلام",
      "مصطفیٰ جانِ رحمت پہ لاکھوں سلام",
      "شمعِ بزمِ ہدایت پہ لاکھوں سلام",
      "مِہرِ چَرخِ نبوت پہ روشن درود",
      "گُلِ باغِ رِسالت پہ لاکھوں سلام",
      "شہریارِ اِرَم تاجْدارِ حرم",
      "نَوبہارِ شفاعت پہ لاکھوں سلام",
      "شبِ اَسریٰ کے دولہا پہ دائم درود",
      "نَوشۂ بزمِ جنت پہ لاکھوں سلام",
      "عرش کی زیب و زینت پہ عرشی درود",
      "فرش کی طِیْب و نُزہَت پہ لاکھوں سلام",
      "نورِ عَینِ لَطافَت پہ اَلْطَف درود",
      "زیب و زَینِ نَظافَت پہ لاکھوں سلام",
      "سَروِنازِ قِدَم مغزِ رازِ حِکَم",
      "یَکَّہ  تازِ   فضیلت    پہ    لاکھوں     سلام",
      "نقطۂ سِرِّ وَحدت پہ یکتا درود",
      "مرکزِ دورِ کثرت پہ لاکھوں سلام",
      "جس کے زیرِ لِوا آدم و من سِوا",
      "نائبِ دستِ قدرت پہ لاکھوں سلام",
      "عرش تا فرش ہے جس کے زیرِ نگیں",
      "اس سَزائے سیادت پہ لاکھوں سلام",
      "اصلِ ہر بُود و بَہبُود تخمِ وُجُود",
      "اس کی قاہِر ریاست پہ لاکھوں سلام",
  ],
};

export default kalam;
