import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-48601762",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بر سرِ خوانِ کرم مَحروم نگُزارَنْد سگ",
  titleRo: "",
  versesUr: [
      "بر سرِ خوانِ کرم مَحروم نگُزارَنْد سگ",
      "من سگ و اَبرار مہمانان و صاحبِ خواں توئی",
      "سگ بیاں نَتوانَدْ و جُودَت نہ پابندِ بَیانَسْتْ",
      "کامِ سگ  دانی  و  قادر  بر  عطائے  آں  توئی",
      "گر بسنگے می زَنی خود مالکِ جان و تَنی",
      "وَر بَہ نعمت می نَوازی مِنَّتِ مَنّاں توئی",
      "پارئہ نانے بِفَرما تا سوئے مَن اَفگنند",
      "ہمّتِ سگ اِیں قدر دیگر نَوال اَفشاں توئی",
      "من کہ سگ باشَم زِ کوئے تو کُجا بیروں رَوَم",
      "چوں یقیں دانَم کہ سگ را نیز و جہِ ناں توئی",
      "دَر کُشادہ خواں نِہادَہ سگ گُرسنہ شَہ کریم",
      "چیست حرفِ رَفْتن و مختارِ خوان و زاں توئی",
      "دور بنشینَم زمیں بوسَم فتم لابَہ کُنَم",
      "چشم در تو بَنْدَم و دانَم کہ ذُوالاحساں توئی",
      "لِلّٰہ الْعِزَّۃ     سگِ  ہندی   و  در  کوئے  تو  بار",
      "ہر سگے را بر درِ فَیْضَتْ چُناں دل می دِہَنْدْ",
      "گر پریشاں کَرْد وقتِ خادمانَت عَوعَوم",
      "مرحبا خوش آ ؤ  بِنَشِیں سگ نۂ مہماں توئی",
      "وائے مَن گر جلوہ فرمائی و مَن مانْدْ بمن",
      "خامُش اہلِ درد را مَپَسَنْدْ چوں درماں توئی",
      "*…*…*…*…*…*",
      "مَن نَمی گُفتم کہ آقا مایۂ غُفراں توئی",
  ],
};

export default kalam;
