import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-848f726a",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اے ز حسنِ خلق و حسن خلق احمد نسخۂ",
  titleRo: "",
  versesUr: [
      "اے ز حسنِ خلق و حسن خلق احمد نسخۂ",
      "سینہ تا پا شکلِ محبوبِ خدا امداد کن",
      "جانِ حُسن ایمانِ حُسن اے کانِ حُسن اے شانِ حُسن",
      "اے  جَمالَت  لمْعِ  شمعِ   مَنْ رَاٰی  امداد  کن",
      "جانِ زَہرا و شہیدِ زَہر را زور و ظَہِیْر",
      "زہرتِ اَزہارِ تَسْلِیم و رضا امداد کُن",
      "اے بَواقِعِ بِیکَسانِ دَہر را زیبا کَسے",
      "وَے بَظاہر بیکسِ دَشتِ جَفا امداد کن",
      "اے گَلُویَت گَہِ لَبانِ مصطفیٰ را بوسہ گاہ",
      "گہِ لبِ تِیغِ لَعیں را حَسرتا امداد کن",
      "اے تنِ تو گہِ سوارِ شہسوارِ عرشِ تاز",
      "گہِ چُناں پامال خَیلِ اَشقِیا امداد کن",
      "اے دل و جانْہا فدائے تِشْنہ کامِیہَائے تو",
      "اے  لَبَتْ  شرحِ   رَضِیْنَا بِالْقَضَا    امداد  کن",
      "اے کہ سُوزَت خان مانِ آب را آتِش زَدے",
      "گر نہ بُودے گِریۂ اَرض و سَما امداد کن",
      "ہے چہ بحر و تفتگی کوثر لَب و ایں تشنگی",
      "خاک بر فرقِ فُرات از لبِ مَرا امداد کن",
      "اَبر گو ہرگز مَبار و نہر گو ہرگز مَریز",
      "خود لَبَتْ تَسلیم و فَیضَتْ حَبَّذا امداد کن",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
