import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-a39765b7",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ملکِ خاصِ کِبریا ہو           مالکِ ہر ماسِوا ہو",
  titleRo: "",
  versesUr: [
      "ملکِ خاصِ کِبریا ہو           مالکِ ہر ماسِوا ہو",
      "کوئی کیا جانے کہ کیا ہو       عقلِ عالَم سے وَرا ہو",
      "کَنزِ مَکتومِ اَزل میں           دُرِّ مَکْنُونِ خدا ہو",
      "سب سے اوّل سب سے آخر        اِبتِدا   ہو   اِنتِہا   ہو",
      "تھے وسیلے سب نبی تم       اصل مَقْصُودِ ہُدیٰ ہو",
      "پاک کرنے کو وُضو تھے         تم نمازِ جانفزا ہو",
      "سب بِشارَت کی اذاں تھے      تم اذاں کا مُدَّعا ہو",
      "سب تمہاری ہی خبر تھے        تم مُؤخَّر مُبتَدا ہو",
      "قُربِ حق کی منزلیں تھے      تم  سفر  کا    مُنْتَہیٰ    ہو",
      "قبلِ ذکر اِضمار کیا ج        رُتْبَہ سابِق آپ کا ہو",
      "طُورِ موسیٰ چَرخِ عیسیٰ         کیا مُساوِیِ دَنیٰ ہو",
      "سب جِہَت کے دائرے میں   شَش جِہَت سے تم وَرا ہو",
      "سب مکاں تم لامکاں میں     تن ہیں تم جانِ صَفا ہو",
      "سب تمہارے در کے رستے     ایک تم راہِ خُدا ہو",
      "سب تمہارے آگے شافِع       تم حضورِ کِبریا ہو",
      "سب کی ہے تم تک رسائی      بارگہ تک تم رسا ہو",
      "وہ کَلَس رَوضے کا چمکا        سر جھکاؤ کَج کُلاہو",
      "وہ درِ دولت پہ آئے",
      "جھولیاں پھیلاؤ شاہو",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
