import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-f06c53b9",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اس خدا بھاتی صورت پہ لاکھوں سلام",
  titleRo: "",
  versesUr: [
      "اس خدا بھاتی صورت پہ لاکھوں سلام",
      "اٹھتے بوٹوں کی نَشْو و نُما پر درود",
      "کھلتے  غنچوں  کی  نکہت  پہ  لاکھوں   سلام",
      "فضلِ پیدائشی پر ہمیشہ درود",
      "کھیلنے سے کَراہت پہ لاکھوں سلام",
      "اِعتِلائے جِبِلَّت پہ عالی درود",
      "اِعتِدالِ طَوِیَّت پہ لاکھوں سلام",
      "بے بناوٹ ادا پر ہزاروں درود",
      "بے   تَکَلُّف    مَلاحت   پہ    لاکھوں  سلام",
      "بھینی بھینی مہک پر مہکتی درود",
      "پیاری پیاری نَفاست پہ لاکھوں سلام",
      "میٹھی میٹھی عبارت پہ شیریں درود",
      "اچھی اچھی اِشارت پہ لاکھوں سلام",
      "سیدھی سیدھی رَوِش پر کروروں درود",
      "سادی سادی طَبِیعَت پہ لاکھوں سلام",
      "روزِ گرم و شبِ تِیرہ و تار میں",
      "کوہ و صَحرا کی خَلْوَت پہ لاکھوں سلام",
      "جس کے گھیرے میں ہیں اَنبیا و مَلک",
      "اس جہانگیر بِعثت پہ لاکھوں سلام",
      "اندھے شیشے جھلاجھل دمکنے لگے",
  ],
};

export default kalam;
