import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-1efc1221",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "موسیِ کاظمِ جہاں ناظمِ مرا امداد کن",
  titleRo: "",
  versesUr: [
      "موسیِ کاظمِ جہاں ناظمِ مرا امداد کن",
      "بہرِ ایں بے زِینت از زَین و صَفا امداد کن",
      "ضامن ثامن رِضا بر مَن نگاہے از رضا",
      "خشم را شایانم و گویم رِضا امداد کن",
      "یا شہِ مَعروف ما را رہ سوئے معروف دِہ",
      "یا سَری اَمن از سَقْط در دوسرا امداد کن",
      "یا جنید اے بادشاہِ جُنْدِ عِرفاں المدد",
      "شِبْلِیا اے شِبْلِ شیرِ کِبریا امداد کن",
      "شیخ   عبد الواحدا   را ہَم   سوئے   واحد  نُما",
      "بے فَرح را بِالفرح طَرطوسِیا ! امداد کن",
      "بُوالحسنؔ ہکاریا حالَم حَسن کُن بے رِیا",
      "اے علی اے شاہِ عالی مُرتضٰے امداد کن",
      "سرورِ  مخزوم  سیف   اللّٰہ    اے  خالد  بقرب",
      "بو سعیدا اسعدا سعدالوریٰ امداد کن",
      "اے  تُرا   ببرے  چو  عبد القادر  جیلی   مَزید",
      "بَر سَگانِ دَرگَہش لُطفے نُما امداد کن",
      "وَہ چہ شیرِ شَرزَہ راہِ تُسْت از بختِ سعید",
      "دشتِ ضیغم لیث شیر و شیرزا امداد کن",
  ],
};

export default kalam;
