import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-0aae56f7",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مرہمِ کُہْنہ دل فِگاریْہا",
  titleRo: "",
  versesUr: [
      "مرہمِ کُہْنہ دل فِگاریْہا",
      "تِرا ذرّہ مَہِ کامل ہے یا غوث",
      "تِرا قطرہ یمِ سَائل ہے یا غوث",
      "کوئی سالِک ہے یا واصِل ہے یا غوث",
      "قدِ بے سایہ ظِلِّ کِبرِیا ہے",
      "وہ کچھ بھی ہو تِرا سائل ہے یا غوث",
      "تِری جاگیر میں ہے شَرق تا غَرب",
      "تو اس بے سایہ ظِلّ کا ظِل ہے یا غوث",
      "دل عشق و رُخ حسن آئینہ ہیں",
      "قَلمرو میں حَرم تا حِلّ ہے یا غوث",
      "تِری شمع دِل آرا کی تَب و تاب",
      "اور ان دونوں میں تیرا ظِلّہے یا غوث",
  ],
};

export default kalam;
