import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-2091ebd1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ماتھے گھس جاتے ہیں سرداروں کے",
  titleRo: "",
  versesUr: [
      "ماتھے گھس جاتے ہیں سرداروں کے",
      "طور بے طور ہیں بیماروں کے",
      "مجرمو ! چشمِ تبسم رکھو",
      "پھول بن جاتے ہیں انگاروں کے",
      "تیرے اَبرو کے تَصَدُّق پیارے",
      "بند کرّے ہیں گرفتاروں کے",
      "جان و دل تیرے قدم پر وارے",
      "کیا نصیبے ہیں ترے یاروں کے",
      "صِدق و عَدل و کرم و ہمّت میں",
      "چار سو شُہرے ہیں اِن چاروں کے",
      "بہرِ تَسلیمِ علی میداں میں",
      "سر جھکے رہتے ہیں تلواروں کے",
      "کیسے آقائوں کا بندہ ہوں رضاؔ",
      "بول بالے مِری سرکاروں کے",
  ],
};

export default kalam;
