import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-d5061b35",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "با ہمیں دستِ دوتا و دامنِ کوتاہ و تنگ",
  titleRo: "",
  versesUr: [
      "با ہمیں دستِ دوتا و دامنِ کوتاہ و تنگ",
      "اَز چَہ گِیرَم در چَہ بنہم بسکہ بے پایاں توئی",
      "کوہ نہ دامن دِہَد وقت آنکہ پُر جوش آمدی",
      "رُو مَتاب از ما بَداں چوں مایۂ غُفراں توئی",
      "بندہ اَت غیرت بُرد گر بر درِ غیرت رَوَد",
      "آیۂ رحمت توئی آئینۂ رحماں توئی",
      "سادگِیم بِیں کہ می جُویم زِ تو دَرمانِ درد",
      "وَر رَوَد چوں بِنِگَرْد ہم شاہِ آں اِیواں توئی",
      "دینِ بابائے خُودَتْ را از سرِ نو زندہ کُن",
      "درد کُو دَرماں کُجا ہم ایں توئی ہم آں توئی",
      "کافراں تَوہِینِ اسلام آشْکارا می کُنَنْد",
      "سیّدا آخِر نہ عمر سیّدُ الادْیاں توئی",
      "تا بِیایَد مَہدی اَز اَرواح و عیسیٰ از فَلک",
      "آہ اے عزِّ مسلماناں کُجا پِنْہاں توئی",
      "کشتیِ  مِلت  بمَوجے  کَالْجِبَالْ    اُفْتادَہ  اَست",
      "جلوئہ کُن خود مَسِیحا کار و مَہدی شاں توئی",
      "مَن سَرَتْ گَردَم بِیا چوں نوحِ ایں طوفاں توئی",
      "بر سر وقتِ غَریباں رَس چو کشتی باں توئی",
      "اِسْتِمْدَادُ الْعَبْدِ لِنَفْسِہٖ",
      "حَاشَ  لِلّٰہ   تنگ  گَردَد  جاہَت  از  ہَمچوں  مَنے",
  ],
};

export default kalam;
