import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-18af7f48",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَشک جاری ہوجاتے",
  titleRo: "",
  versesUr: [
      "اَشک جاری ہوجاتے",
      "ذِکْر ِرسول کے وقْت صحابہ کرام  رَضِیَ اللّٰہ تَعَالٰی عَنْہم  پر رِقَّت طاری ہو جاتی اور اَشک جاری ہو جاتے چنانچہ حضرت سیدنا عبد  اللّٰہ  ابن عمر   رَضِیَ اللّٰہ تَعَالٰی عَنْہما  جب رسول    اللّٰہ    صلَّی اللّٰہ تعالٰی عَلَیْہِ وَسَلَّم  کا تذکرہ فرماتے تھے تو آنکھوں سے آنسو رَواں ہو جاتے تھے۔",
      "(الطبقات الکبری لابن سعد،تذکرۃ عبد  اللّٰہ  بن عمر بن خطاب،ج۴،ص۱۲۷، دار الکتب العلمیۃ بیروت) کاش!ہمیں بھی یہ سعادت نصیب ہوجاتی!",
      "رونے والی آنکھیں مانگو، رونا سب کا کام نہیں",
  ],
};

export default kalam;
