import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-45618801",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "شافعی مالک احمد امامِ حَنیف",
  titleRo: "",
  versesUr: [
      "شافعی مالک احمد امامِ حَنیف",
      "چار باغِ امامت پہ لاکھوں سلام",
      "کاملانِ طریقت پہ کامل درود",
      "حاملانِ شریعت پہ لاکھوں سلام",
      "جلوئہ شانِ قدرت پہ لاکھوں سلام",
      "مُحیِ دین و ملت پہ لاکھوں سلام",
      "مردِ خیلِ طریقت پہ بے حد درود",
      "فَردِ اہلِ حقیقت پہ لاکھوں سلام",
      "جس کی منبر ہوئی گردنِ اَولیا",
      "اس قدم کی کرامت پہ لاکھوں سلام",
      "شاہِ  برکات  و  برکاتِ  پیشینیاں",
  ],
};

export default kalam;
