import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-f4f96af8",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "صبح طیبہ میں ہوئی بٹتا ہے باڑا نور کا",
  titleRo: "",
  versesUr: [
      "صبح طیبہ میں ہوئی بٹتا ہے باڑا نور کا",
      "صدقہ لینے نور کا آیا ہے تارا نور کا",
      "باغِ طیبہ میں سہانا پھول پھولا نور کا",
      "مستِ بو  ہیں  بلبلیں  پڑھتی ہیں کلمہ نور کا",
      "بارہویں کے چاند کا مُجرا ہے سجدہ نور کا",
      "بارہ بُرجوں سے جھکا ایک اِک سِتارہ نور کا",
      "ان کے قَصْرِ قَدْر سے خُلْد ایک کمرہ نور کا",
      "سِدْرَہ پائیں باغ میں ننھا سا پودا نور کا",
      "عرش بھی فِردوس بھی اس شاہِ والا نور کا",
      "یہ    مُثَمَّن   بُرج  وہ   مُشکُوئے  اَعلیٰ  نور  کا",
      "آئی بدعت چھائی ظلمت رنگ بدلا نور کا",
      "ماہِ سُنّت مِہْرِ طَلْعت لے لے بدلا نور کا",
      "تیرے ہی ماتھے رہا اے جان سہرا نور کا",
      "بخت جاگا نور کا چمکا ستارا نور کا",
      "میں گدا تو بادشاہ بھر دے پیالہ نور کا",
      "نور دن دُونا تِرا دے ڈال صدقہ نور کا",
      "تیری ہی جانب ہے پانچوں وقت سجدہ نور کا",
      "رُخ ہے قبلہ نور کا اَبرو ہے کعبہ نور کا",
      "پُشت پر ڈَھلکا سرِ انور سے شَمْلَہ نور کا",
      "دیکھیں موسیٰ طُور سے اُترا صَحِیفہ نور کا",
      "تاج والے دیکھ کر تیرا عِمامہ نور کا",
      "سر جھکاتے ہیں الٰہی بول بالا نور کا",
      "بِینیِ   پُرنور   پر  رَخشاں  ہے    بُکّہ    نور  کا",
  ],
};

export default kalam;
