import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-21763705",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اُمَّتان و سیاہ کاریْہا",
  titleRo: "",
  versesUr: [
      "اُمَّتان و سیاہ کاریْہا",
      "شافعِ  حشر و غم گُساریْہا",
      "دُور از کُوئے صاحب کوثر",
      "چشم دارَد چہ اَشکباریْہا",
      "در فراقِ تو  یَا رَسُوْلَ اللّٰہ",
      "سینہ دارد چہ بے قراریْہا",
      "ظلمت آباد گُور روشن شُد",
      "داغِ دل راسْتْ نور باریْہا",
      "چہ کُنَد نفس پردہ در مولیٰ",
      "چوں توئی گرمِ پردہ داریْہا",
      "سگِ کُوئے نبی و یک نگہے",
      "مَن و تا حشر جاں نِثاریْہا",
      "سَوْفَ یُعْطِیْکَ رَبکَ تَرْضٰی",
      "حق نَمُودَت چہ پاسْداریْہا",
      "دارَم اے گُل بَیادِ زلف و رخت",
      "سحر و شام آہ و زاریْہا",
      "تا زِہ لُطْفِ تو بر رضاؔ ہر دم",
  ],
};

export default kalam;
