import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-a453b9d2",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "فِی تَفْضِیْلہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ عَلَی الْاَوْلِیَاء",
  titleRo: "",
  versesUr: [
      "فِی تَفْضِیْلہٖ رَضِیَ اللّٰہ تَعَالٰی عَنْہ عَلَی الْاَوْلِیَاء",
      "اَولیا را گر گُہر باشَد تو بحرِ گوہری",
      "وَرْ بَدَستِ شاں زَرے دادَند زرْ را کاں توئی",
      "واصلاں را در مقامِ قُرب شانے دادَہ اَند",
      "شوکتِ شاں شُد زِ شان و شانِ شانِ شاں توئی",
      "قَصرِ عارف ہر چہ بالاتر بتو محتاج تر",
      "نے ہَمِیں بنّا کہ ہم بُنیادِ ایں بُنیاں توئی",
  ],
};

export default kalam;
