import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-c908b09c",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "تمہارے ذرّے کے پر تو ستار ہائے فلک",
  titleRo: "",
  versesUr: [
      "تمہارے ذرّے کے پر تو ستار ہائے فلک",
      "تمہارے ذَرِّے کے پر تو ستارہائے فلک",
      "اگرچہ چھالے ستاروں سے پڑ گئے لاکھوں",
      "تمہارے نعل کی ناقِص مِثل ضیائے فلک",
      "سرِ فلک نہ کبھی تابہ آستاں پہنچا",
      "مگر تمہاری طلب میں تھکے نہ پائے فلک",
      "یہ مٹ کے ان کی رَوِش پر ہوا خود اُن کی رَوِش",
      "کہ اِبتدائے بُلندی تھی اِنتہائے فلک",
      "تمہاری یاد میں گزری تھی جاگتے شب بھر",
      "کہ نقشِ پا ہے زَمیں پر نہ صَوْتِ پائے فلک",
      "نہ جاگ اُٹھیں کہیں اہلِ بقیع کچی نیند",
      "چلی نسیم، ہوئے بند دِیدہائے فلک",
      "یہ اُن کے جلوہ نے کیں گرمیاں شبِ اسرا",
      "چلا یہ نرم نہ نِکلی صَدائے پائے فلک",
      "مِرے غنی نے جواہر سے بھر دِیا دامن",
      "کہ جب سے چرخ میں ہیں نقرہ و طلائے فلک",
      "رہا جو قانعِ یک نانِ سوختہ دن بھَر",
      "گیا جو کاسۂ مہ لے کے شب گدائے فلک",
      "تجمل شبِ اسرا ابھی سمٹ نہ چکا",
      "مِلی حضور سے کانِ گہر جزائے فلک",
      "خطابِ حق بھی ہے دربابِ خلق  مِنْ اَجَلِکْ",
      "کہ جب سے ویسی ہی کوتل ہیں سبز ہائے فلک",
  ],
};

export default kalam;
