import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-6e8e6695",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اے شہسَوار طیبہ! میں تیری رکاب ہُوں",
  titleRo: "",
  versesUr: [
      "اے شہسَوار طیبہ! میں تیری رکاب ہُوں",
      "کیا کیا ہیں تجھ سے ناز تِرے قصر کو کہ میں",
      "کعبہ کی جان، عرشِ بریں کا جواب ہُوں",
      "شاہا بُجھے سقر مِرے اشکوں سے تانہ میں",
      "آبِ عبث چکیدئہ چشمِ کباب ہُوں",
      "میں تو کہا ہی چاہوں کہ بندہ ہُوں شاہ کا",
      "پر لُطف جب ہے کہدیں اگر وہ جناب’’ہُوں‘‘",
      "حسرت میں خاک بوسیِ طیبَہ کی اے رضاؔ",
      "ٹپکا جو چشمِ مہر سے وہ خونِ ناب ہوں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
