import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-bd4e0c56",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "طُوبیٰ میں جو سب سے اُونچی نازُک سیدھی نکلی شاخ",
  titleRo: "",
  versesUr: [
      "طُوبیٰ میں جو سب سے اُونچی نازُک سیدھی نکلی شاخ",
      "طوبے میں جو سب سے اُونچی نازُک سیدھی نکلی شاخ",
      "مولیٰ گُلْبُن، رحمت زہر ا،سِبْطَین(1) اس کی کلیاں پُھول",
      "مانگوں نعت نبی لکھنے کو روحِ قُدس سے ایسی شاخ",
      "شاخِ قامت شہ میں زلف و چشم و رخسار و لب ہیں",
      "صدّیق وفاروق و عثماں، حیدر ہر اِک اُس کی شاخ",
      "اپنے اِن باغوں کا صدقہ وہ رحمت کا پانی دے",
      "سُنْبُل، نرگس، گُل، پنکھڑیاں قُدرت کی کیا پھولی شاخ",
      "یادِ رُخ میں آہیں کر کے بن میں میں رویا آئی بہار",
      "جس سے نخلِ دل میں ہو پیدا پیارے تیری وِلا کی شاخ",
      "ظاہر و باطن اَوّل و آخر زیب فروع و زَین اُصول",
      "جُھومیں نسیمیں،نیساں برسا، کلیاں چٹکیں، مہکی شاخ",
      "باغِ رسالت میں ہے تُو ہی گل،غنچہ، جڑ،پتّی شاخ",
  ],
};

export default kalam;
