import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-9ba24b9b",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بِسْمِ  اللّٰہ   و  ناس  را  شروع  و  پایا                 اَلْحَمْدُ    لِرَب",
  titleRo: "",
  versesUr: [
      "بِسْمِ  اللّٰہ   و  ناس  را  شروع  و  پایا                 اَلْحَمْدُ    لِرَب",
      "*…*…*…*…*…*",
      "پہاڑوں کا سلام کرنا",
      "حضرت علی   کَرَّمَ اللّٰہ تَعَالٰی وَجْہَہُ الْکَرِیْم    فرماتے ہیں: ایک مرتبہ میں حضورِ انور  صلَّی اللّٰہ تعالٰی عَلَیْہِ وَسَلَّم  کے ساتھ مکہ مکرمہ میں ایک طرف کو نکلا تو میں نے دیکھا کہ جو درخت اور پہاڑ بھی سامنے آتا ہے اس سے ’’  اَلسَّلَامُ عَلَیْکَ   یَا رَسُوْلَ اللّٰہ ‘‘کی آواز آتی ہے اور میں خود اس آواز کو اپنے کانوں سے سن رہا تھا۔",
      "(سنن الترمذی،الحدیث:۳۶۴۶،ج۵،ص ۳۵۹)",
  ],
};

export default kalam;
