import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-03641468",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مژدہ باد اے عاصیو! شافِع شہِ اَبرار ہے",
  titleRo: "",
  versesUr: [
      "مژدہ باد اے عاصیو! شافِع شہِ اَبرار ہے",
      "تَہْنِیت اے مجرمو! ذاتِ خدا غَفَّار ہے",
      "عرش سا فرشِ زمیں ہے فرشِ پا عرشِ بریں",
      "کیا نرالی طرز کی نامِ خُدا رَفتار ہے",
      "چاند شق ہو پَیڑ بولیں جانور سجدے کریں",
      "بَارَ   کَ    اللّٰہ   مرجع  عالم  یہی  سرکار  ہے",
      "جن کو سُوئے آسماں پھیلا کے جل تھل بھر دئیے",
      "صَدقہ اُن ہاتھوں کا پیارے ہم کو بھی درکار ہے",
      "لَب زُلالِ چَشمَہ ء کن میں گندھے وقت خمیر",
      "مردے زندہ کرنا اے جاں تم کو کیا دُشوار ہے",
      "گورے گورے پائوں چمکا دو خدا کے واسطے",
      "نُور کا تڑکا ہو پیارے گور کی شب تار ہے",
      "تیرے ہی دامن پہ ہر عاصِی کی پڑتی ہے نظر",
      "ایک جانِ بے خطا پر دو جہاں کا بار ہے",
      "جوشِ طُوفاں بحرِ بے پایاں ہوا نا سازگار",
      "نُوح کے مولیٰ کرم کر لے تو بیڑا پار ہے",
      "رَحْمَۃُ لِّلْعٰلَمِیں  تیری  دُہائی  دَب  گیا",
      "اب تو مولیٰ بے طرح سر پر گنہ کا بار ہے",
      "حیرتیں ہیں آئینہ دارِ وفورِ وَصفِ گُل",
      "اُن کے بلبل کی خموشی بھی لبِ اِظہار ہے",
      "گُونج گُونج اُٹھے ہیں نغماتِ رضاؔ سے بوستاں",
      "کیوں نہ ہو کس پھول کی مدحت میں وَا مِنقار ہے",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
