import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-20cc03e6",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "سرور کہوں کہ مالک و مَولیٰ کہوں تجھے",
  titleRo: "",
  versesUr: [
      "سرور کہوں کہ مالک و مَولیٰ کہوں تجھے",
      "باغِ خلیل کا گلِ زَیبا کہوں تجھے",
      "حرماں نصیب ہوں تجھے امید گہ کہوں",
      "جانِ مراد و کانِ تَمَنّا کہوں تجھے",
      "گلزارِ قدس کا گلِ رنگیں اَدا کہوں",
      "دَرمانِ دَرْدِ بُلبُلِ شیدا کہوں تجھے",
      "صبح وَطن پہ شامِ غریباں کو دُوں شَرَف",
      "بیکس نواز گیسووں والا کہوں تجھے",
      "اللّٰہ   رے  تیرے  جسمِ  منوّر  کی  تابِشیں",
      "اے جانِ جاں میں جانِ تجلّا کہوں تجھے",
      "بے داغ لالہ یا قمر بے کلف کہوں",
      "بے خار گلبنِ چمن آرا کہوں تجھے",
      "مجرم ہُوں اپنے عفو کا ساماں کروں شہا",
      "یعنی شفیع روزِ جزا کا کہوں تجھے",
      "اِس مُردہ دل کو مژدہ حیاتِ ابد کا دُوں",
      "تاب و توانِ جانِ مسیحا کہوں تجھے",
      "تیرے تو وَصف عیب تناہی سے ہیں بَری",
      "حیراں ہُوں میرے شاہ میں کیا کیا کہوں تجھے",
      "کہہ لے گی سب کچھ اُن کے ثناخواں کی خامُشی",
      "چپ ہو رہا ہے کہہ کے میں کیا کیاکہوں تجھے",
      "لیکن رضاؔ نے ختم سخن اس پہ کر دیا",
      "خالِق کا بندہ خلق کا آقا کہوں تجھے",
  ],
};

export default kalam;
