import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-995e8bb0",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "رُخ دن ہے یا مہرِ سَما یہ بھی نہیں وہ بھی نہیں",
  titleRo: "",
  versesUr: [
      "رُخ دن ہے یا مہرِ سَما یہ بھی نہیں وہ بھی نہیں",
      "شب زُلف یا مُشکِ ختا یہ بھی نہیں وہ بھی نہیں",
      "ممکن میں یہ قدرت کہاں واجب میں عبدیت کہاں",
      "حیراں ہوں یہ بھی ہے خطا یہ بھی نہیں وہ بھی نہیں",
      "حق یہ کہ ہیں عبدِ الٰہ اور عالمِ امکاں کے شاہ",
      "برزخ ہیں وہ سِّرِ خدا یہ بھی نہیں وہ بھی نہیں",
      "بُلبل نے گُل اُن کو کہا قُمری نے سروِ جانفزا",
      "حیرت نے جھنجھلا کر کہا یہ بھی نہیں وہ بھی نہیں",
      "خورشید تھا کس زور پر کیا بڑھ کے چمکا تھا قمر",
      "بے پردہ جب وہ رُخ ہوا یہ بھی نہیں وہ بھی نہیں",
      "ڈر تھا کہ عصیاں کی سزا اب ہو گی یا روزِ جزا",
      "دی اُن کی رحمت نے صدا یہ بھی نہیں وہ بھی نہیں",
      "کوئی ہے نازاں زُہد پر یا حسنِ توبہ ہے سِپر",
      "یاں ہے فقط تیری عطا یہ بھی نہیں وہ بھی نہیں",
      "دن لَہْو میں کھونا تجھے شب صبح تک سونا تجھے",
      "شرمِ نبی خوفِ خدا یہ بھی نہیں وہ بھی نہیں",
      "رزقِ خدا کھایا کیا فرمانِ حق ٹالا کیا",
      "شکرِ کرم ترسِ سزا یہ بھی نہیں وہ بھی نہیں",
      "ہے بلبُل رنگیں رضاؔ یا طُوطی نغمَہ سرا",
      "حق یہ کہ واصِف ہے تِرا یہ بھی نہیں وہ بھی نہیں",
      "*…*…*…*…*…*",
  ],
};

export default kalam;
