import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-118",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "باقیِ اَسیاد یا سَجّاد یا شاہِ جواد",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `باقیِ اَسیاد یا سَجّاد یا شاہِ جواد`, m2: `خضرِ ِارشاد آدمِ آلِ عَبا امداد کن` },
    { m1: `اے بَقَیدِ ظلم و صَد قیدی زِ بندِ غم کُشا`, m2: `اے تہِ بے داد و کانِ دادہا امداد کن` },
    { m1: `باقِرا یا عالِمِ سادات یا بَحْرُ الْعُلُوْم`, m2: `از علُومِ خود بَدَفْعِ جَہْلِ ما امداد کن` },
    { m1: `جعفر صادق بحقْ ناطِق بحق واثِق توئی`, m2: `بہرِ حق ما را طریقِ حق نُما امداد کن` },
    { m1: `شانِ حلمًا کانِ علمًا جانِ سلماً اَلسَّلام`, m2: `موسیِ کاظمِ جہاں ناظمِ مرا امداد کن` },
    { m1: `اے تُرا زَین از عبادت و زِ تو زینِ عابداں`, m2: `بہرِ ایں بے زِینت از زَین و صَفا امداد کن` },
    { m1: `ضامن ثامن رِضا بر مَن نگاہے از رضا`, m2: `خشم را شایانم و گویم رِضا امداد کن` },
    { m1: `یا شہِ مَعروف ما را رہ سوئے معروف دِہ`, m2: `یا سَری اَمن از سَقْط در دوسرا امداد کن` },
    { m1: `یا جنید اے بادشاہِ جُنْدِ عِرفاں المدد`, m2: `شِبْلِیا اے شِبْلِ شیرِ کِبریا امداد کن` },
    { m1: `شیخ عبد الواحدا را ہَم سوئے واحد نُما`, m2: `بے فَرح را بِالفرح طَرطوسِیا ! امداد کن` },
    { m1: `بُوالحسنؔ ہکاریا حالَم حَسن کُن بے رِیا`, m2: `اے علی اے شاہِ عالی مُرتضٰے امداد کن` },
    { m1: `سرورِ مخزوم سیف اللہ اے خالد بقرب`, m2: `بو سعیدا اسعدا سعدالوریٰ امداد کن` },
    { m1: `اے تُرا ببرے چو عبد القادر جیلی مَزید`, m2: `بَر سَگانِ دَرگَہش لُطفے نُما امداد کن` },
    { m1: `وَہ چہ شیرِ شَرزَہ راہِ تُسْت از بختِ سعید`, m2: `دشتِ ضیغم لیث شیر و شیرزا امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
