import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-8",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "تابِ مرآتِ سحر گردِ بیابانِ عرب",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `تابِ مرآتِ سحر گردِ بیابانِ عرب`, m2: `غازۂ رُوئے قمر دُودِ چراغانِ عرب` },
    { m1: `اللہ اللہ بہارِ چَمَنِستانِ عرب`, m2: `پاک ہیں لوثِ خزاں سے گل و رَیحانِ عرب` },
    { m1: `جوشِش اَبر سے خونِ ُگلِ فردوس کرے`, m2: `چھیڑ دے رَگ کو اگر خارِ بیابانِ عرب` },
    { m1: `تشنۂ نہرِ جناں ہر عربی و عجمی!`, m2: `لب ہر نہرِ جناں تشنۂ نیسانِ عرب` },
    { m1: `طوقِ غم آپ ہوائے پرِ قُمری سے گرے`, m2: `اگر آزاد کرے سروِ خرامانِ عرب` },
    { m1: `مہر میزاں میں چھپا ہو تو حمل میں چمکے`, m2: `ڈالے اِک بُوند شبِ دَے میں جو بارانِ عرب` },
    { m1: `عرش سے مژدۂ بلقیسِ شفاعت لایا`, m2: `طائر سِدْرَہ نشیں مرغِ سلیمانِ عرب` },
    { m1: `حُسنِ یوسُف پہ کٹیں مِصْر میں اَنگُشتِ زَناں`, m2: `سَر کٹاتے ہیں تِرے نام پہ مردانِ عرب` },
    { m1: `کوچہ کوچہ میں مہکتی ہے یہاں بوئے قمیص`, m2: `یوسُفِستاں ہے ہر اِک گوشۂ کنعانِ عرب` },
    { m1: `بزمِ قدسی میں ہے یادِ لب جاں بخش حضور`, m2: `عالمِ نور میں ہے چشمۂ حیوانِ عرب` },
    { m1: `پائے جبریل نے سرکار سے کیا کیا القاب`, m2: `خُسرو خَیلِ ملک، خادمِ سلطانِ عرب` },
    { m1: `بلبل و نیلپر و کبک بنو پروانو!`, m2: `مہ و خورشید پہ ہنستے ہیں چراغانِ عرب` },
    { m1: `حُور سے کیا کہیں موسیٰ سے مگر عرض کریں`, m2: `کہ ہے خود حُسنِ اَزَل طالب جانانِ عرب` },
    { m1: `کرمِ نعت کے نزدیک تو کچھ دُور نہیں`, m2: `کہ رضاؔئے عجمی ہو سگِ حسّانِ عرب` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
