import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-37",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "کیا ہی ذوق افزا شفاعت ہے تمہاری واہ واہ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `کیا ہی ذوق افزا شفاعت ہے تمہاری واہ واہ`, m2: `قرض لیتی ہے گنہ پرہیز گاری واہ واہ` },
    { m1: `خامۂ قدرت کا حُسنِ دست کاری واہ واہ`, m2: `کیا ہی تصویر اپنے پیارے کی سنواری واہ واہ` },
    { m1: `اشک شب بھر انتظارِ عفوِ اُمّت میں بہیں`, m2: `میں فِدا چاند اور یُوں اختر شماری واہ واہ` },
    { m1: `اُنگلیاں ہیں فیض پر ٹُوٹے ہیں پیاسے جھوم کر`, m2: `ندیاں پنجابِ رحمت کی ہیں جاری واہ واہ` },
    { m1: `نُور کی خیرات لینے دوڑتے ہیں مہر و ماہ`, m2: `اُٹھتی ہے کس شان سے گردِ سواری واہ واہ` },
    { m1: `نیم جلوے کی نہ تاب آئے قمر ساں تو سہی`, m2: `مہر اور ان تلووں کی آئینہ داری واہ واہ` },
    { m1: `نفس یہ کیا ظلم ہے جب دیکھو تازہ جرم ہے`, m2: `ناتواں کے سر پر اِتنا بوجھ بھاری واہ واہ` },
    { m1: `مجرموں کو ڈُھونڈتی پِھرتی ہے رَحمت کی نِگاہ`, m2: `طالعِ برگَشْتہ تیری سازگاری واہ واہ` },
    { m1: `عرض بیگی ہے شفاعت عَفو کی سرکار میں`, m2: `چھنٹ رہی ہے مجرموں کی فرد ساری واہ واہ` },
    { m1: `کیا مَدینہ سے صبا آئی کہ پھولوں میں ہے آج`, m2: `کچھ نئی بُو بِھینی بِھینی پیاری پیاری واہ واہ` },
    { m1: `خود رہے پردے میں اور آئینہ عکسِ خاص کا`, m2: `بھیج کر اَنجانوں سے کی راہ داری واہ واہ` },
    { m1: `اِس طرف رَوضہ کا نور اُس سَمْت منبر کی بہار`, m2: `بیچ میں جنت کی پیاری پیاری کیاری واہ واہ` },
    { m1: `صدقے اس اِنعام کے قربان اس اِکرام کے`, m2: `ہو رہی ہے دونوں عالَم میں تمہاری ’’واہ واہ‘‘` },
    { m1: `پارۂ دل بھی نہ نِکلا دِل سے تحفے میں رضاؔ`, m2: `اُن سگانِ کو سے اتنی جان پیاری واہ واہ` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
