import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-1",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "لطف ان کا عام ہو ہی جائے گا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `لطف ان کا عام ہو ہی جائے گا`, m2: `شاد ہر ناکام ہو ہی جائے گا` },
    { m1: `جان دے دو وعدۂ دیدار پر`, m2: `نقد اپنا دام ہو ہی جائے گا` },
    { m1: `شاد ہے فردوس یعنی ایک دن`, m2: `قسمتِ خدام ہو ہی جائے گا` },
    { m1: `یاد رہ جائیں گی یہ بے باکیاں`, m2: `نفس تو تو رام ہو ہی جائے گا` },
    { m1: `بے نشانوں کا نشاں مِٹتا نہیں`, m2: `مٹتے مٹتے نام ہو ہی جائے گا` },
    { m1: `یادِ گیسو ذکرِ حق ہے آہ کر`, m2: `دل میں پیدالام ہو ہی جائے گا` },
    { m1: `ایک دن آواز بدلیں گے یہ ساز`, m2: `چہچہا کہرام ہو ہی جائے گا` },
    { m1: `سائلو! دامن سخی کا تھام لو`, m2: `کچھ نہ کچھ انعام ہو ہی جائے گا` },
    { m1: `یاد ابرو کر کے تڑپو بلبلو!`, m2: `ٹکڑے ٹکڑے دام ہو ہی جائے گا` },
    { m1: `مفلِسو! اُن کی گلی میں جا پڑو`, m2: `باغِ خلد اکرام ہو ہی جائے گا` },
    { m1: `گر یونہی رحمت کی تاویلیں رہیں`, m2: `مدح ہر الزام ہو ہی جائے گا` },
    { m1: `بادہ خواری کا سماں بندھنے تو دو`, m2: `شیخ دُرد آشام ہو ہی جائے گا` },
    { m1: `غم تو ان کو بھول کر لپٹا ہے یوں`, m2: `جیسے اپنا کام ہو ہی جائے گا` },
    { m1: `مِٹ! کہ گر یونہی رہا قرضِ حیات`, m2: `جان کا نیلام ہو ہی جائے گا` },
    { m1: `عاقلو! ان کی نظر سیدھی رہے`, m2: `بَوروں کا بھی کام ہو ہی جائے گا` },
    { m1: `اب تو لائی ہے شفاعت عفو پر`, m2: `بڑھتے بڑھتے عام ہو ہی جائے گا` },
    { m1: `اے رضاؔ ہر کام کا اِک وقت ہے`, m2: `دل کو بھی آرام ہو ہی جائے گا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
