import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-122",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "شاہِ بَرَکات اے ابُو البرکات اے سلطانِ جُود",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `شاہِ بَرَکات اے ابُو البرکات اے سلطانِ جُود`, m2: `بَارَکَ اللہ اے مبارک بادشا امداد کن` },
    { m1: `عِشْقی اے مَقْتُولِ عشق اے خوں بَہایَت عینِ ذات`, m2: `اے زِ جاں بِگُزشْتہ جاناں واصِلا امداد کن` },
    { m1: `بے خودا و با خدا آلِ محمد مصطفیٰ`, m2: `سیّدا حق واجِدا یا مُقْتَدا امداد کن` },
    { m1: `اے حَریمِ طیبۂ تَوحید را کوہِ اُحد`, m2: `یا جبل یا حمزہ یا شیرِ خدا امداد کن` },
    { m1: `اے سراپا چشم گَشْتہ در شُہُودِ عینِ ہُو`, m2: `زاں سبب کَردَنْدْ نامَتْ عَیْنیا امداد کن` },
    { m1: `یا ابوالفضل آلِ احمد حضرتِ اچھے میاں`, m2: `شاہ شمس الدّیں ضِیاء الاصفِیا امداد کن` },
    { m1: `وَحی بر جَدِّ تو لَا یَاْتَل اُولُوالْفَضْلآمدَہ اَست`, m2: `بندئہ بے بَرگ را فضل و غِنا امداد کن` },
    { m1: `گو نہ ہجرت کَردَم از اِثْم و غَیٰ اَرْزَم بقرب`, m2: `آخر ایں در رانیم مسکیں گدا امداد کن` },
    { m1: `اے کہ شَمسی و کَرامَتْہائے تو مثلِ نُجوم`, m2: `اے عَجب ہم مِہر و ہم اَنجم نُما امداد کن` },
    { m1: `من سَرت کر دم دمے دیگر زِ شرقِ خَرق تاب`, m2: `آفتابا! در شبِ داجِم بِیا امداد کن` },
    { m1: `تاجْدارِ حضرتِ مارہرہ یا آلِ رسول`, m2: `اے خدا خواہ و جدا از ماعَدا امداد کن` },
    { m1: `اے شہِ والا عمیمِ آلا عظیم المرتبۃ`, m2: `اے پَئے اِلاّ ذبیحِ تیغِ لا امداد کن` },
    { m1: `نائلِ جُود اَز نَمے زاں یم مَرا سیراب ساز`, m2: `نوگلِ جود از شَمّے جانَم فَزا امداد کن` },
    { m1: `اے عجب غَیبے تُرا مَشہُود از غیبِ شُہود`, m2: `دِیدَہ از خود بستی و دیدی خدا امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
