import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-71",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یاالٰہی ہر جگہ تیری عطا کا ساتھ ہو",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `یاالہٰی ہر جگہ تیری عطا کا ساتھ ہو`, m2: `جب پڑے مشکل شہِ مشکل کشا کا ساتھ ہو` },
    { m1: `یاالٰہی بُھول جاؤں نزع کی تکلیف کو`, m2: `شادیِ دِیدار حُسنِ مصطفیٰ کا ساتھ ہو` },
    { m1: `یاالٰہی گورِ تیرہ کی جب آئے سخت رات`, m2: `اُن کے پیارے منھ کی صبحِ جانفِزا کا ساتھ ہو` },
    { m1: `یاالٰہی جب پڑے محشر میں شورِ داروگِیر`, m2: `اَمن دینے والے پیارے پیشوا کا ساتھ ہو` },
    { m1: `یاالٰہی جب زبانیں باہَر آئیں پیاس سے`, m2: `صاحبِ کوثر شہِ جُود و عطا کا ساتھ ہو` },
    { m1: `یاالٰہی سرد مِہری پر ہو جب خورشیدِ حشر`, m2: `سیّد بے سایہ کے ظِل لوا کا ساتھ ہو` },
    { m1: `یاالٰہی گرمیِ محشر سے جب بھڑکیں بدن`, m2: `دامنِ محبوب کی ٹھنڈی ہوا کا ساتھ ہو` },
    { m1: `یاالٰہی نامۂ اعمال جب کُھلنے لگیں`, m2: `عیب پوشِ خلق ستّارِ خطا کا ساتھ ہو` },
    { m1: `یاالہٰی جب بہیں آنکھیں حسابِ جُرم میں`, m2: `اُن تبسّم ریز ہونٹوں کی دُعا کا ساتھ ہو` },
    { m1: `یاالہٰی جب حسابِ خندئہ بیجا رُلائے`, m2: `چشمِ گریانِ شفیعِ مُرتجٰے کا ساتھ ہو` },
    { m1: `یاالہٰی رنگ لائیں جب مِری بے باکیاں`, m2: `اُن کی نیچی نیچی نظروں کی حیا کا ساتھ ہو` },
    { m1: `یاالہٰی جب چلوں تاریک راہِ پُل صِراط`, m2: `آفتابِ ہاشمی نُور الہُدیٰ کا ساتھ ہو` },
    { m1: `یاالہٰی جب سرِ شمشیر پر چلنا پڑے`, m2: `رَبِّ سَلِّم ْکہنے والے غمزِدا کا ساتھ ہو` },
    { m1: `یاالہٰی جو دُعائے نیک میں تجھ سے کروں`, m2: `قُدسیوں کے لب سے آمیںرَبَّنَا کا ساتھ ہو` },
    { m1: `یاالہٰی جب رضاؔ خوابِ گِراں سے سر اُٹھائے`, m2: `دولتِ بیدارِ عشقِ مصطفیٰ کا ساتھ ہو` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
