import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-246",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اے بَدَورِ خود امامِ اہلِ اِیقاںآمدَہ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `اے بَدَورِ خود امامِ اہلِ اِیقاں آمدَہ`, m2: `جانِ اِنس و جانِ جانّ و جانِ جاناں آمدَہ` },
    { m1: `قامتِ تو سَرْوِناز جُوئبارِ معرِفت`, m2: `روئے تو خورشیدِ عالَمْتابِ اِیماں آمدَہ` },
    { m1: `مُوئے زُلفِ عَنْبرِینَتْ قوّتِ رُوحِ ہُدیٰ`, m2: `رنگِ رُویَت غازَئہ دینِ مسلماں آمدَہ` },
    { m1: `زنگ از دِلْہا زوایَد خاک بوسیِ دَرَتْ`, m2: `تابْناک از جلوہ اَت مِرآتِ احساں آمدَہ` },
    { m1: `صد لَطائف می کُشایَد یک نگاہِ لطفِ تو`, m2: `دستِ فَیضانَت کَلیدِ بابِ عِرفاں آمدَہ` },
    { m1: `نامَتْ آلِ احمد و احمد شفیع الْمُذنِبیں`, m2: `زاں دل از دستِ گُنہ پیشِ تو نالاں آمدَہ` },
    { m1: `پُرصَدا شُد باغِ قدس از نغمہائے وصفِ تو`, m2: `تا بہارِ جنّت از گلزارِ جیلاں آمدَہ` },
    { m1: `چوں گلِ آلِ محمد رنگِ حمزہ برفُروخت`, m2: `بوئے آلِ احمد اندر باغِ عرفاں آمدَہ` },
    { m1: `گُلبُنِ نَورَستہ اَت را سبزۂ چرخِ کُہن`, m2: `فرشِ پااَنداز بزمِ رفعتِ شاں آمدَہ` },
    { m1: `تا کَشیدَم نالۂ یا آلِ احمد اَلْغِیاث`, m2: `بے سر و سامانیم را طُرفہ ساماں آمدَہ` },
    { m1: `در پناہِ سایۂ دامانَت اے ابرِ کرم`, m2: `گرمیِ غم کُشتۂ با سوزِ اَحزاں آمدَہ` },
    { m1: `دل فَگارے آبلہ پائے بَشہرِ جُودِ تو`, m2: `از بیابانِ بلا اُفتان و خِیزاں آمدَہ` },
    { m1: `تازہ فریادے برآوَرد اے مَسِیحا بر دَرَتْ`, m2: `کُہنہ رَنجُورے کہ از غم بر لَبَش جاں آمدَہ` },
    { m1: `زہر نوشِ جامِ غم در حسرتِ فِیْہِ شِفَاء`, m2: `زِ اَنگبِینِ رَحمتَتْ یک جُرعہ جُویاں آمدَہ` },
    { m1: `بہرِ آں رنگیں ادا گل برگ چَند آلِ رسول`, m2: `بَرکش از دل خارِ آلامے کہ در جاں آمدَہ` },
    { m1: `احمد نوری دریں ظلماتِ رنج و تِشنگی`, m2: `رہنمائم سوئے تو اے آبِ حیواں آمدَہ` },
    { m1: `اے زُلالِ چشمۂ کوثر لبِ سیراب تو`, m2: `بر درِ پاکَت رضاؔ با جانِ سوزاں آمدَہ` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
