import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-125",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَلَا یٰٓاَیُّھَاالسَّاقِیْ اَدِرْ کَاْسًا وَّ نَاوِلْھَا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `اَلَا یٰایُّھَا السَّاقِیْ اَدِرْ کَاْسًاوَّ نَاوِلْھَا`, m2: `کہ بَر یادِ شہِ کوثر بِنا سازَیم مَحفِلہا` },
    { m1: `بَلا بارِید حُبِّ شیخِ نجدی بَر وہابِیَہ`, m2: `کہ عشق آساں نمود اوّل و لَے اُفتاد مُشکل ہا` },
    { m1: `وہابی گَر چہ اِخفا می کُنَد بغضِ نبی لیکن`, m2: `نِہاں کَے ماند آں رازے کزُو سازَند مَحفِلہا` },
    { m1: `تَوَہُّب گاہ مُلکِ ہند اِقامَت را نَمی شایَد`, m2: `جَرَس فریاد می دارَد کہ بَربَندید مَحمِلہا` },
    { m1: `صَلائے مَجلِسَم در گوش آمد بِیں بِیا بِشِنَو`, m2: `جَرس مَستانہ می گُویَد کہ بَربَندید مَحمِلہا` },
    { m1: `مَگَرداں رُو اَزیں محفل رہِ اَربابِ سنّت رَو`, m2: `کہ سالِک بے خبر نبوَد زِ راہ و رسمِ مَنزلہا` },
    { m1: `در اِیں جَلْوَت بِیا از راہِ خَلْوَت تا خُدا یابی`, m2: `مَتٰی مَا تَلْقَ مَنْ تَھْوٰی دَعِ الدُّنْیَا وَ اَمْھِلْھَا` },
    { m1: `دِلَم قُربانَت اے دُودِ چراغِ محفلِ مَوْلِد`, m2: `زِ تابِ جَعْدِ مُشکِینَت چِہ خوں اُفتاد در دِلْہا` },
    { m1: `غریقِ بحرِ عشقِ احمدیم اَز فرحتِ مَولِد`, m2: `کُجا دانَند حالِ ما سبکسارانِ سَاحِلْہا` },
    { m1: `رضاء مستِ جامِ عشق ساغر باز می خواہَد`, m2: `اَلَا یٰایُّھَا السَّاقِیْ اَدِرْ کَاْسًاوَّ نَاوِلْھَا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
