import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-24",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وہ سُوئے لالہ زار پِھرتے ہیں",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `وہ سُوئے لالہ زار پِھرتے ہیں`, m2: `تیرے دِن اے بہار پِھرتے ہیں` },
    { m1: `جو تِرے در سے یار پِھرتے ہیں`, m2: `در بدر یُوں ہی خوار پِھرتے ہیں` },
    { m1: `آہ کل عیش تو کیے ہم نے`, m2: `آج وہ بے قرار پِھرتے ہیں` },
    { m1: `ان کے اِیما سے دونوں باگوں پر`, m2: `خیلِ لیل و نہار پِھرتے ہیں` },
    { m1: `ہر چراغِ مزار پر قُدسی`, m2: `کیسے پروانہ وار پِھرتے ہیں` },
    { m1: `اُس گلی کا گدا ہوں میں جس میں`, m2: `مانگتے تاجدار پِھرتے ہیں` },
    { m1: `جان ہیں جان کیا نظر آئے`, m2: `کیوں عَدو گِردِ غار پِھرتے ہیں` },
    { m1: `پُھول کیا دیکھوں میری آنکھوں میں`, m2: `دشتِ طیبہ کے خار پِھرتے ہیں` },
    { m1: `لاکھوں قُدسی ہیں کام خدمت پر`, m2: `لاکھوں گِردِ مزار پِھرتے ہیں` },
    { m1: `وردیاں بولتے ہیں ہرکارے`, m2: `پہرہ دیتے سوار پِھرتے ہیں` },
    { m1: `رکھیے جیسے ہیں خانہ زاد ہیں ہم`, m2: `مَوْل کے عیب دار پِھرتے ہیں` },
    { m1: `ہائے غافِل وہ کیا جگہ ہے جہاں`, m2: `پانچ جاتے ہیں چار پِھرتے ہیں` },
    { m1: `بائیں رستے نہ جا مسافِر سُن`, m2: `مال ہے راہ مار پِھرتے ہیں` },
    { m1: `جاگ سنسان بن ہے رات آئی`, m2: `گُرگ بہرِ شِکار پِھرتے ہیں` },
    { m1: `نفس یہ کوئی چال ہے ظالم`, m2: `جیسے خاصے بِجار پِھرتے ہیں` },
    { m1: `کوئی کیوں پُوچھے تیری بات رضاؔ`, m2: `تجھ سے کتّے ہزار پِھرتے ہیں` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
