import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-3",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "لَمْ یَاتِ نَظِیْرُکَ فِیْ نَظَرٍ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `لَم یَاتِ نَظِیْرُکَ فِیْ نَظَرٍمثلِ تو نہ شُد پیدا جانا`, m2: `جگ راج کو تاج تورے سرسو ہے تجھ کو شہ دَوسَرا جانا` },
    { m1: `اَلْبَحْرعَلَا وَالْمَوْجُ طَغٰی مَن بیکس وطوفاں ہوشرُبا`, m2: `منجدھار میں ہوں بگڑی ہے ہوا موری نیَّا پار لگا جانا` },
    { m1: `یَاشَمْس نَظَرْتِ اِلٰی لَیْلِیْ چو بطیبہ رسی عرضے بکنی`, m2: `توری جوت کی جھل جھل جگ میں رَچی مری شب نے نہ دن ہوناجانا` },
    { m1: `لَکَ بَدْرٌ فِی الْوَجْہِ الْاَجْمَلْ خط ہالۂ مہ زُلف اَبر ِ اَجل`, m2: `تورے چندن چندر پرو کنڈل رحمت کی بھرن برسا جانا` },
    { m1: `اَنَا فِیْ عَطَشٍ وَّسَخَاکَاَ تَمْ اے گیسوئے پاک اے ابرِ کرم`, m2: `برسن ہارے رم جھم رم جھم دو بوند اِدھر بھی گرا جانا` },
    { m1: `یَاقَافِلَتِی زِیْدِیْ اَجَلَکْ رحمے برحَسْرتِ تِشْنہ لَبَک`, m2: `مورا جِیَرا لَرجے دَرَک دَرَک طیبہ سے ابھی نہ سنا جانا` },
    { m1: `وَاھًا لِسُوَیْعَاتٍ ذَھَبَتْ آں عَہْدِ حُضُورِ بارگہت`, m2: `جب یاد آوَت موہے کر نہ پرت دردا وہ مدینہ کا جانا` },
    { m1: `اَلْقَلْبُ شَجٍ وَّالْھَمُّ شُجُوْں دِل زَارچُناں جاں زیر چُنُوں`, m2: `پت اپنی بپت میں کاسے کہوں مرا کون ہے تیرے سوا جانا` },
    { m1: `اَلرُّوْحُ فِدَاکَ فَزِدْ حَرْقَا یَک شُعْلہ دِگر بَرزَن عِشْقا`, m2: `مورا تن من دھن سب پھونک دیا یہ جان بھی پیارے جَلاجانا` },
    { m1: `بس خامۂ خام نوائے رضاؔ نہ یہ طرز مری نہ یہ رنگ مِرا`, m2: `اِرشادِ اَحِبَّا ناطِق تھا ناچار اِس راہ پڑا جانا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
