import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-105",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اُمَّتان و سیاہ کاریہا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `اُمَّتان و سیاہ کاریْہا`, m2: `شافعِ حشر و غم گُساریْہا` },
    { m1: `دُور از کُوئے صاحب کوثر`, m2: `چشم دارَد چہ اَشکباریْہا` },
    { m1: `در فراقِ تو یَا رَسُوْلَ اللہ`, m2: `سینہ دارد چہ بے قراریْہا` },
    { m1: `ظلمت آباد گُور روشن شُد`, m2: `داغِ دل راسْتْ نور باریْہا` },
    { m1: `چہ کُنَد نفس پردہ در مولیٰ`, m2: `چوں توئی گرمِ پردہ داریْہا` },
    { m1: `سگِ کُوئے نبی و یک نگہے`, m2: `مَن و تا حشر جاں نِثاریْہا` },
    { m1: `سَوْفَ یُعْطِیْکَ رَبُّکَ تَرْضٰی`, m2: `حق نَمُودَت چہ پاسْداریْہا` },
    { m1: `دارَم اے گُل بَیادِ زلف و رخت`, m2: `سحر و شام آہ و زاریْہا` },
    { m1: `تا زِہ لُطْفِ تو بر رضاؔ ہر دم`, m2: `مرہمِ کُہْنہ دل فِگاریْہا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
