import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-95",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "ملکِ خاصِ کبریا ہو",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `ملکِ خاصِ کِبریا ہو`, m2: `مالکِ ہر ماسِوا ہو` },
    { m1: `کوئی کیا جانے کہ کیا ہو`, m2: `عقلِ عالَم سے وَرا ہو` },
    { m1: `کَنزِ مَکتومِ اَزل میں`, m2: `دُرِّ مَکْنُونِ خدا ہو` },
    { m1: `سب سے اوّل سب سے آخر`, m2: `اِبتِدا ہو اِنتِہا ہو` },
    { m1: `تھے وسیلے سب نبی تم`, m2: `اصل مَقْصُودِ ہُدیٰ ہو` },
    { m1: `پاک کرنے کو وُضو تھے`, m2: `تم نمازِ جانفزا ہو` },
    { m1: `سب بِشارَت کی اذاں تھے`, m2: `تم اذاں کا مُدَّعا ہو` },
    { m1: `سب تمہاری ہی خبر تھے`, m2: `تم مُؤخَّر مُبتَدا ہو` },
    { m1: `قُربِ حق کی منزلیں تھے`, m2: `تم سفر کا مُنْتَہیٰ ہو` },
    { m1: `قبلِ ذکر اِضمار کیا جب`, m2: `رُتْبَہ سابِق آپ کا ہو` },
    { m1: `طُورِ موسیٰ چَرخِ عیسیٰ`, m2: `کیا مُساوِیِ دَنیٰ ہو` },
    { m1: `سب جِہَت کے دائرے میں`, m2: `شَش جِہَت سے تم وَرا ہو` },
    { m1: `سب مکاں تم لامکاں میں`, m2: `تن ہیں تم جانِ صَفا ہو` },
    { m1: `سب تمہارے در کے رستے`, m2: `ایک تم راہِ خُدا ہو` },
    { m1: `سب تمہارے آگے شافِع`, m2: `تم حضورِ کِبریا ہو` },
    { m1: `سب کی ہے تم تک رسائی`, m2: `بارگہ تک تم رسا ہو` },
    { m1: `وہ کَلَس رَوضے کا چمکا`, m2: `سر جھکاؤ کَج کُلاہو` },
    { m1: `وہ درِ دولت پہ آئے`, m2: `جھولیاں پھیلاؤ شاہو` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
