import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-92",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "زِ عکست ماہِ تاباں آفرِیدَند",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `زِ عکست ماہِ تاباں آفرِیدَند`, m2: `زِ بُوئے تو گُلستاں آفریدند` },
    { m1: `نہ از بہرِ تو صرف اِیمانیانَند`, m2: `کہ خود بہرِ تو ایماں آفریدند` },
    { m1: `صَبارا مَست از بُویَت بَہرسو`, m2: `چُناں اُفتاں وخِیزاں آفریدند` },
    { m1: `برائے جَلْوۂ یک گُلبُنِ ناز`, m2: `ہزاراں باغ و بُستاں آفریدند` },
    { m1: `زِ مِہْرِ تو مِثالے بَرگرِفْتَندْ`, m2: `و زاں مُہرِ سلیماں آفریدند` },
    { m1: `چُو اَنگُشتِ تو شُد جَولاں دِہِ بَرْق`, m2: `قمر را بہرِ قرباں آفریدند` },
    { m1: `زِ لَعلِ نُوش خَنْدِ جانفَزایَت`, m2: `زُلالِ آبِ حیواں آفریدند` },
    { m1: `نہ غیرِ کِبریا جان آفرِیْنے`, m2: `نہ خود مثلِ تو جاناں آفریدند` },
    { m1: `پَئے نَظّارۂ محبوبِ لاہُوت`, m2: `جَبِینَت آئنہ ساں آفریدند` },
    { m1: `بِنا کَردَند تا قَصرِ رِسالت`, m2: `تُرا شمعِ شَبستاں آفریدند` },
    { m1: `زِ مِہْر و چَرخ بہرِ خوانِ جُودَت`, m2: `عجب قُرص و نمکداں آفریدند` },
    { m1: `زِ حسنَت تا بہارِ تازہ گل کَرد`, m2: `رضایَت را غَزل خواں آفریدند` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
