import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-10",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "زہے عزّت و اِعتلائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `زہے عزّت و اِعتلائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم`, m2: `کہ ہے عرشِ حق زیرِپائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `مکاں عرش اُن کا فلک فرش اُن کا`, m2: `مَلَک خادمانِ سَرائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `خدا کی رضا چاہتے ہیں دو عالَم`, m2: `خدا چاہتا ہے رضائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `عجب کیا اگر رحم فرما لے ہم پر`, m2: `خدائے مُحَمَّد برائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `مُحَمَّد برائے جنابِ اِلہٰی!`, m2: `جنابِ الہٰی برائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `بسی عطرِ محبوبی کبریا سے`, m2: `عبائے مُحَمَّد قبائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `بہم عہد باندھے ہیں وصلِ ابد کا`, m2: `رضائے خدا اور رضائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `دمِ نزع جاری ہو میری زباں پر`, m2: `مُحَمَّد مُحَمَّد خدائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `عصائے کلیم اَژدہائے غضب تھا`, m2: `گِروں کا سَہارا عصائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `میں قربان کیاپیاری پیاری ہے نسبت`, m2: `یہ آنِ خدا وہ خدائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `مُحَمَّد کا دم خاص بہرِ خدا ہے`, m2: `سِوائے محمد برائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `خدا اُن کو کِس پیار سے دیکھتا ہے`, m2: `جو آنکھیں ہیں محو لِقائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `جلو میں اِجابت خواصِی میں رحمت`, m2: `بڑھی کس تُزُک سے دُعائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `اِجابت نے جُھک کر گلے سے لگایا`, m2: `بڑھی ناز سے جب دُعائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `اِجابت کا سہرا عنایت کا جوڑا`, m2: `دُلہن بن کے نِکلی دُعائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
    { m1: `رضاپُل سے اب وجد کرتے گزریے`, m2: `کہ ہے رَبِّ سَلِّمْ صَدائے مُحَمَّد صَلَّی اللہ تَعَالٰی عَلَیْہ واٰلہ سَلَّم` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
