import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-12",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "نارِ دوزخ کو چمن کر دے بہار عارِض",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `نارِ دوزخ کو چمن کر دے بہار عارِض`, m2: `ظلمتِ حشر کو دِن کر دے نہارِ عارِض` },
    { m1: `میں تو کیا چیز ہوں خود صاحبِ قرآں کو شہا`, m2: `لاکھ مصحف سے پسند آئی بہارِ عارِض` },
    { m1: `جیسے قرآن ہے وِرد اس گلِ محبوبی کا`, m2: `یُوں ہی قرآں کا وظیفہ ہے وقارِ عارِض` },
    { m1: `گرچہ قرآں ہے نہ قرآں کی برابر لیکن`, m2: `کچھ تو ہے جس پہ ہے وہ مَدح نگارِ عارِض` },
    { m1: `طُور کیا عرش جلے دیکھ کے وہ جلوۂ گرم`, m2: `آپ عارِض ہو مگر آئینہ دارِ عارِض` },
    { m1: `طرفہ عالم ہے وہ قرآن اِدھر دیکھیں اُدھر`, m2: `مصحفِ پاک ہو حیران بہارِ عارض` },
    { m1: `ترجمہ ہے یہ صفت کا وہ خود آئینۂ ذات`, m2: `کیوں نہ مصحف سے زیادہ ہو وقارِ عارض` },
    { m1: `جلوہ فرمائیں رخِ دل کی سیاہی مِٹ جائے`, m2: `صبح ہو جائے الٰہی شبِ تارِ عارض` },
    { m1: `نامِ حق پر کرے محبوب دل و جاں قرباں`, m2: `حق کرے عرش سے تا فرش نثارِ عارض` },
    { m1: `مشک بو زلف سے رُخ چہرہ سے بالوں میں شعاع`, m2: `معجزہ ہے حلبِ زلف و تتارِ عارض` },
    { m1: `حق نے بخشا ہے کرم نذرِ گدایاں ہو قبول`, m2: `پیارے اِک دِ ل ہے وہ کرتے ہیں نثارِ عارض` },
    { m1: `آہ بے مایگیِ دل کہ رضاؔئے محتاج`, m2: `لے کر اِک جان چلا بہر نثارِ عارض` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
