import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-120",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "آہ یا غَوثاہ یا غَیثاہ یا امداد کن",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `آہ یا غَوثاہ یا غَیثاہ یا امداد کن`, m2: `یا حَیَاۃَ الْجُوْدِ یَا رُوْحَ الْمَنَا امداد کن` },
    { m1: `یَا وَلِیَ الْاَوْلِیَاء اِبْنَ نَبِیِّ الْاَنْبِیَا`, m2: `اے کہ پایَت بر رِقابِ اَولیا امداد کن` },
    { m1: `دَست بخشِ حضرتِ حماد زیبِ دستِ خود`, m2: `از تو دَسْتے خواہَد ایں بے دست و پا امداد کن` },
    { m1: `مجمعِ ہر دو طَریق و مَرجعِ ہر دو فَریق`, m2: `فاصِلان و واصِلاں را مُقْتَدا امداد کن` },
    { m1: `واشیاں بر بندہ از ہر سُو ہُجوم آوَرْدَہ اَنْد`, m2: `یَا عَزُوْمًا قَاتِلًا عِنْدَ الْوَغَا امداد کن` },
    { m1: `بہرِ ’’ لَا خَوْ فٌ عَلَیْہِمْ ‘‘ نَجِّنَا مِمَّا نَخَافْ`, m2: `بہرِ’’ لَا ہُمْ یَحْزَنُوْں ‘‘ غمہا زِدا امداد کن` },
    { m1: `اے بامْصَارِ کرم دو قرن پیشیں دو حرم`, m2: `تو بَمُلکِ اَولیا چوں اِیلِیا امداد کن` },
    { m1: `عِزُّنَا یَا حِرْزَنَا یَا کَنْزَنَا یَا فَوْزَنَا`, m2: `لَیْثُنَا یَا غَیْثَنَا یَا غَوْثَنَا امداد کن` },
    { m1: `شاہِ دیں عمرِ سنن ماہِ زمیں مِہْرِ زَمَن`, m2: `گاہِ کیں بہرِ فتن برقِ فنا امداد کن` },
    { m1: `طیّب الاخلاق و حق مشتاق و واصل بے فراق`, m2: `نَــیِّرُ الْاَشْرَاق وَ لَــمَّاعُ السَّنَا امداد کن` },
    { m1: `مِہرباں تر بَر مَن اَز مَن از من آگَہ تر زِ مَن`, m2: `چَند گُویَم سَیِّدا جُودُ النَّدیٰ امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
