import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-15",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "سر تا بقدم ہے تنِ سُلطانِ زَمَنْ پھول",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `سر تا بقدم ہے تن سُلطانِ زَمن پھول`, m2: `لب پھول دَہن پھول ذَقن پھول بدن پھول` },
    { m1: `صدقے میں تِرے باغ تو کیا لائے ہیں ’’بن‘‘ پھول`, m2: `اِس غُنْچۂ دل کو بھی تو اِیما ہو کہ بن پھول` },
    { m1: `تنکا بھی ہمارے تو ہلائے نہیں ہلتا`, m2: `تم چاہو تو ہو جائے ابھی کوہِ محن پھول` },
    { m1: `وَاللہ جو مِل جائے مِرے گل کا پسینہ`, m2: `مانگے نہ کبھی عِطْر نہ پھر چاہے دُلہن پھول` },
    { m1: `دِل بستہ و خُوں گشتہ نہ خوشبُو نہ لطافت`, m2: `کیوں غنچہ کہوں ہے مِرے آقا کا دَہن پھول` },
    { m1: `شب یاد تھی کن دانتوں کی شبنم کہ دَمِ صبح`, m2: `شوخانِ بہاری کے جڑاؤ ہیں کرن پھول` },
    { m1: `دندان و لب و زلف و رُخِ شہ کے فِدائی`, m2: `ہیں دُرِّ عدن ، لعلِ یمن ، مُشکِ ختن پھول` },
    { m1: `بو ہو کہ نہاں ہو گئے تابِ رُخِ شہ میں`, m2: `لَو بن گئے ہیں اب تو حسینوں کا دہن پھول` },
    { m1: `ہوں بارِ گنہ سے نہ خجل دوشِ عزیزاں`, m2: `ﷲ مِری نعش کر اے جانِ چمن پھول` },
    { m1: `دِل اپنا بھی شیدائی ہے اس ناخنِ پا کا`, m2: `اتنا بھی مہِ نو پہ نہ اے چرخ کُہن! پھول` },
    { m1: `دِل کھول کے خُوں رو لے غمِ عارضِ شہ میں`, m2: `نکلے تو کہیں حسرتِ خوں نابہ شدن پھول` },
    { m1: `کیا غازہ مَلا گردِ مدینہ کا جو ہے آج`, m2: `نِکھرے ہوئے جو بن میں قیامت کی پھبن پھول` },
    { m1: `گرمی یہ قیامت ہے کہ کانٹے ہیں زباں پر`, m2: `بلبل کو بھی اے سَاقیٔ صہبَا و لبن پھول` },
    { m1: `ہے کون کہ گِریہ کرے یا فاتحہ کو آئے`, m2: `بیکس کے اُٹھائے تِری رحمت کے بھرن پھول` },
    { m1: `دل غم تجھے گھیرے ہیں خدا تجھ کو وہ چمکائے`, m2: `سُورج تِرے خرمن کو بنے تیری کرن پھول` },
    { m1: `کیا بات رضاؔ اُس چمنستانِ کرم کی`, m2: `زہرا ہے کلی جس میں حُسین اور حسن پھول` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
