import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-76",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "غم ہو گئے بے شُمار آقا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `غم ہو گئے بے شمار آقا`, m2: `بندہ تیرے نثار آقا` },
    { m1: `بگڑا جاتا ہے کھیل میرا`, m2: `آقا آقا سنوار آقا` },
    { m1: `منجدھار پہ آ کے ناؤ ٹوٹی`, m2: `دے ہاتھ کہ ہُوں میں پار آقا` },
    { m1: `ٹوٹی جاتی ہے پیٹھ میری`, m2: `لِلّٰہ یہ بوجھ اُتار آقا` },
    { m1: `ہلکا ہے اگر ہمارا پلّہ`, m2: `بھاری ہے تِرا وقار آقا` },
    { m1: `مجبور ہیں ہم تو فِکر کیا ہے`, m2: `تم کو تو ہے اِختیار آقا` },
    { m1: `میں دُور ہوں تم تو ہو مِرے پاس`, m2: `سُن لو میری پکار آقا` },
    { m1: `مجھ سا کوئی غمزدہ نہ ہوگا`, m2: `تم سا نہیں غم گُسار آقا` },
    { m1: `گرداب میں پڑ گئی ہے کشتی`, m2: `ڈُوبا ڈُوبا، اُتار آقا` },
    { m1: `تُم وہ کہ کرم کو ناز تم سے`, m2: `میں وہ کہ بدی کو عار آقا` },
    { m1: `پھر منھ نہ پڑے کبھی خزاں کا`, m2: `دے دے ایسی بہار آقا` },
    { m1: `جس کی مرضی خدا نہ ٹالے`, m2: `میرا ہے وہ نامدار آقا` },
    { m1: `ہے ملکِ خدا پہ جس کا قبضہ`, m2: `میرا ہے وہ کامگار آقا` },
    { m1: `سویا کیے نابکار بندے`, m2: `رَویا کیے زار زار آقا` },
    { m1: `کیا بھول ہے ان کے ہوتے کہلائیں`, m2: `دُنیا کے یہ تاجدار آقا` },
    { m1: `اُن کے ادنی گدا پہ مِٹ جائیں`, m2: `ایسے ایسے ہزار آقا` },
    { m1: `بے ابرِ کرم کے میرے دھبّے`, m2: `لَا تَغْسِلُھَ الْبِحَار آقا` },
    { m1: `اتنی رحمت رضاؔ پہ کر لو`, m2: `لَا یَقْرُبُہُ الْبَوَار آقا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
