import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-133",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بَکارِ خَویْش حَیرانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `بَکارِ خَویْش حَیرانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ`, m2: `پَریشانَم پریشانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `نَدارَم جز تو مَلجائے نَدانَم جز تو ماوائے`, m2: `توئی خود ساز و سامانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `شَہا بیکس نوازی کُن طَبِیبا چارہ سازی کن`, m2: `مریضِ دردِعِصیانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `نَرَفتم راہِ بِینایاں فُتادَم در چَہِ عِصیاں`, m2: `بِیا اے حَبلِ رَحمانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `گُنہ بر سر بلا بارَد دِلَم دردِ ہوا دارَد`, m2: `کہ دانَدْ جُز تو دَرمانَم اَغِثْنِیْ یَا رَسُوْلَ اللّٰ` },
    { m1: `اگر رانی و گر خوانی غُلامَم اَنْتَ سُلْطَانِی`, m2: `دِگر چیزے نَمِیدانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `بکہفِ رَحمتم پَروَر زِ قِطمیرَم مَنِہ کم تر`, m2: `سگِ درگاہِسلطانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `گُنہ در جانَمآتِش زَد قیامت شُعلہـ می خِیزد`, m2: `مدد اے آبِ حیوانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `چو مَرگَم نَخلِ جاں سُوزَد بہارَم را خزاں سوزد`, m2: `نہ رِیزَدبَرگِ اِیمانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `چو محشر فتنہ اَنگیزَد بلائے بے اماں خِیزَد`, m2: `بجویم از تو دَرمانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `پِدَر را نفرتے آیَدْ پِسر را وَحشت اَفزایَدْ`, m2: `تو گِیری زیرِ دامانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `عزیزاں گَشْتہ دور اَز مَن ہَمہ یاراں نُفُور اَ ز من`, m2: `دَریں وحشت تُرا خوانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `گدائی آمد ای سلطاں بامّیدِ کَرم نالاں`, m2: `تَہی داماں مَگِردانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `اگر می رانِیم از در بمن بِنُما دَرے دیگر`, m2: `کُجا نالَم کِرا خوانم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `گرفتارَم رہائی دِہ مَسیحا مُومْیائی دِہ`, m2: `شِکستَم رنگِ سامانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
    { m1: `رضاؔیَت سائلِ بے پر توئی سلطانِ لَا تَنْھَرْ`, m2: `شہا بَہرے اَزیں خوانَم اَغِثْنِیْ یَا رَسُوْلَ اللہ` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
