import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-74",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "پِھر اُٹھا ولولۂ یادِ مُغیلانِ عرب",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `پھر اُٹھا وَلولۂ یادِ مُغِیلانِ عرب`, m2: `پھر کھنچا دامن دل سُوئے بیابانِ عرب` },
    { m1: `باغِ فردوس کو جاتے ہیں ہزارانِ عرب`, m2: `ہائے صحرائے عرب ہائے بیابانِ عرب` },
    { m1: `میٹھی باتیں تِری دینِ عجم ایمانِ عرب`, m2: `نَمکیں حُسن تِرا جانِ عجم شانِ عرب` },
    { m1: `اب تو ہے گریۂ خوں گوہر دامانِ عرب`, m2: `جس میں دو لعل تھے زہرا کے وہ تھی کانِ عرب` },
    { m1: `دل وہی دل ہے جو آنکھوں سے ہو حیرانِ عرب`, m2: `آنکھیں وہ آنکھیں ہیں جو دل سے ہوں قربانِ عرب` },
    { m1: `ہائے کس وقت لگی پھانس اَلم کی دل میں`, m2: `کہ بہت دُور رہے خارِ مُغِیلانِ عرب` },
    { m1: `فَصْلِ گل لاکھ نہ ہو وَصْل کی رکھ آس ہزا ر`, m2: `پھولتے پھلتے ہیں بے فَصْل گلستانِ عرب` },
    { m1: `صدقے ہونے کو چلے آتے ہیں لاکھوں گُلزار`, m2: `کچھ عجب رنگ سے پُھولا ہے گلستانِ عرب` },
    { m1: `عَنْدَلِیْبِی پہ جھگڑتے ہیں کٹے مَرتے ہیں`, m2: `گُل و بُلبُل کو لڑاتا ہے گلِستانِ عرب` },
    { m1: `صدقے رحمت کے کہاں پھول کہاں خار کا کام`, m2: `خود ہے دامن کشِ بُلبُل گُلِ خندانِ عرب` },
    { m1: `شادیَ حشر ہے صَدْقے میں چھٹیں گے قیدی`, m2: `عرش پر دُھوم سے ہے دَعوتِ مہمانِ عرب` },
    { m1: `چرچے ہوتے ہیں یہ کمھلائے ہوئے پھولوں میں`, m2: `کیوں یہ دن دیکھتے پاتے جو بیابانِ عرب` },
    { m1: `تیرے بے دام کے بندے ہیں رئیسانِ عجم`, m2: `تیرے بے دام کے بندی ہیں ہزارانِ عرب` },
    { m1: `ہَشْت خلد آئیں وہاں کسب لطافت کو رضاؔ`, m2: `چار دن برسے جہاں اَبر بہارانِ عرب` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
