import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-4",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "نہ آسمان کو یوں سرکَشیدہ ہونا تھا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `نہ آسمان کو یوں سرکَشیدہ ہونا تھا`, m2: `حضورِ خاکِ مَدینہ خمیدہ ہونا تھا` },
    { m1: `اگر گلوں کو خزاں نارسیدہ ہونا تھا`, m2: `کنارِ خارِ مَدینہ دَمیدہ ہونا تھا` },
    { m1: `حضور اُن کے خلافِ اَدب تھی بیتابی`, m2: `مِری امید! تجھے آرمیدہ ہونا تھا` },
    { m1: `نظارہ خاکِ مَدینہ کا اور تیری آنکھ`, m2: `نہ اسقدر بھی قمر شوخ دِیدہ ہونا تھا` },
    { m1: `کنارِ خاکِ مدینہ میں راحتیں ملتیں`, m2: `دلِ حزیں ! تجھے اَشک چکیدہ ہونا تھا` },
    { m1: `پناہِ دامنِ دَشتِ حرم میں چین آتا`, m2: `نہ صبر دل کو غزالِ رَمیدہ ہونا تھا` },
    { m1: `یہ کیسے کھلتا کہ انکے سِوا شفیع نہیں`, m2: `عَبَث نہ اَوروں کے آگے تپیدہ ہونا تھا` },
    { m1: `ہلال کیسے نہ بنتا کہ ماہِ کامل کو`, m2: `سلامِ اَبروئے شَہ میں خمیدہ ہونا تھا` },
    { m1: `لَاَمْلَئَنَّ جَہَنَّم تھا وَعْدئہ اَزَلی`, m2: `نہ مُنکروں کا عَبَث بدعقیدہ ہونا تھا` },
    { m1: `نسیم کیوں نہ شمیم ان کی طیبہ سے لاتی`, m2: `کہ صبحِ گل کو گریباں دَریدہ ہونا تھا` },
    { m1: `ٹپکتا رنگِ جنوں عشقِ شہ میں ہر گل سے`, m2: `رگِ بَہار کو نشتر رَسیدہ ہونا تھا` },
    { m1: `بجا تھا عرش پہ خاکِ مزارِ پاک کو ناز`, m2: `کہ تجھ سا عرش نشیں آفریدہ ہونا تھا` },
    { m1: `گزرتے جان سے اک شور ’’یاحبیب‘‘ کے ساتھ`, m2: `فُغاں کو نالۂ حلق بُریدہ ہونا تھا` },
    { m1: `مِرے کریم گنہ زہر ہے مگر آخر`, m2: `کوئی تو شہدِ شفاعت چشیدہ ہونا تھا` },
    { m1: `جو سنگِ دَر پہ جبیں سائیوں میں تھا مِٹنا`, m2: `تو میری جان شرارِ جہیدہ ہونا تھا` },
    { m1: `تِری قبا کے نہ کیوں نیچے نیچے دامن ہوں`, m2: `کہ خاکساروں سے یاں کب کشیدہ ہونا تھا` },
    { m1: `رضاؔ جو دل کو بنانا تھا جلوہ گاہِ حبیب`, m2: `تو پیارے قید خودی سے رہیدہ ہونا تھا` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
