import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-116",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "مُرتَضیٰ شیرِ خدا مَرحَب کُشا خَیبر کَشا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `مُرتَضیٰ شیرِ خدا مَرحَب کُشا خَیبر کَشا`, m2: `سَرْوَرا لشکر کَشا مشکل کُشا امداد کن` },
    { m1: `حَیْدَرَا اَژدَر دَرا ضِرْغام ہائل مَنْظَرا`, m2: `شہرِ عِرفاں را دَرا روشن دُرا اِمداد کُن` },
    { m1: `ضَیْغَما غَیظ وَغْما زَیْغ و فِتَن را راغِما`, m2: `پہلوانِ حق امیرِ لا فَتٰے اِمداد کن` },
    { m1: `اے خدا را تِیغ و اے اَندامِ احمد را سِپَر`, m2: `یا علی یا بُوالحسن یا بُوالْعُلیٰ اِمداد کن` },
    { m1: `یا یَدُ اللہ یا قوی یا زورِ بازُوے نبی`, m2: `مَن زِ پا اُفتادَم اے دستِ خدا اِمداد کن` },
    { m1: `اے نِگارِ راز دارِ قَصْرِ اللہ اِنتجے`, m2: `اے بہارِ لالہ زارِ انّمَا امداد کُن` },
    { m1: `اے تَنَتْ را جامہ پُر زَر جَلوہ باری عَبا`, m2: `اے سَرَتْ را تاجِ گوہرِ ہَلْ اَتٰی اِمداد کن` },
    { m1: `اے رُخَت را غازَۂ تَطْہِیْر و اِذْہابِ نَجس`, m2: `اے لَبَت ر ا مایۂ فَصْلُ الْقَضا اِمداد کن` },
    { m1: `اے بجبات و حَرِیر اَیمن زِ شَمْس و زَمہرِیر`, m2: `اے تُرا فِرْدَوس مُشْتاقِ لِقا اِمداد کن` },
    { m1: `اے بحضْرَت روزِ حَسرت رُو بنُصْرَت جاں بَسُوز`, m2: `شکرِ اِیں نُصرت بیک نَظَرَت مَرا امداد کن` },
    { m1: `یَا طَلِیْقَ الْوَجْہِ فِیْ یَوْمٍ عَبُوْسٍ قَمْطَرِیْر`, m2: `یَا بَہِیْجَ الْقَلْبِ فِیْ یَوْمِ الْاَسٰی اِمداد کن` },
    { m1: `اے وَقَاہُم رَبُّہُم اَمنَتْ زِ شَرِّ مُسْتَطِیر`, m2: `مجرِمَم مِی جُویم از کَیْفرِ وَقَا امداد کن` },
    { m1: `اے تَنَت در راہِ مولیٰ خاک و جانَت عرشِ پاک`, m2: `بُو تُراب اے خاکیاں را پیشوا امداد کن` },
    { m1: `اے شبِ ہجرت بَجائے مصطفٰی بر رَخْتِ خواب`, m2: `اے دمِ شِدّت فدائے مصطفٰی امداد کن` },
    { m1: `اے عَدُوئے کفر و نَصب ورَ فض و تفضیل و خُروج`, m2: `اے علوے سُنّت و دینِ ہُدٰی امداد کن` },
    { m1: `شمعِ بَزم و تِیغِ رَزم و کُوہِ عَزم و کانِ حَزم`, m2: `اے کذا و اے فُزوں تر از کذا امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
