import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-28",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "وہ کمالِ حُسنِ حضور ہے کہ گمانِ نَقْص جہاں نہیں",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `وہ کمالِ حُسنِ حضور ہے کہ گمانِ نَقْص جہاں نہیں`, m2: `یہی پھول خار سے دور ہے یہی شمع ہے کہ دُھواں نہیں` },
    { m1: `دو جہاں کی بہتریاں نہیں کہ امانیٔ دل و جاں نہیں`, m2: `کہو کیا ہے وہ جو یہاں نہیں مگر اک ’’نہیں ‘‘ کہ وہ ہاں نہیں` },
    { m1: `میں نثار تیرے کلام پر مِلی یُوں تو کِس کو زباں نہیں`, m2: `وہ سخن ہے جس میں سخن نہ ہو وہ بیاں ہے جس کا بیاں نہیں` },
    { m1: `بخدا خدا کا یہی ہے در نہیں اور کوئی مَفَر مَقَر`, m2: `جو وہاں سے ہو یہیں آکے ہو جو یہاں نہیں تو وہاں نہیں` },
    { m1: `کرے مصطفٰی کی اِہانتیں کھلے بندوں اس پہ یہ جرأتیں`, m2: `کہ میں کیا نہیں ہوں مُحَمَّدِی! ارے ہاں نہیں ارے ہاں نہیں` },
    { m1: `تِرے آگے یُوں ہیں دَبے لَچے فُصَحَاعرب کے بڑے بڑے`, m2: `کوئی جانے منھ میں زباں نہیں ، نہیں بلکہ جسم میں جاں نہیں` },
    { m1: `وہ شرف کہ قطع ہیں نسبتیں وہ کرم کہ سب سے قریب ہیں`, m2: `کوئی کہدو یاس و امید سے وہ کہیں نہیں وہ کہاں نہیں` },
    { m1: `یہ نہیں کہ خُلد نہ ہو نِکو وہ نِکوئی کی بھی ہے آبرو`, m2: `مگر اے مدینہ کی آرزو جسے چاہے تو وہ سماں نہیں` },
    { m1: `ہے اُنہیں کے نور سے سب عیاں ہے اُنہیں کے جلوہ میں سب نہاں`, m2: `بنے صبح تابش مہر سے رہے پیش مہر یہ جاں نہیں` },
    { m1: `وہی نورِ حق وہی ظلِّ ربّ ہے انہیں سے سب ہے انہیں کا سب`, m2: `نہیں ان کی مِلک میں آسماں کہ زمیں نہیں کہ زماں نہیں` },
    { m1: `وہی لامکاں کے مکیں ہوئے سرِ عرش تخت نشیں ہوئے`, m2: `وہ نبی ہے جس کے ہیں یہ مکاں وہ خدا ہے جس کا مکاں نہیں` },
    { m1: `سرِ عرش پر ہے تِری گزر دلِ فرش پر ہے تِری نظر`, m2: `ملکوت و ملک میں کوئی شے نہیں وہ جو تجھ پہ عیاں نہیں` },
    { m1: `کروں تیرے نام پہ جاں فدانہ بس ایک جاں دو جہاں فِدا`, m2: `دو جہاں سے بھی نہیں جی بھرا کروں کیا کروروں جہاں نہیں` },
    { m1: `تِرا قد تو نادرِ دہر ہے کوئی مِثل ہو تو مِثال دے`, m2: `نہیں گُل کے پودوں میں ڈالیاں کہ چمن میں سرو چماں نہیں` },
    { m1: `نہیں جس کے رنگ کا دوسرا نہ تو ہو کوئی نہ کبھی ہوا`, m2: `کہو اس کو گل کہے کیا بنی کہ گلوں کا ڈھیر کہاں نہیں` },
    { m1: `کروں مدحِ اہلِ دُوَلْ رضاؔ پڑے اِس بَلا میں مِری بَلا`, m2: `میں گدا ہوں اپنے کریم کا مِرا دِین پارۂ ناں نہیں` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
