import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-117",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یا شہیدِ کربلا یا دافعِ کرب و بلا",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `یا شہیدِ کربلا یا دافعِ کرب و بلا`, m2: `گُل رُخَا شہزادۂ گُلگُوں قَبا امداد کن` },
    { m1: `اے حُسَین اے مصطفٰی را راحتِ جاں نورِ عین`, m2: `راحتِ جاں نورِ عینم دِہ بِیا امداد کن` },
    { m1: `اے ز حسنِ خلق و حسن خلق احمد نسخۂ`, m2: `سینہ تا پا شکلِ محبوبِ خدا امداد کن` },
    { m1: `جانِ حُسن ایمانِ حُسن اے کانِ حُسن اے شانِ حُسن`, m2: `اے جَمالَت لمْعِ شمعِ مَنْ رَاٰی امداد کن` },
    { m1: `جانِ زَہرا و شہیدِ زَہر را زور و ظَہِیْر`, m2: `زہرتِ اَزہارِ تَسْلِیم و رضا امداد کُن` },
    { m1: `اے بَواقِعِ بِیکَسانِ دَہر را زیبا کَسے`, m2: `وَے بَظاہر بیکسِ دَشتِ جَفا امداد کن` },
    { m1: `اے گَلُویَت گَہِ لَبانِ مصطفیٰ را بوسہ گاہ`, m2: `گہِ لبِ تِیغِ لَعیں را حَسرتا امداد کن` },
    { m1: `اے تنِ تو گہِ سوارِ شہسوارِ عرشِ تاز`, m2: `گہِ چُناں پامال خَیلِ اَشقِیا امداد کن` },
    { m1: `اے دل و جانْہا فدائے تِشْنہ کامِیہَائے تو`, m2: `اے لَبَتْ شرحِ رَضِیْنَا بِالْقَضَا امداد کن` },
    { m1: `اے کہ سُوزَت خان مانِ آب را آتِش زَدے`, m2: `گر نہ بُودے گِریۂ اَرض و سَما امداد کن` },
    { m1: `ہے چہ بحر و تفتگی کوثر لَب و ایں تشنگی`, m2: `خاک بر فرقِ فُرات از لبِ مَرا امداد کن` },
    { m1: `اَبر گو ہرگز مَبار و نہر گو ہرگز مَریز`, m2: `خود لَبَتْ تَسلیم و فَیضَتْ حَبَّذا امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
