import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-127",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "اَلسَّلام اے اَحمدَت صِہْر و بَرادر آمدَہ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `اَلسَّلام اے اَحمدَت صِہْر و بَرادر آمدَہ`, m2: `حمزہ سردارِ شہیداں عَم اَکبر آمدَہ` },
    { m1: `جَعْفَرے کُو می پَرَد صبح و مَسا با قُدسِیاں`, m2: `با تو ہم مَسکَن بہ بَطنِ پاک مادر آمدَہ` },
    { m1: `بِنْتِ احمد رَونقِ کاشانہ و بانُوے تو`, m2: `گوشت و خونِ تو بَلَحْمَشْ شِیر و شکر آمدَہ` },
    { m1: `ہر دو رَیحانِ نبی گُلہائے تو زاں گل زمیں`, m2: `بہرِ گل چِیْنَت زمینِ باغ برتر آمدَہ` },
    { m1: `می چَمِیدی گُلبَنا در باغِ اسلام و ہَنوز`, m2: `غُنچہ اَ ت نَشِگُفْت و نَے نخلے دِگر بر آمدَہ` },
    { m1: `نرم نرم از بزم دامن چِیدہ رَفتہ بادِ تُنْد`, m2: `’’یا علی ‘‘ چوں بر زبانِ شمعِ مُضْطر آمدَہ` },
    { m1: `ماہِ تاباں گُو مَتاب و مِہْرِ رَخشاں گو مَرَخْش`, m2: `باخْتَر تا خاوَر اِسمَت نور گُستر آمدَہ` },
    { m1: `حل مشکل کُن بَرُوئے من درِ رحمت کُشا`, m2: `اے بَنامِ تو مُسلم فتحِ خیبر آمدَہ` },
    { m1: `مرحبا اے قاتلِ مَرحب امیر الاشجعیں`, m2: `در ظِلالِ ذُوالْفقارَت شورِ محشر آمدَہ` },
    { m1: `سینہ ام را مَشْرِقستاں کُن بنورِ معرِفت`, m2: `اے کہ نامِ سایہ اَت خورشیدِ خاوَر آمدَہ` },
    { m1: `کے رَسَد مَولیٰ بمہرِ تابْناکَت نجمِ شام`, m2: `گُو بَنورِ صحبتِ اُو صبحِ انور آمدَہ` },
    { m1: `ناصِبی را بغضِ تو سوئے جہنّم رہ نَمود`, m2: `رافضی از حُبِّ کاذِب در سقر دَرآمدَہ` },
    { m1: `من زِ حق می خواہم اے خورشیدِ حق آں مِہر تو`, m2: `کَز ضِیائش عالَمِ ایماں منور آمدَہ` },
    { m1: `بہرِ اَستر چادر مَہتاب و ایں زَرّیں پَرَنْد`, m2: `نا پَذیرائے گلیمِ بختِ قَنبر آمدَہ` },
    { m1: `تِشنہ کامِ خود رضائے خَستہ را ہم جُرعۂ`, m2: `شکرِ آں نعمت کہ نامَت شاہِ کوثر آمدَہ` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
