import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-121",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یَا اِبْنَ ہٰذَا الْمُرْتَجٰی یَا عَبْدَ رَزَّاقِ الْوَریٰ",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `یَا اِبْنَ ہٰذَا الْمُرْتَجٰی یَا عَبْدَ رَزَّاقِ الْوَریٰ`, m2: `تا کہ باشَد رزقِ ما عشقِ شُما امداد کن` },
    { m1: `یا ابا صالح صلاحِ دین و اِصلاحِ قُلوب`, m2: `فاسِدَم گلزار و در جوش ہوا امداد کن` },
    { m1: `جانِ نَصْری یا محی الدّین فَانْصُر وَانْتَصِر`, m2: `اے علی اے شہر یارِ مرتضیٰ امداد کن` },
    { m1: `سیّدِ موسیٰ ! کلیمِ طورِ عرفاں المدد`, m2: `اے حسن اے تاجدارِ مجتبیٰ امداد کن` },
    { m1: `مُنْتَقٰی جوہر ز ِ جیلاں سیّدِ احمد الاماں`, m2: `بے بہا گوہر بَہاؤ الدِّیں بَہا امداد کن` },
    { m1: `بندہ را نمرودِ نفس اَنداخت در نارِ ہوا`, m2: `یا بَراہِیم ابرِ آتِش گُل کُنا امداد کن` },
    { m1: `اے محمد اے بھکاری اے گدائے مصطفٰی`, m2: `ما گدایانِ دَرَتْ اے با سخا امداد کن` },
    { m1: `اَلنَّجا اے زندئہ جاوید اے قاضی جیا`, m2: `اے جمالِ اَولیا یُوسف لِقا امداد کن` },
    { m1: `یا محمد یا علم واخَر زِ دستِ غَفلتم`, m2: `اے کہ ہر مُوئے تو در ذکرِ خدا امداد کن` },
    { m1: `اے بَنامَت شِیرئہ جاں شُد نباتِ کالپی`, m2: `احمدا ! نُوشِیں لَبا شِیریں ادا امداد کن` },
    { m1: `شاہ فَضلُ اللہ یا ذُو الْفَضْل یا فضلِ الٰہ`, m2: `چشم در فضلِ تو بَسْتْ ایں بے نَوا امداد کن` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
