import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-34",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "یاد میں جس کی نہیں ہوشِ تن و جاں ہم کو",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `یاد میں جس کی نہیں ہوشِ تن و جاں ہم کو`, m2: `پھر دِکھا دے وہ رُخ اے مہرِ فروزاں ! ہم کو` },
    { m1: `دیر سے آپ میں آنا نہیں ملتا ہے ہمیں`, m2: `کیا ہی خُود رفتہ کیا جلوئہ جاناں ! ہم کو` },
    { m1: `جس تبسّم نے گلستاں پہ گرائی بجلی`, m2: `پھر دِکھا دے وہ ادائے گلِ خنداں ہم کو` },
    { m1: `کاش آویزئہ قندیلِ مدینہ ہو وہ دِل`, m2: `جس کی سوزش نے کیا رشکِ چراغاں ہم کو` },
    { m1: `عرش جس خوبیِ رفتار کا پامال ہوا`, m2: `دو قدم چل کے دِکھا سروِ خراماں ! ہم کو` },
    { m1: `شمعِ طیبہ سے میں پروانہ رہوں کب تک دُور`, m2: `ہاں جلا دے شررِ آتشِ پنہاں ! ہم کو` },
    { m1: `خوف ہے سمع خراشیِ سگِ طیبہ کا`, m2: `ورنہ کیا یاد نہیں نالہ و اَفغاں ہم کو` },
    { m1: `خاک ہوجائیں درِ پاک پہ حسرت مِٹ جائے`, m2: `یاالٰہی نہ پِھرا بے سر و سَاماں ہم کو` },
    { m1: `خارِ صحرائے مدینہ نہ نکِل جائے کہیں`, m2: `وحشتِ دل نہ پِھرا کوہ و بیاباں ہم کو` },
    { m1: `تنگ آئے ہیں دو عالم تری بیتابی سے`, m2: `چین لینے دے تپِ سینۂ سوزاں ہم کو` },
    { m1: `پاؤں غِربال ہوئے راہِ مدینہ نہ ملی`, m2: `اے جنوں ! اب تو مِلے رُخصت زِنداں ہم کو` },
    { m1: `میرے ہر زخمِ جگر سے یہ نکلتی ہے صَدا`, m2: `اے مَلیحِ عربی! کر دے نمکداں ہم کو` },
    { m1: `سیرِ گلشن سے اسیرانِ قَفَس کو کیا کام`, m2: `نہ دے تکلیفِ چمن بلبلِ بُستاں ہم کو` },
    { m1: `جب سے آنکھوں میں سمائی ہے مدینہ کی بہار`, m2: `نظر آتے ہیں خَزاں دیدہ گلستاں ہم کو` },
    { m1: `گر لب پاک سے اقرارِ شفاعت ہو جائے`, m2: `یوں نہ بے چین رکھے جوشِشِ عصیاں ہم کو` },
    { m1: `نیّر حشر نے اِک آگ لگا رکھی ہے!`, m2: `تیز ہے دھوپ ملے سایۂ داماں ہم کو` },
    { m1: `رحم فرمائیے یا شاہ کہ اب تاب نہیں`, m2: `تابکے خون رُلائے غمِ ہجراں ہم کو` },
    { m1: `چاکِ داماں میں نہ تھک جائیو اے دستِ جنوں`, m2: `پُرزے کرنا ہے ابھی جیب و گریباں ہم کو` },
    { m1: `پَردہ اُس چہرۂ انور سے اُٹھا کر اِک بار`, m2: `اپنا آئینہ بنا اے مہِ تاباں ہم کو` },
    { m1: `اے رضاؔ وصفِ رُخِ پاک سُنانے کے لئے`, m2: `نذر دیتے ہیں چمن، مُرغِ غزل خواں ہم کو` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
