import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-66",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "بندہ قادر کا بھی قادر بھی ہے عبد القادر",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `بندہ قادر کا بھی قادر بھی ہے عبدالقادر`, m2: `سرِّ باطن بھی ہے ظاہر بھی ہے عبدالقادر` },
    { m1: `مفتِی شرع بھی ہے قاضی مِلّت بھی ہے`, m2: `علمِ اَسرار سے ماہر بھی ہے عبدالقادر` },
    { m1: `منبعِ فیض بھی ہے مجمعِ افضال بھی ہے`, m2: `مہر عرفَاں کا منور بھی ہے عبدالقادر` },
    { m1: `قطب ابدال بھی ہے محورِ ارشاد بھی ہے`, m2: `مرکزِ دائرئہ سِرّ بھی ہے عبدالقادر` },
    { m1: `سلکِ عرفاں کی ضیا ہے یہی دُرِّمختار`, m2: `فخرِ اَشباہ و نظائر بھی ہے عبدالقادر` },
    { m1: `اس کے فرمان ہیں سب شارحِ حکمِ شارع`, m2: `مظہرِ ناہی و آمر بھی ہے عبدالقادر` },
    { m1: `ذی تَصَرُّف بھی ہے ماذون بھی مختار بھی ہے`, m2: `کارِ عالم کا مُدَبِّر بھی ہے عبدالقادر` },
    { m1: `رشکِ بُلبل ہے رضاؔ لالہ صَد داغ بھی ہے`, m2: `آپ کا واصف و ذاکِر بھی ہے عبدالقادر` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
