import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "kalam-19",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "رشکِ قمر ہوں رنگ رُخِ آفتاب ہوں",
  titleRo: "",
  titleEn: "",
  versesUr: [
    { m1: `رشکِ قمر ہُوں رنگ رُخِ آفتاب ہُوں`, m2: `ذرّہ تِرا جو اے شہِ گَردُوں جناب ہُوں` },
    { m1: `دُرِّ نجف ہُوں گوہَرِ پاکِ خوشاب ہُوں`, m2: `یعنی تُرابِ رہ گزر بُو تُراب ہُوں` },
    { m1: `گر آنکھ ہُوں تو اَبر کی چشم پُر آب ہُوں`, m2: `دِل ہُوں تو برق کا دلِ پُر اضطراب ہُوں` },
    { m1: `خونیں جگر ہُوں طائر بے آشیاں شہا`, m2: `رنگِ پریدۂ رُخِ گل کا جواب ہُوں` },
    { m1: `بے اصل و بے ثبات ہُوں بحرِ کرم مدد`, m2: `پَرْوَرْدَۂ کنارِ سُراب و حَباب ہُوں` },
    { m1: `عبرت فزا ہے شرمِ گنہ سے مِرا سکوت`, m2: `گویا لبِ خموشِ لحد کا جواب ہُوں` },
    { m1: `کیوں نالہ سوز لَے کروں کیوں خونِ دل پیوں`, m2: `سیخِ کباب ہُوں نہ میں جامِ شراب ہُوں` },
    { m1: `دل بستہ بے قرار، جگر چاک، اشکبار`, m2: `غنچہ ہوں گل ہُوں برق تپاں ہُوں سحاب ہُوں` },
    { m1: `دعویٰ ہے سب سے تیری شفاعت پہ بیشتر`, m2: `دفتر میں عاصیوں کے شہا اِنتخاب ہُوں` },
    { m1: `مولیٰ دُہائی نظروں سے گِر کر جلا غلام`, m2: `اشکِ مژہ رسیدۂ چشم کباب ہُوں` },
    { m1: `مِٹ جائے یہ خودی تو وہ جلوہ کہاں نہیں`, m2: `دردا میں آپ اپنی نظر کا حجاب ہُوں` },
    { m1: `صَدقے ہوں اس پہ نار سے دیگا جو مخلصی`, m2: `بلبل نہیں کہ آتشِ گل پر کباب ہُوں` },
    { m1: `قالب تہی کیے ہمہ آغوش ہے ہلال`, m2: `اے شہسَوار طیبہ! میں تیری رکاب ہُوں` },
    { m1: `کیا کیا ہیں تجھ سے ناز تِرے قصر کو کہ میں`, m2: `کعبہ کی جان، عرشِ بریں کا جواب ہُوں` },
    { m1: `شاہا بُجھے سقر مِرے اشکوں سے تانہ میں`, m2: `آبِ عبث چکیدۂ چشمِ کباب ہُوں` },
    { m1: `میں تو کہا ہی چاہوں کہ بندہ ہُوں شاہ کا`, m2: `پر لُطف جب ہے کہدیں اگر وہ جناب’’ہُوں ‘‘` },
    { m1: `حسرت میں خاک بوسیِ طیبَہ کی اے رضاؔ`, m2: `ٹپکا جو چشمِ مہر سے وہ خونِ ناب ہوں` },
  ],
  versesRo: [],
  versesEn: [],
  versesHi: [],
};

export default kalam;
