import type { Kalam } from "@/src/types";

const kalam: Kalam = {
  id: "talab-ka-munh-to-kis-qaabil-hai-ya-ghaus",
  poetId: "alahazrat",
  poetName: "امام احمد رضا خان",
  poetNameRo: "Imam Ahmed Raza Khan",
  poetNameEn: "Imam Ahmed Raza Khan",
  titleUr: "طلب کا منھ تو کس قابل ہے یا غوث",
  titleRo: "Talab Ka Munh To Kis Qaabil Hai Ya Ghaus",
  titleEn: "",
  titleHi: "",
  versesRo: [
    {
      "m1": "Talab Ka Munh To Kis Qaabil Hai Ya Ghaus",
      "m2": "Magar Tera Karam Kaamil Hai Ya Ghaus"
    },
    {
      "m1": "Duha-ee Ya Muhiyud’deen Duha-ee",
      "m2": "Bala Islam Par Naazil Hai Ya Ghaus"
    },
    {
      "m1": "Wo Sangeeñ Bid’ateñ Wo Teyzi e Kufr",
      "m2": "Ke Sar Pe Taigh, Dil Pe Sil Hai Ya Ghaus"
    },
    {
      "m1": "Azooman Qaatilan ‘Indal Qitaali",
      "m2": "Madad Ko Aa, Dam e Bismil Hai Ya Ghaus"
    },
    {
      "m1": "Tere Sonay Se Soya Bakht De Jaag",
      "m2": "Jagaa! Ch’hupne Pe Din Maa-il Hai Ya Ghaus"
    },
    {
      "m1": "Khudara, Nakhuda Aa De Sahaara",
      "m2": "Hawa Bigri, Bhañwar Haa-il Hai Ya Ghaus"
    }
  ],
  versesEn: [],
  versesUr: [
    { m1: `طلب کا منھ تو کس قابل ہے یا غوث`, m2: `مگر تیرا کرم کامل ہے یا غوث` },
    { m1: `دوہائی یَا مُحِیُّ الدِّین دوہائی`, m2: `بَلا اسلام پر نازل ہے یا غوث` },
    { m1: `وہ سنگیں بِدعَتیں وہ تیزیِ کفر`, m2: `کہ سر پر تِیغ دل پر سِل ہے یا غوث` },
    { m1: `عَزُوْمًا قَاتِلًا عِنْدَ الْقِتَالٖ`, m2: `مدد کو آ دمِ بِسمِل ہے یا غوث` },
    { m1: `خدا را ناخُدا آ دے سہارا`, m2: `ہوا بگڑی بھَنْوَر حائل ہے یا غوث` },
    { m1: `جِلا دے دیں جَلا دے کفر و اِلحاد`, m2: `کہ تو محیٖی ہے تو قاتل ہے یا غوث` },
    { m1: `تِرا وقت اور پڑے یوں دین پر وقت`, m2: `نہ تو عاجز نہ تو غافل ہے یا غوث` },
    { m1: `رہی ہاں شامتِ اعمال یہ بھی`, m2: `جو تو چاہے ابھی زائل ہے یا غوث` },
    { m1: `غَیُورا! اپنی غیرت کا تَصَدُّق`, m2: `وہی کر جو تِرے قابل ہے یا غوث` },
    { m1: `خدا را مرہمِ خاکِ قدم دے`, m2: `جگر زخمی ہے دل گھائل ہے یا غوث` },
    { m1: `نہ دیکھوں شکلِ مشکل تیرے آگے`, m2: `کوئی مشکل سی یہ مشکل ہے یا غوث` },
    { m1: `وہ گھیرا رشتۂ شرکِ خَفی نے`, m2: `پھنسا زُنّار میں یہ دل ہے یا غوث` },
    { m1: `کیے تَرسا و گَبْر اَقطاب و اَبدال`, m2: `یہ محض اسلام کا سائل ہے یا غوث` },
    { m1: `تو قُوَّت دے میں تنہا کام بِسیار`, m2: `بدن کمزور دل کاہل ہے یا غوث` },
    { m1: `عَدُوّ بد دین مذہب والے حاسد`, m2: `تو ہی تنہا کا زورِ دل ہے یا غوث` },
    { m1: `حسد سے ان کے سینے پاک کر دے`, m2: `کہ بَدتر دِق سے بھی یہ سِل ہے یا غوث` },
    { m1: `غذائے دِق یہی خوں اُستخواں گوشت`, m2: `یہ آتِش دین کی آکِل ہے یا غوث` },
    { m1: `دیا مجھ کو انھیں محروم چھوڑا`, m2: `مِرا کیا جرم حق فاصل ہے یا غوث` },
    { m1: `خدا سے لیں لڑائی وہ ہے مُعطِی`, m2: `نبی قاسم ہے تو مُوصِل ہے یا غوث` },
    { m1: `عطائیں مُقْتَدِر غَفَّار کی ہیں`, m2: `عَبَث بندوں کے دل میں غِلّ ہے یا غوث` },
    { m1: `تِرے بابا کا پھر تیرا کرم ہے`, m2: `یہ منھ ورنہ کسی قابل ہے یا غوث` },
    { m1: `بھَرَن والے تِرا جھالا تو جھالا`, m2: `تِرا چھینٹا مِرا غاسِل ہے یا غوث` },
    { m1: `ثَنا مَقْصود ہے عَرضِ غَرض کیا`, m2: `غرض کا آپ تو کافِل ہے یا غوث` },
    { m1: `رضاؔ کا خاتِمہ بالخیر ہو گا`, m2: `تِری رحمت اگر شامل ہے یا غوث` },
  ],
  versesHi: [],
};

export default kalam;
